[{"lineNumber": 8, "col_offset": 0, "nodeName": "rand_spatial_coordinates", "type": "Callable[[Any, Any, Any, Any], Any]"}, {"lineNumber": 20, "col_offset": 21, "nodeName": "BaseSampler", "type": "Any"}, {"lineNumber": 38, "col_offset": 4, "nodeName": "layer_op", "type": "Callable[..., Any]"}, {"lineNumber": 12, "col_offset": 4, "nodeName": "all_coords", "type": "Any"}, {"lineNumber": 13, "col_offset": 8, "nodeName": "i", "type": "int"}, {"lineNumber": 17, "col_offset": 11, "nodeName": "all_coords", "type": "Any"}, {"lineNumber": 9, "col_offset": 11, "nodeName": "all", "type": "Any"}, {"lineNumber": 12, "col_offset": 17, "nodeName": "zeros", "type": "Any"}, {"lineNumber": 13, "col_offset": 13, "nodeName": "range", "type": "Callable[..., List[int]]"}, {"lineNumber": 13, "col_offset": 22, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 34, "col_offset": 8, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 34, "col_offset": 29, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 35, "col_offset": 8, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 35, "col_offset": 32, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 36, "col_offset": 8, "nodeName": "volume_padding_size", "type": "Any"}, {"lineNumber": 36, "col_offset": 35, "nodeName": "volume_padding_size", "type": "Any"}, {"lineNumber": 48, "col_offset": 8, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 48, "col_offset": 23, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 49, "col_offset": 14, "nodeName": "has_next", "type": "Any"}, {"lineNumber": 9, "col_offset": 11, "nodeName": "np", "type": "module"}, {"lineNumber": 12, "col_offset": 17, "nodeName": "np", "type": "module"}, {"lineNumber": 12, "col_offset": 27, "nodeName": "n_samples", "type": "Any"}, {"lineNumber": 12, "col_offset": 63, "nodeName": "int", "type": "Any"}, {"lineNumber": 14, "col_offset": 27, "nodeName": "random_integers", "type": "Any"}, {"lineNumber": 15, "col_offset": 47, "nodeName": "n_samples", "type": "Any"}, {"lineNumber": 16, "col_offset": 8, "nodeName": "all_coords", "type": "Any"}, {"lineNumber": 16, "col_offset": 61, "nodeName": "win_size", "type": "Any"}, {"lineNumber": 33, "col_offset": 8, "nodeName": "__init__", "type": "Any"}, {"lineNumber": 34, "col_offset": 8, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 35, "col_offset": 8, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 36, "col_offset": 8, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 48, "col_offset": 23, "nodeName": "patch", "type": "Any"}, {"lineNumber": 49, "col_offset": 14, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 80, "col_offset": 16, "nodeName": "loc", "type": "Any"}, {"lineNumber": 80, "col_offset": 23, "nodeName": "locations", "type": "Any"}, {"lineNumber": 9, "col_offset": 19, "nodeName": "d", "type": "Any"}, {"lineNumber": 9, "col_offset": 24, "nodeName": "win_size", "type": "Any"}, {"lineNumber": 9, "col_offset": 37, "nodeName": "d", "type": "Any"}, {"lineNumber": 12, "col_offset": 38, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 12, "col_offset": 63, "nodeName": "np", "type": "module"}, {"lineNumber": 14, "col_offset": 27, "nodeName": "random", "type": "Any"}, {"lineNumber": 15, "col_offset": 15, "nodeName": "max", "type": "Callable"}, {"lineNumber": 16, "col_offset": 42, "nodeName": "all_coords", "type": "Any"}, {"lineNumber": 33, "col_offset": 51, "nodeName": "patch", "type": "Any"}, {"lineNumber": 33, "col_offset": 63, "nodeName": "name", "type": "Any"}, {"lineNumber": 48, "col_offset": 23, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 49, "col_offset": 14, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 50, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 50, "col_offset": 17, "nodeName": "seg", "type": "Any"}, {"lineNumber": 50, "col_offset": 22, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 50, "col_offset": 34, "nodeName": "idx", "type": "Any"}, {"lineNumber": 50, "col_offset": 40, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 53, "col_offset": 19, "nodeName": "check_spatial_dims", "type": "Callable[[Any, Any, Any], Any]"}, {"lineNumber": 53, "col_offset": 41, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 53, "col_offset": 55, "nodeName": "img", "type": "Any"}, {"lineNumber": 53, "col_offset": 60, "nodeName": "seg", "type": "Any"}, {"lineNumber": 54, "col_offset": 19, "nodeName": "check_spatial_dims", "type": "Callable[[Any, Any, Any], Any]"}, {"lineNumber": 54, "col_offset": 41, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 54, "col_offset": 55, "nodeName": "img", "type": "Any"}, {"lineNumber": 54, "col_offset": 60, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 56, "col_offset": 18, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 57, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 57, "col_offset": 21, "nodeName": "full_image_shape", "type": "Any"}, {"lineNumber": 58, "col_offset": 18, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 59, "col_offset": 16, "nodeName": "seg", "type": "Any"}, {"lineNumber": 59, "col_offset": 21, "nodeName": "full_label_shape", "type": "Any"}, {"lineNumber": 60, "col_offset": 25, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 61, "col_offset": 16, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 61, "col_offset": 28, "nodeName": "full_weight_map_shape", "type": "Any"}, {"lineNumber": 63, "col_offset": 22, "nodeName": "NotImplementedError", "type": "Type[NotImplementedError]"}, {"lineNumber": 66, "col_offset": 15, "nodeName": "volume_padding_size", "type": "Any"}, {"lineNumber": 75, "col_offset": 24, "nodeName": "rand_spatial_coordinates", "type": "Callable[[Any, Any, Any, Any], Any]"}, {"lineNumber": 75, "col_offset": 49, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 76, "col_offset": 48, "nodeName": "shape", "type": "Any"}, {"lineNumber": 77, "col_offset": 48, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 78, "col_offset": 48, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 9, "col_offset": 42, "nodeName": "img_size", "type": "Any"}, {"lineNumber": 14, "col_offset": 27, "nodeName": "np", "type": "module"}, {"lineNumber": 15, "col_offset": 33, "nodeName": "win_size", "type": "Any"}, {"lineNumber": 33, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 33, "col_offset": 14, "nodeName": "UniformSampler", "type": "Type[UniformSampler]"}, {"lineNumber": 33, "col_offset": 30, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 50, "col_offset": 40, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 53, "col_offset": 19, "nodeName": "io", "type": "module"}, {"lineNumber": 54, "col_offset": 19, "nodeName": "io", "type": "module"}, {"lineNumber": 56, "col_offset": 18, "nodeName": "io", "type": "module"}, {"lineNumber": 57, "col_offset": 21, "nodeName": "patch", "type": "Any"}, {"lineNumber": 58, "col_offset": 18, "nodeName": "io", "type": "module"}, {"lineNumber": 59, "col_offset": 21, "nodeName": "patch", "type": "Any"}, {"lineNumber": 60, "col_offset": 25, "nodeName": "io", "type": "module"}, {"lineNumber": 61, "col_offset": 28, "nodeName": "patch", "type": "Any"}, {"lineNumber": 62, "col_offset": 15, "nodeName": "ndim", "type": "Any"}, {"lineNumber": 62, "col_offset": 26, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 66, "col_offset": 15, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 67, "col_offset": 22, "nodeName": "volume_spatial_padding", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 68, "col_offset": 20, "nodeName": "img", "type": "Any"}, {"lineNumber": 68, "col_offset": 25, "nodeName": "volume_padding_size", "type": "Any"}, {"lineNumber": 69, "col_offset": 22, "nodeName": "volume_spatial_padding", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 70, "col_offset": 20, "nodeName": "seg", "type": "Any"}, {"lineNumber": 70, "col_offset": 25, "nodeName": "volume_padding_size", "type": "Any"}, {"lineNumber": 71, "col_offset": 29, "nodeName": "volume_spatial_padding", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 72, "col_offset": 20, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 72, "col_offset": 32, "nodeName": "volume_padding_size", "type": "Any"}, {"lineNumber": 76, "col_offset": 48, "nodeName": "img", "type": "Any"}, {"lineNumber": 77, "col_offset": 48, "nodeName": "patch", "type": "Any"}, {"lineNumber": 78, "col_offset": 48, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 81, "col_offset": 34, "nodeName": "array", "type": "Callable[..., numpy.ndarray]"}, {"lineNumber": 83, "col_offset": 16, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 83, "col_offset": 36, "nodeName": "idx", "type": "Any"}, {"lineNumber": 83, "col_offset": 41, "nodeName": "loc", "type": "Any"}, {"lineNumber": 83, "col_offset": 46, "nodeName": "img", "type": "Any"}, {"lineNumber": 83, "col_offset": 51, "nodeName": "seg", "type": "Any"}, {"lineNumber": 83, "col_offset": 56, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 84, "col_offset": 22, "nodeName": "patch", "type": "Any"}, {"lineNumber": 9, "col_offset": 52, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 15, "col_offset": 19, "nodeName": "img_size", "type": "Any"}, {"lineNumber": 16, "col_offset": 22, "nodeName": "i", "type": "int"}, {"lineNumber": 16, "col_offset": 26, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 16, "col_offset": 56, "nodeName": "i", "type": "int"}, {"lineNumber": 57, "col_offset": 21, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 59, "col_offset": 21, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 61, "col_offset": 28, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 62, "col_offset": 15, "nodeName": "img", "type": "Any"}, {"lineNumber": 67, "col_offset": 22, "nodeName": "io", "type": "module"}, {"lineNumber": 68, "col_offset": 25, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 69, "col_offset": 22, "nodeName": "io", "type": "module"}, {"lineNumber": 70, "col_offset": 25, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 71, "col_offset": 29, "nodeName": "io", "type": "module"}, {"lineNumber": 72, "col_offset": 32, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 77, "col_offset": 48, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 81, "col_offset": 34, "nodeName": "np", "type": "module"}, {"lineNumber": 81, "col_offset": 43, "nodeName": "hstack", "type": "Any"}, {"lineNumber": 82, "col_offset": 49, "nodeName": "int64", "type": "Any"}, {"lineNumber": 83, "col_offset": 16, "nodeName": "patch", "type": "Any"}, {"lineNumber": 84, "col_offset": 22, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 15, "col_offset": 28, "nodeName": "i", "type": "int"}, {"lineNumber": 81, "col_offset": 43, "nodeName": "np", "type": "module"}, {"lineNumber": 81, "col_offset": 61, "nodeName": "loc", "type": "Any"}, {"lineNumber": 82, "col_offset": 49, "nodeName": "np", "type": "module"}, {"lineNumber": 83, "col_offset": 16, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 81, "col_offset": 55, "nodeName": "idx", "type": "Any"}]