[{"lineNumber": 14, "col_offset": 18, "nodeName": "TestCase", "type": "Any"}, {"lineNumber": 15, "col_offset": 4, "nodeName": "test_volume_loader", "type": "Callable[[Any], Any]"}, {"lineNumber": 14, "col_offset": 18, "nodeName": "test", "type": "Any"}, {"lineNumber": 60, "col_offset": 3, "nodeName": "__name__", "type": "str"}, {"lineNumber": 14, "col_offset": 18, "nodeName": "tf", "type": "Any"}, {"lineNumber": 20, "col_offset": 8, "nodeName": "constraint_array", "type": "List[utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 48, "col_offset": 8, "nodeName": "volume_loader", "type": "engine.volume_loader.VolumeLoaderLayer"}, {"lineNumber": 61, "col_offset": 4, "nodeName": "main", "type": "Any"}, {"lineNumber": 16, "col_offset": 24, "nodeName": "KeywordsMatching", "type": "Type[utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 18, "col_offset": 27, "nodeName": "KeywordsMatching", "type": "Type[utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 20, "col_offset": 28, "nodeName": "constraint_FLAIR", "type": "utilities.filename_matching.KeywordsMatching"}, {"lineNumber": 20, "col_offset": 46, "nodeName": "constraint_T1", "type": "utilities.filename_matching.KeywordsMatching"}, {"lineNumber": 21, "col_offset": 8, "nodeName": "write_matched_filenames_to_csv", "type": "Callable[[Any, Any], None]"}, {"lineNumber": 22, "col_offset": 12, "nodeName": "constraint_array", "type": "List[utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 24, "col_offset": 27, "nodeName": "KeywordsMatching", "type": "Type[utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 26, "col_offset": 8, "nodeName": "write_matched_filenames_to_csv", "type": "Callable[[Any, Any], None]"}, {"lineNumber": 36, "col_offset": 21, "nodeName": "CSVTable", "type": "Type[utilities.csv_table.CSVTable]"}, {"lineNumber": 40, "col_offset": 20, "nodeName": "HistNorm", "type": "Type[layer.histogram_normalisation.HistogramNormalisationLayer]"}, {"lineNumber": 48, "col_offset": 24, "nodeName": "VolumeLoaderLayer", "type": "Type[engine.volume_loader.VolumeLoaderLayer]"}, {"lineNumber": 48, "col_offset": 42, "nodeName": "csv_loader", "type": "utilities.csv_table.CSVTable"}, {"lineNumber": 48, "col_offset": 54, "nodeName": "hist_norm", "type": "layer.histogram_normalisation.HistogramNormalisationLayer"}, {"lineNumber": 50, "col_offset": 8, "nodeName": "img", "type": "Any"}, {"lineNumber": 50, "col_offset": 13, "nodeName": "seg", "type": "Any"}, {"lineNumber": 50, "col_offset": 18, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 50, "col_offset": 30, "nodeName": "subject", "type": "Any"}, {"lineNumber": 50, "col_offset": 40, "nodeName": "volume_loader", "type": "engine.volume_loader.VolumeLoaderLayer"}, {"lineNumber": 51, "col_offset": 8, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 51, "col_offset": 14, "nodeName": "shape", "type": "Any"}, {"lineNumber": 52, "col_offset": 11, "nodeName": "seg", "type": "Any"}, {"lineNumber": 54, "col_offset": 8, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 54, "col_offset": 14, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 55, "col_offset": 8, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 56, "col_offset": 8, "nodeName": "img", "type": "Any"}, {"lineNumber": 56, "col_offset": 13, "nodeName": "seg", "type": "Any"}, {"lineNumber": 56, "col_offset": 18, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 56, "col_offset": 30, "nodeName": "subject", "type": "Any"}, {"lineNumber": 56, "col_offset": 40, "nodeName": "volume_loader", "type": "engine.volume_loader.VolumeLoaderLayer"}, {"lineNumber": 57, "col_offset": 8, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 57, "col_offset": 14, "nodeName": "subject", "type": "Any"}, {"lineNumber": 61, "col_offset": 4, "nodeName": "test", "type": "Any"}, {"lineNumber": 21, "col_offset": 8, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 26, "col_offset": 8, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 27, "col_offset": 13, "nodeName": "constraint_Label", "type": "utilities.filename_matching.KeywordsMatching"}, {"lineNumber": 36, "col_offset": 39, "nodeName": "csv_dict", "type": "Dict[str, Optional[str]]"}, {"lineNumber": 51, "col_offset": 14, "nodeName": "data", "type": "Any"}, {"lineNumber": 53, "col_offset": 12, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 53, "col_offset": 18, "nodeName": "shape", "type": "Any"}, {"lineNumber": 55, "col_offset": 14, "nodeName": "subject_list", "type": "Any"}, {"lineNumber": 61, "col_offset": 4, "nodeName": "tf", "type": "Any"}, {"lineNumber": 42, "col_offset": 32, "nodeName": "BinaryMaskingLayer", "type": "Type[layer.binary_masking.BinaryMaskingLayer]"}, {"lineNumber": 51, "col_offset": 14, "nodeName": "img", "type": "Any"}, {"lineNumber": 53, "col_offset": 18, "nodeName": "data", "type": "Any"}, {"lineNumber": 55, "col_offset": 14, "nodeName": "volume_loader", "type": "engine.volume_loader.VolumeLoaderLayer"}, {"lineNumber": 55, "col_offset": 41, "nodeName": "subject", "type": "Any"}, {"lineNumber": 53, "col_offset": 18, "nodeName": "seg", "type": "Any"}]