[{"lineNumber": 79, "col_offset": 0, "nodeName": "l1_loss", "type": "Callable[..., Any]"}, {"lineNumber": 97, "col_offset": 0, "nodeName": "l2_loss", "type": "Callable[..., Any]"}, {"lineNumber": 111, "col_offset": 0, "nodeName": "rmse_loss", "type": "Callable[..., Any]"}, {"lineNumber": 127, "col_offset": 0, "nodeName": "mae_loss", "type": "Callable[..., Any]"}, {"lineNumber": 143, "col_offset": 0, "nodeName": "huber_loss", "type": "Callable[..., Any]"}, {"lineNumber": 13, "col_offset": 19, "nodeName": "Layer", "type": "Type[niftynet.layer.base_layer.Layer]"}, {"lineNumber": 85, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 104, "col_offset": 4, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 154, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 155, "col_offset": 4, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 156, "col_offset": 4, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 157, "col_offset": 4, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 167, "col_offset": 4, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 22, "col_offset": 8, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 85, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 86, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 87, "col_offset": 8, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 88, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 89, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 91, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 92, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 93, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 104, "col_offset": 16, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 104, "col_offset": 28, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 104, "col_offset": 40, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 105, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 108, "col_offset": 11, "nodeName": "l2_loss", "type": "Any"}, {"lineNumber": 108, "col_offset": 25, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 118, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 119, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 120, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 121, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 134, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 135, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 136, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 137, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 154, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 155, "col_offset": 32, "nodeName": "less", "type": "Any"}, {"lineNumber": 155, "col_offset": 40, "nodeName": "delta", "type": "Any"}, {"lineNumber": 155, "col_offset": 47, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 157, "col_offset": 22, "nodeName": "delta", "type": "Any"}, {"lineNumber": 159, "col_offset": 21, "nodeName": "where", "type": "Any"}, {"lineNumber": 159, "col_offset": 30, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 160, "col_offset": 30, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 161, "col_offset": 30, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 162, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 163, "col_offset": 8, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 164, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 166, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 167, "col_offset": 15, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 167, "col_offset": 29, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 168, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 168, "col_offset": 22, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 168, "col_offset": 32, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "__init__", "type": "Callable[..., None]"}, {"lineNumber": 22, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 22, "col_offset": 31, "nodeName": "create", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 22, "col_offset": 60, "nodeName": "loss_type", "type": "Any"}, {"lineNumber": 24, "col_offset": 12, "nodeName": "loss_func_params", "type": "Any"}, {"lineNumber": 48, "col_offset": 12, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "value", "type": "Any"}, {"lineNumber": 49, "col_offset": 12, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 55, "col_offset": 12, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 85, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 85, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 85, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 85, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 87, "col_offset": 29, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 87, "col_offset": 41, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 87, "col_offset": 61, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 88, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 88, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 89, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 89, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 91, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 91, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 92, "col_offset": 22, "nodeName": "size", "type": "Any"}, {"lineNumber": 92, "col_offset": 30, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 93, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 93, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 93, "col_offset": 30, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 94, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 94, "col_offset": 30, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 104, "col_offset": 16, "nodeName": "tf", "type": "Any"}, {"lineNumber": 108, "col_offset": 11, "nodeName": "nn", "type": "Any"}, {"lineNumber": 119, "col_offset": 20, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 119, "col_offset": 32, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 119, "col_offset": 44, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 120, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 120, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 120, "col_offset": 43, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 121, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 121, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 121, "col_offset": 43, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 122, "col_offset": 15, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 124, "col_offset": 15, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 135, "col_offset": 20, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 135, "col_offset": 32, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 135, "col_offset": 44, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 136, "col_offset": 20, "nodeName": "abs", "type": "Any"}, {"lineNumber": 136, "col_offset": 27, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 137, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 137, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 137, "col_offset": 43, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 140, "col_offset": 15, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 154, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 154, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 154, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 154, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 155, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 156, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 157, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 159, "col_offset": 21, "nodeName": "tf", "type": "Any"}, {"lineNumber": 163, "col_offset": 25, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 163, "col_offset": 37, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 163, "col_offset": 53, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 164, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 164, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 166, "col_offset": 22, "nodeName": "to_float", "type": "Any"}, {"lineNumber": 167, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 168, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 19, "col_offset": 48, "nodeName": "name", "type": "Any"}, {"lineNumber": 22, "col_offset": 31, "nodeName": "LossRegressionFactory", "type": "Type[niftynet.engine.application_factory.LossRegressionFactory]"}, {"lineNumber": 24, "col_offset": 32, "nodeName": "loss_func_params", "type": "Any"}, {"lineNumber": 47, "col_offset": 13, "nodeName": "device", "type": "Any"}, {"lineNumber": 49, "col_offset": 27, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 49, "col_offset": 38, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 50, "col_offset": 15, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 51, "col_offset": 16, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 53, "col_offset": 16, "nodeName": "prediction", "type": "List[Any]"}, {"lineNumber": 56, "col_offset": 16, "nodeName": "ind", "type": "int"}, {"lineNumber": 56, "col_offset": 21, "nodeName": "pred", "type": "Any"}, {"lineNumber": 56, "col_offset": 29, "nodeName": "enumerate", "type": "Type[enumerate[Any]]"}, {"lineNumber": 56, "col_offset": 39, "nodeName": "prediction", "type": "Union[List[Any], Any]"}, {"lineNumber": 59, "col_offset": 16, "nodeName": "loss_batch", "type": "List[Any]"}, {"lineNumber": 76, "col_offset": 19, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 76, "col_offset": 34, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 85, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 87, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 88, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 89, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 91, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 92, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 93, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 93, "col_offset": 51, "nodeName": "float32", "type": "Any"}, {"lineNumber": 94, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 94, "col_offset": 49, "nodeName": "float32", "type": "Any"}, {"lineNumber": 107, "col_offset": 12, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 107, "col_offset": 24, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 107, "col_offset": 35, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 107, "col_offset": 49, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 107, "col_offset": 63, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 108, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 119, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 120, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 121, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 122, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 124, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 124, "col_offset": 23, "nodeName": "mean_squared_error", "type": "Any"}, {"lineNumber": 124, "col_offset": 52, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 124, "col_offset": 64, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 135, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 136, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 137, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 138, "col_offset": 15, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 138, "col_offset": 30, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 138, "col_offset": 43, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 138, "col_offset": 58, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 140, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 140, "col_offset": 30, "nodeName": "abs", "type": "Any"}, {"lineNumber": 154, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 157, "col_offset": 52, "nodeName": "delta", "type": "Any"}, {"lineNumber": 163, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 164, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 166, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 166, "col_offset": 34, "nodeName": "size", "type": "Any"}, {"lineNumber": 166, "col_offset": 42, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 19, "col_offset": 14, "nodeName": "LossFunction", "type": "Type[LossFunction]"}, {"lineNumber": 19, "col_offset": 28, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 47, "col_offset": 13, "nodeName": "tf", "type": "Any"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "shape", "type": "Any"}, {"lineNumber": 49, "col_offset": 27, "nodeName": "tf", "type": "Any"}, {"lineNumber": 49, "col_offset": 53, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 51, "col_offset": 29, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 51, "col_offset": 40, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 52, "col_offset": 19, "nodeName": "isinstance", "type": "Callable[[Any, Union[Type[Any], Tuple[Union[Type[Any], Tuple[Type[Any], ...]], ...]]], bool]"}, {"lineNumber": 52, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 53, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 60, "col_offset": 20, "nodeName": "b_ind", "type": "int"}, {"lineNumber": 60, "col_offset": 27, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 60, "col_offset": 37, "nodeName": "enumerate", "type": "Type[enumerate[Any]]"}, {"lineNumber": 63, "col_offset": 20, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 64, "col_offset": 20, "nodeName": "ground_truth_b", "type": "Any"}, {"lineNumber": 65, "col_offset": 20, "nodeName": "weight_b", "type": "Any"}, {"lineNumber": 71, "col_offset": 23, "nodeName": "_loss_func_params", "type": "Union[Any, Dict[nothing, nothing]]"}, {"lineNumber": 75, "col_offset": 16, "nodeName": "append", "type": "Callable"}, {"lineNumber": 76, "col_offset": 19, "nodeName": "tf", "type": "Any"}, {"lineNumber": 93, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 94, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 107, "col_offset": 12, "nodeName": "tf", "type": "Any"}, {"lineNumber": 107, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 122, "col_offset": 23, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 122, "col_offset": 38, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 122, "col_offset": 51, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 122, "col_offset": 66, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 124, "col_offset": 23, "nodeName": "losses", "type": "Any"}, {"lineNumber": 138, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 138, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 140, "col_offset": 30, "nodeName": "tf", "type": "Any"}, {"lineNumber": 140, "col_offset": 37, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 140, "col_offset": 49, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 140, "col_offset": 61, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 166, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 51, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 51, "col_offset": 53, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 52, "col_offset": 43, "nodeName": "list", "type": "Type[List[Any]]"}, {"lineNumber": 52, "col_offset": 49, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 60, "col_offset": 47, "nodeName": "unstack", "type": "Any"}, {"lineNumber": 60, "col_offset": 58, "nodeName": "pred", "type": "Any"}, {"lineNumber": 63, "col_offset": 29, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 63, "col_offset": 40, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 64, "col_offset": 37, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 68, "col_offset": 38, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 69, "col_offset": 40, "nodeName": "ground_truth_b", "type": "Any"}, {"lineNumber": 70, "col_offset": 38, "nodeName": "weight_b", "type": "Any"}, {"lineNumber": 71, "col_offset": 23, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 74, "col_offset": 20, "nodeName": "append", "type": "Callable"}, {"lineNumber": 75, "col_offset": 16, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 75, "col_offset": 33, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 75, "col_offset": 48, "nodeName": "loss_batch", "type": "List[Any]"}, {"lineNumber": 122, "col_offset": 23, "nodeName": "tf", "type": "Any"}, {"lineNumber": 122, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 124, "col_offset": 23, "nodeName": "tf", "type": "Any"}, {"lineNumber": 140, "col_offset": 37, "nodeName": "tf", "type": "Any"}, {"lineNumber": 60, "col_offset": 47, "nodeName": "tf", "type": "Any"}, {"lineNumber": 63, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 64, "col_offset": 50, "nodeName": "b_ind", "type": "int"}, {"lineNumber": 65, "col_offset": 39, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 65, "col_offset": 63, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 72, "col_offset": 24, "nodeName": "update", "type": "Callable"}, {"lineNumber": 72, "col_offset": 43, "nodeName": "_loss_func_params", "type": "Union[Any, Dict[nothing, nothing]]"}, {"lineNumber": 74, "col_offset": 20, "nodeName": "loss_batch", "type": "List[Any]"}, {"lineNumber": 74, "col_offset": 38, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 75, "col_offset": 33, "nodeName": "tf", "type": "Any"}, {"lineNumber": 65, "col_offset": 74, "nodeName": "b_ind", "type": "int"}, {"lineNumber": 72, "col_offset": 24, "nodeName": "loss_params", "type": "Dict[Union[str, Any], Any]"}, {"lineNumber": 72, "col_offset": 43, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 74, "col_offset": 38, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 74, "col_offset": 61, "nodeName": "loss_params", "type": "Dict[Union[str, Any], Any]"}]