[{"lineNumber": 54, "col_offset": 0, "nodeName": "l1_loss", "type": "Callable[..., Any]"}, {"lineNumber": 72, "col_offset": 0, "nodeName": "l2_loss", "type": "Callable[..., Any]"}, {"lineNumber": 84, "col_offset": 0, "nodeName": "mse_loss", "type": "Callable[..., Any]"}, {"lineNumber": 93, "col_offset": 0, "nodeName": "huber_loss", "type": "Callable[..., Any]"}, {"lineNumber": 10, "col_offset": 19, "nodeName": "Layer", "type": "Type[niftynet.layer.base_layer.Layer]"}, {"lineNumber": 60, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 78, "col_offset": 4, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 103, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 104, "col_offset": 4, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 105, "col_offset": 4, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 106, "col_offset": 4, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 116, "col_offset": 4, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 120, "col_offset": 27, "nodeName": "l1_loss", "type": "Callable[..., Any]"}, {"lineNumber": 121, "col_offset": 27, "nodeName": "l2_loss", "type": "Callable[..., Any]"}, {"lineNumber": 122, "col_offset": 24, "nodeName": "mse_loss", "type": "Callable[..., Any]"}, {"lineNumber": 123, "col_offset": 26, "nodeName": "huber_loss", "type": "Callable[..., Any]"}, {"lineNumber": 18, "col_offset": 8, "nodeName": "_loss_func_params", "type": "Any"}, {"lineNumber": 18, "col_offset": 33, "nodeName": "loss_func_params", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "_data_loss_func", "type": "None"}, {"lineNumber": 23, "col_offset": 8, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 60, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 61, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 62, "col_offset": 8, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 63, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 64, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 66, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 67, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 68, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 78, "col_offset": 16, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 78, "col_offset": 28, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 78, "col_offset": 40, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 79, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 80, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 81, "col_offset": 11, "nodeName": "l2_loss", "type": "Any"}, {"lineNumber": 81, "col_offset": 25, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 90, "col_offset": 11, "nodeName": "mean_squared_error", "type": "Any"}, {"lineNumber": 90, "col_offset": 40, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 90, "col_offset": 51, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 103, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 104, "col_offset": 32, "nodeName": "less", "type": "Any"}, {"lineNumber": 104, "col_offset": 40, "nodeName": "delta", "type": "Any"}, {"lineNumber": 104, "col_offset": 47, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 106, "col_offset": 22, "nodeName": "delta", "type": "Any"}, {"lineNumber": 108, "col_offset": 21, "nodeName": "where", "type": "Any"}, {"lineNumber": 108, "col_offset": 30, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 109, "col_offset": 30, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 110, "col_offset": 30, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 111, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 112, "col_offset": 8, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 113, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 115, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 116, "col_offset": 15, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 116, "col_offset": 29, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 117, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 117, "col_offset": 22, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 117, "col_offset": 32, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 17, "col_offset": 8, "nodeName": "__init__", "type": "Callable[..., None]"}, {"lineNumber": 18, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 20, "col_offset": 8, "nodeName": "make_callable_loss_func", "type": "Callable[[Any], Any]"}, {"lineNumber": 20, "col_offset": 37, "nodeName": "loss_type", "type": "Any"}, {"lineNumber": 23, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 23, "col_offset": 31, "nodeName": "create", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 23, "col_offset": 60, "nodeName": "type_str", "type": "Any"}, {"lineNumber": 37, "col_offset": 12, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 38, "col_offset": 12, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 42, "col_offset": 12, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 44, "col_offset": 15, "nodeName": "_loss_func_params", "type": "Any"}, {"lineNumber": 60, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 60, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 60, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 60, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 62, "col_offset": 29, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 62, "col_offset": 41, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 62, "col_offset": 61, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 63, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 63, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 64, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 64, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 66, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 66, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 67, "col_offset": 22, "nodeName": "size", "type": "Any"}, {"lineNumber": 67, "col_offset": 30, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 68, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 68, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 68, "col_offset": 30, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 69, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 69, "col_offset": 30, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 78, "col_offset": 16, "nodeName": "tf", "type": "Any"}, {"lineNumber": 80, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 80, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 80, "col_offset": 43, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 81, "col_offset": 11, "nodeName": "nn", "type": "Any"}, {"lineNumber": 90, "col_offset": 11, "nodeName": "losses", "type": "Any"}, {"lineNumber": 103, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 103, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 103, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 103, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 104, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 105, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 106, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 108, "col_offset": 21, "nodeName": "tf", "type": "Any"}, {"lineNumber": 112, "col_offset": 25, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 112, "col_offset": 37, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 112, "col_offset": 53, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 113, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 113, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 115, "col_offset": 22, "nodeName": "to_float", "type": "Any"}, {"lineNumber": 116, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 117, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 17, "col_offset": 48, "nodeName": "name", "type": "Any"}, {"lineNumber": 20, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 23, "col_offset": 31, "nodeName": "LossRegressionFactory", "type": "Type[niftynet.engine.application_factory.LossRegressionFactory]"}, {"lineNumber": 31, "col_offset": 13, "nodeName": "device", "type": "Any"}, {"lineNumber": 32, "col_offset": 15, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 33, "col_offset": 16, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 36, "col_offset": 16, "nodeName": "prediction", "type": "List[Any]"}, {"lineNumber": 37, "col_offset": 27, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 37, "col_offset": 38, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 38, "col_offset": 25, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 38, "col_offset": 36, "nodeName": "prediction", "type": "Union[List[Any], Any]"}, {"lineNumber": 39, "col_offset": 15, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 40, "col_offset": 16, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 44, "col_offset": 15, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 51, "col_offset": 19, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 51, "col_offset": 34, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 60, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 62, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 63, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 64, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 66, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 67, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 68, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 68, "col_offset": 51, "nodeName": "float32", "type": "Any"}, {"lineNumber": 69, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 69, "col_offset": 49, "nodeName": "float32", "type": "Any"}, {"lineNumber": 80, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 81, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 90, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 103, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 106, "col_offset": 52, "nodeName": "delta", "type": "Any"}, {"lineNumber": 112, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 113, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 115, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 115, "col_offset": 34, "nodeName": "size", "type": "Any"}, {"lineNumber": 115, "col_offset": 42, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 17, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 17, "col_offset": 14, "nodeName": "LossFunction", "type": "Type[LossFunction]"}, {"lineNumber": 17, "col_offset": 28, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 31, "col_offset": 13, "nodeName": "tf", "type": "Any"}, {"lineNumber": 33, "col_offset": 31, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 33, "col_offset": 42, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 35, "col_offset": 19, "nodeName": "isinstance", "type": "Callable[[Any, Union[Type[Any], Tuple[Union[Type[Any], Tuple[Type[Any], ...]], ...]]], bool]"}, {"lineNumber": 35, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 36, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 37, "col_offset": 27, "nodeName": "tf", "type": "Any"}, {"lineNumber": 38, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 40, "col_offset": 29, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 40, "col_offset": 40, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 45, "col_offset": 16, "nodeName": "append", "type": "Callable"}, {"lineNumber": 49, "col_offset": 16, "nodeName": "append", "type": "Callable"}, {"lineNumber": 51, "col_offset": 19, "nodeName": "tf", "type": "Any"}, {"lineNumber": 68, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 69, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 115, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 33, "col_offset": 31, "nodeName": "tf", "type": "Any"}, {"lineNumber": 35, "col_offset": 43, "nodeName": "list", "type": "Type[List[Any]]"}, {"lineNumber": 35, "col_offset": 49, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 40, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 45, "col_offset": 16, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 45, "col_offset": 33, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 46, "col_offset": 20, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 46, "col_offset": 32, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 46, "col_offset": 46, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 49, "col_offset": 16, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 49, "col_offset": 33, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 50, "col_offset": 20, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 50, "col_offset": 32, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 50, "col_offset": 46, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 45, "col_offset": 33, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 47, "col_offset": 22, "nodeName": "_loss_func_params", "type": "Any"}, {"lineNumber": 49, "col_offset": 33, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 47, "col_offset": 22, "nodeName": "self", "type": "LossFunction"}]