[{"lineNumber": 9, "col_offset": 21, "nodeName": "BaseSampler", "type": "Any"}, {"lineNumber": 23, "col_offset": 4, "nodeName": "layer_op", "type": "Callable[..., Any]"}, {"lineNumber": 20, "col_offset": 8, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 20, "col_offset": 29, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 21, "col_offset": 8, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 21, "col_offset": 32, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 49, "col_offset": 12, "nodeName": "i", "type": "int"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "__init__", "type": "Any"}, {"lineNumber": 20, "col_offset": 8, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 21, "col_offset": 8, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 49, "col_offset": 17, "nodeName": "range", "type": "Type[xrange]"}, {"lineNumber": 53, "col_offset": 16, "nodeName": "t", "type": "int"}, {"lineNumber": 19, "col_offset": 51, "nodeName": "patch", "type": "Any"}, {"lineNumber": 19, "col_offset": 63, "nodeName": "name", "type": "Any"}, {"lineNumber": 50, "col_offset": 12, "nodeName": "idx", "type": "Any"}, {"lineNumber": 50, "col_offset": 17, "nodeName": "img", "type": "Any"}, {"lineNumber": 50, "col_offset": 22, "nodeName": "seg", "type": "Any"}, {"lineNumber": 50, "col_offset": 27, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 50, "col_offset": 40, "nodeName": "next_subject", "type": "Any"}, {"lineNumber": 51, "col_offset": 23, "nodeName": "rand_window_location_3d", "type": "Callable[[Any, Any, Any], Any]"}, {"lineNumber": 52, "col_offset": 20, "nodeName": "shape", "type": "Any"}, {"lineNumber": 52, "col_offset": 31, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 52, "col_offset": 54, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 53, "col_offset": 21, "nodeName": "range", "type": "Type[xrange]"}, {"lineNumber": 53, "col_offset": 27, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 19, "col_offset": 14, "nodeName": "UniformSampler", "type": "Type[UniformSampler]"}, {"lineNumber": 19, "col_offset": 30, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 49, "col_offset": 27, "nodeName": "len", "type": "Callable[[Sized], int]"}, {"lineNumber": 49, "col_offset": 31, "nodeName": "subject_list", "type": "Any"}, {"lineNumber": 50, "col_offset": 40, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 51, "col_offset": 23, "nodeName": "dataug", "type": "module"}, {"lineNumber": 52, "col_offset": 20, "nodeName": "img", "type": "Any"}, {"lineNumber": 52, "col_offset": 31, "nodeName": "patch", "type": "Any"}, {"lineNumber": 52, "col_offset": 54, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 53, "col_offset": 27, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 54, "col_offset": 19, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 57, "col_offset": 20, "nodeName": "image", "type": "Any"}, {"lineNumber": 60, "col_offset": 23, "nodeName": "has_labels", "type": "Any"}, {"lineNumber": 70, "col_offset": 23, "nodeName": "has_weight_maps", "type": "Any"}, {"lineNumber": 49, "col_offset": 31, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 50, "col_offset": 40, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 52, "col_offset": 31, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 54, "col_offset": 19, "nodeName": "patch", "type": "Any"}, {"lineNumber": 55, "col_offset": 20, "nodeName": "x_", "type": "Any"}, {"lineNumber": 55, "col_offset": 24, "nodeName": "_x", "type": "Any"}, {"lineNumber": 55, "col_offset": 28, "nodeName": "y_", "type": "Any"}, {"lineNumber": 55, "col_offset": 32, "nodeName": "_y", "type": "Any"}, {"lineNumber": 55, "col_offset": 36, "nodeName": "z_", "type": "Any"}, {"lineNumber": 55, "col_offset": 40, "nodeName": "_z", "type": "Any"}, {"lineNumber": 55, "col_offset": 45, "nodeName": "location", "type": "Any"}, {"lineNumber": 57, "col_offset": 20, "nodeName": "patch", "type": "Any"}, {"lineNumber": 57, "col_offset": 39, "nodeName": "img", "type": "Any"}, {"lineNumber": 58, "col_offset": 38, "nodeName": "array", "type": "Callable[..., numpy.ndarray]"}, {"lineNumber": 60, "col_offset": 23, "nodeName": "patch", "type": "Any"}, {"lineNumber": 70, "col_offset": 23, "nodeName": "patch", "type": "Any"}, {"lineNumber": 78, "col_offset": 26, "nodeName": "patch", "type": "Any"}, {"lineNumber": 80, "col_offset": 21, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 81, "col_offset": 26, "nodeName": "NotImplementedError", "type": "Type[NotImplementedError]"}, {"lineNumber": 49, "col_offset": 31, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 54, "col_offset": 19, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 55, "col_offset": 54, "nodeName": "t", "type": "int"}, {"lineNumber": 57, "col_offset": 20, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 58, "col_offset": 38, "nodeName": "np", "type": "module"}, {"lineNumber": 58, "col_offset": 48, "nodeName": "idx", "type": "Any"}, {"lineNumber": 58, "col_offset": 53, "nodeName": "x_", "type": "Any"}, {"lineNumber": 58, "col_offset": 57, "nodeName": "y_", "type": "Any"}, {"lineNumber": 58, "col_offset": 61, "nodeName": "z_", "type": "Any"}, {"lineNumber": 58, "col_offset": 65, "nodeName": "_x", "type": "Any"}, {"lineNumber": 58, "col_offset": 69, "nodeName": "_y", "type": "Any"}, {"lineNumber": 58, "col_offset": 73, "nodeName": "_z", "type": "Any"}, {"lineNumber": 59, "col_offset": 53, "nodeName": "int64", "type": "Any"}, {"lineNumber": 60, "col_offset": 23, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 61, "col_offset": 33, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 62, "col_offset": 33, "nodeName": "label_size", "type": "Any"}, {"lineNumber": 63, "col_offset": 31, "nodeName": "border", "type": "Any"}, {"lineNumber": 64, "col_offset": 24, "nodeName": "x_b", "type": "Any"}, {"lineNumber": 64, "col_offset": 29, "nodeName": "y_b", "type": "Any"}, {"lineNumber": 64, "col_offset": 34, "nodeName": "z_b", "type": "Any"}, {"lineNumber": 65, "col_offset": 43, "nodeName": "seg", "type": "Any"}, {"lineNumber": 70, "col_offset": 23, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 71, "col_offset": 33, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 72, "col_offset": 33, "nodeName": "weight_map_size", "type": "Any"}, {"lineNumber": 73, "col_offset": 24, "nodeName": "x_b", "type": "Any"}, {"lineNumber": 73, "col_offset": 29, "nodeName": "y_b", "type": "Any"}, {"lineNumber": 73, "col_offset": 34, "nodeName": "z_b", "type": "Any"}, {"lineNumber": 74, "col_offset": 48, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 78, "col_offset": 26, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 80, "col_offset": 21, "nodeName": "patch", "type": "Any"}, {"lineNumber": 57, "col_offset": 43, "nodeName": "x_", "type": "Any"}, {"lineNumber": 57, "col_offset": 46, "nodeName": "_x", "type": "Any"}, {"lineNumber": 57, "col_offset": 50, "nodeName": "y_", "type": "Any"}, {"lineNumber": 57, "col_offset": 53, "nodeName": "_y", "type": "Any"}, {"lineNumber": 57, "col_offset": 57, "nodeName": "z_", "type": "Any"}, {"lineNumber": 57, "col_offset": 60, "nodeName": "_z", "type": "Any"}, {"lineNumber": 59, "col_offset": 53, "nodeName": "np", "type": "module"}, {"lineNumber": 61, "col_offset": 33, "nodeName": "patch", "type": "Any"}, {"lineNumber": 62, "col_offset": 33, "nodeName": "patch", "type": "Any"}, {"lineNumber": 64, "col_offset": 41, "nodeName": "x_", "type": "Any"}, {"lineNumber": 64, "col_offset": 44, "nodeName": "border", "type": "Any"}, {"lineNumber": 64, "col_offset": 54, "nodeName": "y_", "type": "Any"}, {"lineNumber": 64, "col_offset": 57, "nodeName": "border", "type": "Any"}, {"lineNumber": 64, "col_offset": 67, "nodeName": "z_", "type": "Any"}, {"lineNumber": 64, "col_offset": 70, "nodeName": "border", "type": "Any"}, {"lineNumber": 71, "col_offset": 33, "nodeName": "patch", "type": "Any"}, {"lineNumber": 72, "col_offset": 33, "nodeName": "patch", "type": "Any"}, {"lineNumber": 73, "col_offset": 41, "nodeName": "x_", "type": "Any"}, {"lineNumber": 73, "col_offset": 44, "nodeName": "border", "type": "Any"}, {"lineNumber": 73, "col_offset": 54, "nodeName": "y_", "type": "Any"}, {"lineNumber": 73, "col_offset": 57, "nodeName": "border", "type": "Any"}, {"lineNumber": 73, "col_offset": 67, "nodeName": "z_", "type": "Any"}, {"lineNumber": 73, "col_offset": 70, "nodeName": "border", "type": "Any"}, {"lineNumber": 80, "col_offset": 21, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 61, "col_offset": 33, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 62, "col_offset": 33, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 66, "col_offset": 32, "nodeName": "x_b", "type": "Any"}, {"lineNumber": 67, "col_offset": 32, "nodeName": "y_b", "type": "Any"}, {"lineNumber": 68, "col_offset": 32, "nodeName": "z_b", "type": "Any"}, {"lineNumber": 71, "col_offset": 33, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 72, "col_offset": 33, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 75, "col_offset": 32, "nodeName": "x_b", "type": "Any"}, {"lineNumber": 76, "col_offset": 32, "nodeName": "y_b", "type": "Any"}, {"lineNumber": 77, "col_offset": 32, "nodeName": "z_b", "type": "Any"}, {"lineNumber": 66, "col_offset": 39, "nodeName": "label_size", "type": "Any"}, {"lineNumber": 66, "col_offset": 63, "nodeName": "x_b", "type": "Any"}, {"lineNumber": 67, "col_offset": 39, "nodeName": "label_size", "type": "Any"}, {"lineNumber": 67, "col_offset": 63, "nodeName": "y_b", "type": "Any"}, {"lineNumber": 68, "col_offset": 39, "nodeName": "label_size", "type": "Any"}, {"lineNumber": 68, "col_offset": 63, "nodeName": "z_b", "type": "Any"}, {"lineNumber": 75, "col_offset": 39, "nodeName": "weight_map_size", "type": "Any"}, {"lineNumber": 75, "col_offset": 68, "nodeName": "x_b", "type": "Any"}, {"lineNumber": 76, "col_offset": 39, "nodeName": "weight_map_size", "type": "Any"}, {"lineNumber": 76, "col_offset": 68, "nodeName": "y_b", "type": "Any"}, {"lineNumber": 77, "col_offset": 39, "nodeName": "weight_map_size", "type": "Any"}, {"lineNumber": 77, "col_offset": 68, "nodeName": "z_b", "type": "Any"}, {"lineNumber": 66, "col_offset": 39, "nodeName": "patch", "type": "Any"}, {"lineNumber": 67, "col_offset": 39, "nodeName": "patch", "type": "Any"}, {"lineNumber": 68, "col_offset": 39, "nodeName": "patch", "type": "Any"}, {"lineNumber": 75, "col_offset": 39, "nodeName": "patch", "type": "Any"}, {"lineNumber": 76, "col_offset": 39, "nodeName": "patch", "type": "Any"}, {"lineNumber": 77, "col_offset": 39, "nodeName": "patch", "type": "Any"}, {"lineNumber": 66, "col_offset": 39, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 67, "col_offset": 39, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 68, "col_offset": 39, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 75, "col_offset": 39, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 76, "col_offset": 39, "nodeName": "self", "type": "UniformSampler"}, {"lineNumber": 77, "col_offset": 39, "nodeName": "self", "type": "UniformSampler"}]