[{"lineNumber": 24, "col_offset": 0, "nodeName": "SUPPORTED_SPATIAL_RANKS", "type": "Set[float]"}, {"lineNumber": 28, "col_offset": 17, "nodeName": "object", "type": "Type[object]"}, {"lineNumber": 79, "col_offset": 4, "nodeName": "spatial_rank", "type": "Callable[[Any], Any]"}, {"lineNumber": 86, "col_offset": 4, "nodeName": "has_labels", "type": "Callable[[Any], Any]"}, {"lineNumber": 91, "col_offset": 4, "nodeName": "has_weight_maps", "type": "Callable[[Any], Any]"}, {"lineNumber": 96, "col_offset": 4, "nodeName": "image_size", "type": "Callable[[Any], Any]"}, {"lineNumber": 100, "col_offset": 4, "nodeName": "label_size", "type": "Callable[[Any], Any]"}, {"lineNumber": 106, "col_offset": 4, "nodeName": "weight_map_size", "type": "Callable[[Any], Any]"}, {"lineNumber": 112, "col_offset": 4, "nodeName": "full_image_shape", "type": "Callable[[Any], Any]"}, {"lineNumber": 122, "col_offset": 4, "nodeName": "full_label_shape", "type": "Callable[[Any], Any]"}, {"lineNumber": 131, "col_offset": 4, "nodeName": "full_weight_map_shape", "type": "Callable[[Any], Any]"}, {"lineNumber": 140, "col_offset": 4, "nodeName": "full_info_shape", "type": "Callable[[Any], Any]"}, {"lineNumber": 154, "col_offset": 4, "nodeName": "create_placeholders", "type": "Callable[[Any], Any]"}, {"lineNumber": 193, "col_offset": 4, "nodeName": "image", "type": "Callable[[Any], Any]"}, {"lineNumber": 198, "col_offset": 4, "nodeName": "info", "type": "Callable[[Any], Any]"}, {"lineNumber": 203, "col_offset": 4, "nodeName": "label", "type": "Callable[[Any], Any]"}, {"lineNumber": 209, "col_offset": 4, "nodeName": "weight_map", "type": "Callable[[Any], Any]"}, {"lineNumber": 215, "col_offset": 4, "nodeName": "image", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 220, "col_offset": 4, "nodeName": "info", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 225, "col_offset": 4, "nodeName": "label", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 231, "col_offset": 4, "nodeName": "weight_map", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 238, "col_offset": 4, "nodeName": "set_data", "type": "Callable[[Any, Any, Any, Any, Any, Any], Any]"}, {"lineNumber": 300, "col_offset": 4, "nodeName": "as_dict", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 311, "col_offset": 4, "nodeName": "stopping_signal", "type": "Callable[[Any], Any]"}, {"lineNumber": 315, "col_offset": 4, "nodeName": "fill_with_stopping_info", "type": "Callable[[Any], Any]"}, {"lineNumber": 318, "col_offset": 4, "nodeName": "is_stopping_signal", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 49, "col_offset": 29, "nodeName": "float32", "type": "Any"}, {"lineNumber": 50, "col_offset": 29, "nodeName": "int64", "type": "Any"}, {"lineNumber": 51, "col_offset": 34, "nodeName": "float32", "type": "Any"}, {"lineNumber": 56, "col_offset": 8, "nodeName": "_spatial_rank", "type": "float"}, {"lineNumber": 60, "col_offset": 8, "nodeName": "_image_size", "type": "Any"}, {"lineNumber": 60, "col_offset": 27, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 61, "col_offset": 8, "nodeName": "_label_size", "type": "Any"}, {"lineNumber": 61, "col_offset": 27, "nodeName": "label_size", "type": "Any"}, {"lineNumber": 62, "col_offset": 8, "nodeName": "_weight_map_size", "type": "Any"}, {"lineNumber": 62, "col_offset": 32, "nodeName": "weight_map_size", "type": "Any"}, {"lineNumber": 65, "col_offset": 8, "nodeName": "_image_dtype", "type": "Any"}, {"lineNumber": 65, "col_offset": 28, "nodeName": "image_dtype", "type": "Any"}, {"lineNumber": 66, "col_offset": 8, "nodeName": "_label_dtype", "type": "Any"}, {"lineNumber": 66, "col_offset": 28, "nodeName": "label_dtype", "type": "Any"}, {"lineNumber": 67, "col_offset": 8, "nodeName": "_weight_map_dtype", "type": "Any"}, {"lineNumber": 67, "col_offset": 33, "nodeName": "weight_map_dtype", "type": "Any"}, {"lineNumber": 69, "col_offset": 8, "nodeName": "_num_image_modality", "type": "Any"}, {"lineNumber": 69, "col_offset": 35, "nodeName": "num_image_modality", "type": "Any"}, {"lineNumber": 70, "col_offset": 8, "nodeName": "_num_label_modality", "type": "Any"}, {"lineNumber": 70, "col_offset": 35, "nodeName": "num_label_modality", "type": "Any"}, {"lineNumber": 71, "col_offset": 8, "nodeName": "_num_weight_map", "type": "Any"}, {"lineNumber": 71, "col_offset": 31, "nodeName": "num_weight_map", "type": "Any"}, {"lineNumber": 74, "col_offset": 8, "nodeName": "_image", "type": "None"}, {"lineNumber": 75, "col_offset": 8, "nodeName": "_info", "type": "None"}, {"lineNumber": 76, "col_offset": 8, "nodeName": "_label", "type": "None"}, {"lineNumber": 77, "col_offset": 8, "nodeName": "_weight_map", "type": "None"}, {"lineNumber": 84, "col_offset": 15, "nodeName": "_spatial_rank", "type": "Any"}, {"lineNumber": 98, "col_offset": 15, "nodeName": "_image_size", "type": "Any"}, {"lineNumber": 102, "col_offset": 11, "nodeName": "has_labels", "type": "Any"}, {"lineNumber": 108, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Any"}, {"lineNumber": 118, "col_offset": 8, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 119, "col_offset": 8, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 120, "col_offset": 15, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 124, "col_offset": 11, "nodeName": "has_labels", "type": "Any"}, {"lineNumber": 133, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Any"}, {"lineNumber": 160, "col_offset": 8, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 169, "col_offset": 8, "nodeName": "location_info_dtype", "type": "Any"}, {"lineNumber": 169, "col_offset": 30, "nodeName": "int64", "type": "Any"}, {"lineNumber": 176, "col_offset": 11, "nodeName": "has_labels", "type": "Union[bool, Any]"}, {"lineNumber": 184, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Union[bool, Any]"}, {"lineNumber": 196, "col_offset": 15, "nodeName": "_image", "type": "Any"}, {"lineNumber": 201, "col_offset": 15, "nodeName": "_info", "type": "Any"}, {"lineNumber": 205, "col_offset": 11, "nodeName": "has_labels", "type": "Any"}, {"lineNumber": 211, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Any"}, {"lineNumber": 218, "col_offset": 8, "nodeName": "_image", "type": "Any"}, {"lineNumber": 218, "col_offset": 22, "nodeName": "value", "type": "Any"}, {"lineNumber": 223, "col_offset": 8, "nodeName": "_info", "type": "Any"}, {"lineNumber": 223, "col_offset": 21, "nodeName": "value", "type": "Any"}, {"lineNumber": 227, "col_offset": 15, "nodeName": "has_labels", "type": "Any"}, {"lineNumber": 229, "col_offset": 8, "nodeName": "_label", "type": "Any"}, {"lineNumber": 229, "col_offset": 22, "nodeName": "value", "type": "Any"}, {"lineNumber": 233, "col_offset": 15, "nodeName": "has_weight_maps", "type": "Any"}, {"lineNumber": 235, "col_offset": 8, "nodeName": "_weight_map", "type": "Any"}, {"lineNumber": 235, "col_offset": 27, "nodeName": "value", "type": "Any"}, {"lineNumber": 283, "col_offset": 8, "nodeName": "image", "type": "Any"}, {"lineNumber": 301, "col_offset": 8, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 302, "col_offset": 11, "nodeName": "has_labels", "type": "Union[bool, Any]"}, {"lineNumber": 304, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Union[bool, Any]"}, {"lineNumber": 316, "col_offset": 8, "nodeName": "info", "type": "Any"}, {"lineNumber": 316, "col_offset": 20, "nodeName": "stopping_signal", "type": "Any"}, {"lineNumber": 49, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 50, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 51, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 56, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 56, "col_offset": 29, "nodeName": "float", "type": "Type[float]"}, {"lineNumber": 56, "col_offset": 35, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 57, "col_offset": 15, "nodeName": "_spatial_rank", "type": "float"}, {"lineNumber": 57, "col_offset": 37, "nodeName": "SUPPORTED_SPATIAL_RANKS", "type": "Set[float]"}, {"lineNumber": 60, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 61, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 62, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 65, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 66, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 67, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 69, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 70, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 71, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 74, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 75, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 76, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 77, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 84, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 98, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 102, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 103, "col_offset": 19, "nodeName": "_label_size", "type": "Any"}, {"lineNumber": 108, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 109, "col_offset": 19, "nodeName": "_weight_map_size", "type": "Any"}, {"lineNumber": 119, "col_offset": 23, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 124, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 127, "col_offset": 12, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 128, "col_offset": 19, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 133, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 136, "col_offset": 12, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 137, "col_offset": 19, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 162, "col_offset": 29, "nodeName": "placeholder", "type": "Any"}, {"lineNumber": 165, "col_offset": 8, "nodeName": "append", "type": "Callable"}, {"lineNumber": 165, "col_offset": 33, "nodeName": "image_placeholders", "type": "Any"}, {"lineNumber": 169, "col_offset": 30, "nodeName": "tf", "type": "Any"}, {"lineNumber": 170, "col_offset": 28, "nodeName": "placeholder", "type": "Any"}, {"lineNumber": 173, "col_offset": 8, "nodeName": "append", "type": "Callable"}, {"lineNumber": 173, "col_offset": 33, "nodeName": "info_placeholders", "type": "Any"}, {"lineNumber": 176, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 184, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 190, "col_offset": 15, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 190, "col_offset": 21, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 195, "col_offset": 15, "nodeName": "_image", "type": "Any"}, {"lineNumber": 196, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 200, "col_offset": 15, "nodeName": "_info", "type": "Any"}, {"lineNumber": 201, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 205, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 206, "col_offset": 19, "nodeName": "_label", "type": "Any"}, {"lineNumber": 211, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 212, "col_offset": 19, "nodeName": "_weight_map", "type": "Any"}, {"lineNumber": 217, "col_offset": 15, "nodeName": "shape", "type": "Any"}, {"lineNumber": 218, "col_offset": 8, "nodeName": "self", "type": "Any"}, {"lineNumber": 222, "col_offset": 15, "nodeName": "shape", "type": "Any"}, {"lineNumber": 223, "col_offset": 8, "nodeName": "self", "type": "Any"}, {"lineNumber": 227, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 228, "col_offset": 15, "nodeName": "shape", "type": "Any"}, {"lineNumber": 229, "col_offset": 8, "nodeName": "self", "type": "Any"}, {"lineNumber": 233, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 234, "col_offset": 15, "nodeName": "shape", "type": "Any"}, {"lineNumber": 235, "col_offset": 8, "nodeName": "self", "type": "Any"}, {"lineNumber": 240, "col_offset": 11, "nodeName": "isinstance", "type": "Callable[[Any, Union[Type[Any], Tuple[Union[Type[Any], Tuple[Type[Any], ...]], ...]]], bool]"}, {"lineNumber": 240, "col_offset": 22, "nodeName": "img", "type": "Any"}, {"lineNumber": 240, "col_offset": 26, "nodeName": "ColumnData", "type": "Any"}, {"lineNumber": 241, "col_offset": 10, "nodeName": "img", "type": "Any"}, {"lineNumber": 241, "col_offset": 14, "nodeName": "data", "type": "Any"}, {"lineNumber": 242, "col_offset": 10, "nodeName": "seg", "type": "Any"}, {"lineNumber": 242, "col_offset": 14, "nodeName": "data", "type": "Any"}, {"lineNumber": 243, "col_offset": 10, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 243, "col_offset": 16, "nodeName": "data", "type": "Any"}, {"lineNumber": 244, "col_offset": 15, "nodeName": "ndim", "type": "Any"}, {"lineNumber": 246, "col_offset": 20, "nodeName": "array", "type": "Callable[..., numpy.ndarray]"}, {"lineNumber": 249, "col_offset": 11, "nodeName": "spatial_rank", "type": "float"}, {"lineNumber": 250, "col_offset": 37, "nodeName": "spatial_loc", "type": "Any"}, {"lineNumber": 254, "col_offset": 12, "nodeName": "image", "type": "Any"}, {"lineNumber": 273, "col_offset": 11, "nodeName": "spatial_rank", "type": "float"}, {"lineNumber": 275, "col_offset": 12, "nodeName": "z_", "type": "int"}, {"lineNumber": 277, "col_offset": 11, "nodeName": "spatial_rank", "type": "float"}, {"lineNumber": 280, "col_offset": 15, "nodeName": "_x", "type": "int"}, {"lineNumber": 281, "col_offset": 15, "nodeName": "_y", "type": "int"}, {"lineNumber": 282, "col_offset": 15, "nodeName": "z_", "type": "int"}, {"lineNumber": 283, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 283, "col_offset": 21, "nodeName": "img", "type": "Any"}, {"lineNumber": 284, "col_offset": 11, "nodeName": "has_labels", "type": "Union[bool, Any]"}, {"lineNumber": 285, "col_offset": 12, "nodeName": "diff", "type": "int"}, {"lineNumber": 291, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Union[bool, Any]"}, {"lineNumber": 292, "col_offset": 12, "nodeName": "diff", "type": "int"}, {"lineNumber": 301, "col_offset": 20, "nodeName": "image", "type": "Any"}, {"lineNumber": 301, "col_offset": 32, "nodeName": "info", "type": "Any"}, {"lineNumber": 302, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 304, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 309, "col_offset": 16, "nodeName": "placeholders", "type": "Any"}, {"lineNumber": 316, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 316, "col_offset": 20, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 319, "col_offset": 11, "nodeName": "info", "type": "Any"}, {"lineNumber": 321, "col_offset": 15, "nodeName": "all", "type": "Any"}, {"lineNumber": 57, "col_offset": 15, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 88, "col_offset": 16, "nodeName": "_label_size", "type": "Any"}, {"lineNumber": 89, "col_offset": 16, "nodeName": "_num_label_modality", "type": "Any"}, {"lineNumber": 93, "col_offset": 16, "nodeName": "_weight_map_size", "type": "Any"}, {"lineNumber": 94, "col_offset": 16, "nodeName": "_num_weight_map", "type": "Any"}, {"lineNumber": 103, "col_offset": 19, "nodeName": "self", "type": "Any"}, {"lineNumber": 109, "col_offset": 19, "nodeName": "self", "type": "Any"}, {"lineNumber": 118, "col_offset": 24, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 118, "col_offset": 44, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 119, "col_offset": 39, "nodeName": "_num_image_modality", "type": "Any"}, {"lineNumber": 127, "col_offset": 27, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 136, "col_offset": 27, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 162, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 162, "col_offset": 50, "nodeName": "_image_dtype", "type": "Any"}, {"lineNumber": 163, "col_offset": 50, "nodeName": "full_image_shape", "type": "Tuple[Any, ...]"}, {"lineNumber": 165, "col_offset": 8, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 170, "col_offset": 28, "nodeName": "tf", "type": "Any"}, {"lineNumber": 170, "col_offset": 49, "nodeName": "location_info_dtype", "type": "Any"}, {"lineNumber": 171, "col_offset": 49, "nodeName": "full_info_shape", "type": "Tuple[int]"}, {"lineNumber": 173, "col_offset": 8, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 177, "col_offset": 33, "nodeName": "placeholder", "type": "Any"}, {"lineNumber": 181, "col_offset": 12, "nodeName": "append", "type": "Callable"}, {"lineNumber": 181, "col_offset": 37, "nodeName": "label_placeholders", "type": "Any"}, {"lineNumber": 185, "col_offset": 38, "nodeName": "placeholder", "type": "Any"}, {"lineNumber": 189, "col_offset": 12, "nodeName": "append", "type": "Callable"}, {"lineNumber": 189, "col_offset": 37, "nodeName": "weight_map_placeholders", "type": "Any"}, {"lineNumber": 195, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 200, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 206, "col_offset": 19, "nodeName": "self", "type": "Any"}, {"lineNumber": 212, "col_offset": 19, "nodeName": "self", "type": "Any"}, {"lineNumber": 217, "col_offset": 15, "nodeName": "value", "type": "Any"}, {"lineNumber": 217, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 217, "col_offset": 36, "nodeName": "full_image_shape", "type": "Any"}, {"lineNumber": 222, "col_offset": 15, "nodeName": "value", "type": "Any"}, {"lineNumber": 222, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 222, "col_offset": 36, "nodeName": "full_info_shape", "type": "Any"}, {"lineNumber": 228, "col_offset": 15, "nodeName": "value", "type": "Any"}, {"lineNumber": 228, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 228, "col_offset": 36, "nodeName": "full_label_shape", "type": "Any"}, {"lineNumber": 234, "col_offset": 15, "nodeName": "value", "type": "Any"}, {"lineNumber": 234, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 234, "col_offset": 36, "nodeName": "full_weight_map_shape", "type": "Any"}, {"lineNumber": 241, "col_offset": 14, "nodeName": "img", "type": "Any"}, {"lineNumber": 242, "col_offset": 14, "nodeName": "seg", "type": "Any"}, {"lineNumber": 243, "col_offset": 16, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 244, "col_offset": 15, "nodeName": "img", "type": "Any"}, {"lineNumber": 246, "col_offset": 20, "nodeName": "np", "type": "module"}, {"lineNumber": 246, "col_offset": 29, "nodeName": "hstack", "type": "Any"}, {"lineNumber": 247, "col_offset": 35, "nodeName": "int64", "type": "Any"}, {"lineNumber": 249, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 250, "col_offset": 12, "nodeName": "x_", "type": "Any"}, {"lineNumber": 250, "col_offset": 16, "nodeName": "y_", "type": "Any"}, {"lineNumber": 250, "col_offset": 20, "nodeName": "z_", "type": "Any"}, {"lineNumber": 250, "col_offset": 24, "nodeName": "_x", "type": "Any"}, {"lineNumber": 250, "col_offset": 28, "nodeName": "_y", "type": "Any"}, {"lineNumber": 250, "col_offset": 32, "nodeName": "_z", "type": "Any"}, {"lineNumber": 251, "col_offset": 19, "nodeName": "_x", "type": "Any"}, {"lineNumber": 252, "col_offset": 19, "nodeName": "_y", "type": "Any"}, {"lineNumber": 253, "col_offset": 19, "nodeName": "_z", "type": "Any"}, {"lineNumber": 254, "col_offset": 12, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 254, "col_offset": 25, "nodeName": "img", "type": "Any"}, {"lineNumber": 255, "col_offset": 15, "nodeName": "has_labels", "type": "Union[bool, Any]"}, {"lineNumber": 256, "col_offset": 16, "nodeName": "diff", "type": "int"}, {"lineNumber": 263, "col_offset": 15, "nodeName": "has_weight_maps", "type": "Union[bool, Any]"}, {"lineNumber": 264, "col_offset": 16, "nodeName": "diff", "type": "int"}, {"lineNumber": 273, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 274, "col_offset": 12, "nodeName": "x_", "type": "int"}, {"lineNumber": 274, "col_offset": 16, "nodeName": "y_", "type": "int"}, {"lineNumber": 274, "col_offset": 20, "nodeName": "_x", "type": "int"}, {"lineNumber": 274, "col_offset": 24, "nodeName": "_y", "type": "int"}, {"lineNumber": 277, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 278, "col_offset": 12, "nodeName": "x_", "type": "int"}, {"lineNumber": 278, "col_offset": 16, "nodeName": "y_", "type": "int"}, {"lineNumber": 278, "col_offset": 20, "nodeName": "z_", "type": "int"}, {"lineNumber": 278, "col_offset": 24, "nodeName": "_x", "type": "int"}, {"lineNumber": 278, "col_offset": 28, "nodeName": "_y", "type": "int"}, {"lineNumber": 280, "col_offset": 21, "nodeName": "shape", "type": "Any"}, {"lineNumber": 281, "col_offset": 21, "nodeName": "shape", "type": "Any"}, {"lineNumber": 282, "col_offset": 20, "nodeName": "shape", "type": "Any"}, {"lineNumber": 284, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 284, "col_offset": 32, "nodeName": "seg", "type": "Any"}, {"lineNumber": 285, "col_offset": 19, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 286, "col_offset": 19, "nodeName": "diff", "type": "int"}, {"lineNumber": 287, "col_offset": 12, "nodeName": "x_d", "type": "int"}, {"lineNumber": 287, "col_offset": 17, "nodeName": "y_d", "type": "int"}, {"lineNumber": 288, "col_offset": 12, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 288, "col_offset": 25, "nodeName": "seg", "type": "Any"}, {"lineNumber": 291, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 291, "col_offset": 37, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 292, "col_offset": 19, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 293, "col_offset": 19, "nodeName": "diff", "type": "int"}, {"lineNumber": 294, "col_offset": 12, "nodeName": "x_d", "type": "int"}, {"lineNumber": 294, "col_offset": 17, "nodeName": "y_d", "type": "int"}, {"lineNumber": 296, "col_offset": 16, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 301, "col_offset": 20, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 301, "col_offset": 32, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 303, "col_offset": 12, "nodeName": "append", "type": "Callable"}, {"lineNumber": 303, "col_offset": 28, "nodeName": "label", "type": "Any"}, {"lineNumber": 305, "col_offset": 12, "nodeName": "append", "type": "Callable"}, {"lineNumber": 305, "col_offset": 28, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 307, "col_offset": 19, "nodeName": "any", "type": "Callable[[Any], bool]"}, {"lineNumber": 308, "col_offset": 15, "nodeName": "len", "type": "Callable[[Sized], int]"}, {"lineNumber": 308, "col_offset": 19, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 308, "col_offset": 32, "nodeName": "len", "type": "Callable[[Sized], int]"}, {"lineNumber": 308, "col_offset": 36, "nodeName": "placeholders", "type": "Any"}, {"lineNumber": 309, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 309, "col_offset": 36, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 313, "col_offset": 20, "nodeName": "ones", "type": "Any"}, {"lineNumber": 313, "col_offset": 28, "nodeName": "full_info_shape", "type": "Any"}, {"lineNumber": 320, "col_offset": 18, "nodeName": "ValueError", "type": "Type[ValueError]"}, {"lineNumber": 321, "col_offset": 15, "nodeName": "np", "type": "module"}, {"lineNumber": 321, "col_offset": 22, "nodeName": "info", "type": "Any"}, {"lineNumber": 321, "col_offset": 30, "nodeName": "stopping_signal", "type": "Any"}, {"lineNumber": 88, "col_offset": 16, "nodeName": "self", "type": "Any"}, {"lineNumber": 89, "col_offset": 16, "nodeName": "self", "type": "Any"}, {"lineNumber": 93, "col_offset": 16, "nodeName": "self", "type": "Any"}, {"lineNumber": 94, "col_offset": 16, "nodeName": "self", "type": "Any"}, {"lineNumber": 118, "col_offset": 24, "nodeName": "self", "type": "Any"}, {"lineNumber": 118, "col_offset": 48, "nodeName": "floor", "type": "Any"}, {"lineNumber": 118, "col_offset": 57, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 119, "col_offset": 39, "nodeName": "self", "type": "Any"}, {"lineNumber": 125, "col_offset": 28, "nodeName": "label_size", "type": "Any"}, {"lineNumber": 126, "col_offset": 27, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 127, "col_offset": 43, "nodeName": "_num_label_modality", "type": "Any"}, {"lineNumber": 134, "col_offset": 28, "nodeName": "weight_map_size", "type": "Any"}, {"lineNumber": 135, "col_offset": 27, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 136, "col_offset": 43, "nodeName": "_num_weight_map", "type": "Any"}, {"lineNumber": 152, "col_offset": 20, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 162, "col_offset": 50, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 163, "col_offset": 50, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 171, "col_offset": 49, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 177, "col_offset": 33, "nodeName": "tf", "type": "Any"}, {"lineNumber": 178, "col_offset": 22, "nodeName": "_label_dtype", "type": "Any"}, {"lineNumber": 179, "col_offset": 22, "nodeName": "full_label_shape", "type": "Optional[Union[Tuple[Optional[Any], ...], Tuple[Any, ...]]]"}, {"lineNumber": 181, "col_offset": 12, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 185, "col_offset": 38, "nodeName": "tf", "type": "Any"}, {"lineNumber": 186, "col_offset": 22, "nodeName": "_weight_map_dtype", "type": "Any"}, {"lineNumber": 187, "col_offset": 22, "nodeName": "full_weight_map_shape", "type": "Optional[Union[Tuple[Any, ...], Tuple[Optional[Any], ...]]]"}, {"lineNumber": 189, "col_offset": 12, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 217, "col_offset": 36, "nodeName": "self", "type": "Any"}, {"lineNumber": 222, "col_offset": 36, "nodeName": "self", "type": "Any"}, {"lineNumber": 228, "col_offset": 36, "nodeName": "self", "type": "Any"}, {"lineNumber": 234, "col_offset": 36, "nodeName": "self", "type": "Any"}, {"lineNumber": 246, "col_offset": 29, "nodeName": "np", "type": "module"}, {"lineNumber": 246, "col_offset": 54, "nodeName": "spatial_loc", "type": "Any"}, {"lineNumber": 247, "col_offset": 35, "nodeName": "np", "type": "module"}, {"lineNumber": 251, "col_offset": 25, "nodeName": "shape", "type": "Any"}, {"lineNumber": 252, "col_offset": 25, "nodeName": "shape", "type": "Any"}, {"lineNumber": 253, "col_offset": 25, "nodeName": "shape", "type": "Any"}, {"lineNumber": 255, "col_offset": 15, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 255, "col_offset": 36, "nodeName": "seg", "type": "Any"}, {"lineNumber": 256, "col_offset": 23, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 257, "col_offset": 23, "nodeName": "diff", "type": "int"}, {"lineNumber": 258, "col_offset": 16, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 258, "col_offset": 21, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 258, "col_offset": 26, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 259, "col_offset": 16, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 259, "col_offset": 29, "nodeName": "seg", "type": "Any"}, {"lineNumber": 263, "col_offset": 15, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 263, "col_offset": 41, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 264, "col_offset": 23, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 265, "col_offset": 23, "nodeName": "diff", "type": "int"}, {"lineNumber": 266, "col_offset": 16, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 266, "col_offset": 21, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 266, "col_offset": 26, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 268, "col_offset": 20, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 274, "col_offset": 31, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 274, "col_offset": 35, "nodeName": "c", "type": "Any"}, {"lineNumber": 274, "col_offset": 42, "nodeName": "c", "type": "Any"}, {"lineNumber": 274, "col_offset": 47, "nodeName": "spatial_loc", "type": "Any"}, {"lineNumber": 278, "col_offset": 34, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 278, "col_offset": 38, "nodeName": "c", "type": "Any"}, {"lineNumber": 278, "col_offset": 45, "nodeName": "c", "type": "Any"}, {"lineNumber": 278, "col_offset": 50, "nodeName": "spatial_loc", "type": "Any"}, {"lineNumber": 280, "col_offset": 21, "nodeName": "img", "type": "Any"}, {"lineNumber": 281, "col_offset": 21, "nodeName": "img", "type": "Any"}, {"lineNumber": 282, "col_offset": 20, "nodeName": "img", "type": "Any"}, {"lineNumber": 283, "col_offset": 25, "nodeName": "x_", "type": "int"}, {"lineNumber": 283, "col_offset": 28, "nodeName": "_x", "type": "int"}, {"lineNumber": 283, "col_offset": 32, "nodeName": "y_", "type": "int"}, {"lineNumber": 283, "col_offset": 35, "nodeName": "_y", "type": "int"}, {"lineNumber": 283, "col_offset": 39, "nodeName": "z_", "type": "int"}, {"lineNumber": 287, "col_offset": 24, "nodeName": "x_", "type": "int"}, {"lineNumber": 287, "col_offset": 29, "nodeName": "diff", "type": "int"}, {"lineNumber": 287, "col_offset": 37, "nodeName": "y_", "type": "int"}, {"lineNumber": 287, "col_offset": 42, "nodeName": "diff", "type": "int"}, {"lineNumber": 294, "col_offset": 25, "nodeName": "x_", "type": "int"}, {"lineNumber": 294, "col_offset": 30, "nodeName": "diff", "type": "int"}, {"lineNumber": 294, "col_offset": 38, "nodeName": "y_", "type": "int"}, {"lineNumber": 294, "col_offset": 43, "nodeName": "diff", "type": "int"}, {"lineNumber": 303, "col_offset": 12, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 303, "col_offset": 28, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 305, "col_offset": 12, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 305, "col_offset": 28, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 313, "col_offset": 20, "nodeName": "np", "type": "module"}, {"lineNumber": 313, "col_offset": 28, "nodeName": "self", "type": "Any"}, {"lineNumber": 321, "col_offset": 30, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 118, "col_offset": 48, "nodeName": "np", "type": "module"}, {"lineNumber": 118, "col_offset": 57, "nodeName": "self", "type": "Any"}, {"lineNumber": 125, "col_offset": 28, "nodeName": "self", "type": "Any"}, {"lineNumber": 126, "col_offset": 31, "nodeName": "floor", "type": "Any"}, {"lineNumber": 126, "col_offset": 40, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 127, "col_offset": 43, "nodeName": "self", "type": "Any"}, {"lineNumber": 134, "col_offset": 28, "nodeName": "self", "type": "Any"}, {"lineNumber": 135, "col_offset": 31, "nodeName": "floor", "type": "Any"}, {"lineNumber": 135, "col_offset": 40, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 136, "col_offset": 43, "nodeName": "self", "type": "Any"}, {"lineNumber": 152, "col_offset": 24, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 178, "col_offset": 22, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 179, "col_offset": 22, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 186, "col_offset": 22, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 187, "col_offset": 22, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 246, "col_offset": 41, "nodeName": "subject_id", "type": "Any"}, {"lineNumber": 251, "col_offset": 25, "nodeName": "img", "type": "Any"}, {"lineNumber": 252, "col_offset": 25, "nodeName": "img", "type": "Any"}, {"lineNumber": 253, "col_offset": 25, "nodeName": "img", "type": "Any"}, {"lineNumber": 254, "col_offset": 29, "nodeName": "x_", "type": "Any"}, {"lineNumber": 254, "col_offset": 32, "nodeName": "_x", "type": "Any"}, {"lineNumber": 254, "col_offset": 36, "nodeName": "y_", "type": "Any"}, {"lineNumber": 254, "col_offset": 39, "nodeName": "_y", "type": "Any"}, {"lineNumber": 254, "col_offset": 43, "nodeName": "z_", "type": "Any"}, {"lineNumber": 254, "col_offset": 46, "nodeName": "_z", "type": "Any"}, {"lineNumber": 258, "col_offset": 33, "nodeName": "x_", "type": "Any"}, {"lineNumber": 258, "col_offset": 38, "nodeName": "diff", "type": "int"}, {"lineNumber": 258, "col_offset": 46, "nodeName": "y_", "type": "Any"}, {"lineNumber": 258, "col_offset": 51, "nodeName": "diff", "type": "int"}, {"lineNumber": 258, "col_offset": 59, "nodeName": "z_", "type": "Any"}, {"lineNumber": 258, "col_offset": 64, "nodeName": "diff", "type": "int"}, {"lineNumber": 266, "col_offset": 33, "nodeName": "x_", "type": "Any"}, {"lineNumber": 266, "col_offset": 38, "nodeName": "diff", "type": "int"}, {"lineNumber": 266, "col_offset": 46, "nodeName": "y_", "type": "Any"}, {"lineNumber": 266, "col_offset": 51, "nodeName": "diff", "type": "int"}, {"lineNumber": 266, "col_offset": 59, "nodeName": "z_", "type": "Any"}, {"lineNumber": 266, "col_offset": 64, "nodeName": "diff", "type": "int"}, {"lineNumber": 285, "col_offset": 24, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 285, "col_offset": 42, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 288, "col_offset": 29, "nodeName": "x_d", "type": "int"}, {"lineNumber": 289, "col_offset": 34, "nodeName": "y_d", "type": "int"}, {"lineNumber": 289, "col_offset": 64, "nodeName": "z_", "type": "int"}, {"lineNumber": 292, "col_offset": 24, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 292, "col_offset": 42, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 296, "col_offset": 22, "nodeName": "x_d", "type": "int"}, {"lineNumber": 297, "col_offset": 27, "nodeName": "y_d", "type": "int"}, {"lineNumber": 297, "col_offset": 62, "nodeName": "z_", "type": "int"}, {"lineNumber": 307, "col_offset": 24, "nodeName": "x", "type": "Any"}, {"lineNumber": 307, "col_offset": 38, "nodeName": "x", "type": "Any"}, {"lineNumber": 307, "col_offset": 43, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 126, "col_offset": 31, "nodeName": "np", "type": "module"}, {"lineNumber": 126, "col_offset": 40, "nodeName": "self", "type": "Any"}, {"lineNumber": 135, "col_offset": 31, "nodeName": "np", "type": "module"}, {"lineNumber": 135, "col_offset": 40, "nodeName": "self", "type": "Any"}, {"lineNumber": 152, "col_offset": 24, "nodeName": "self", "type": "Any"}, {"lineNumber": 256, "col_offset": 28, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 256, "col_offset": 46, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 259, "col_offset": 33, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 260, "col_offset": 38, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 261, "col_offset": 38, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 264, "col_offset": 28, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 264, "col_offset": 46, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 268, "col_offset": 26, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 269, "col_offset": 31, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 270, "col_offset": 31, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 285, "col_offset": 24, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 285, "col_offset": 42, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 288, "col_offset": 35, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 288, "col_offset": 53, "nodeName": "x_d", "type": "int"}, {"lineNumber": 289, "col_offset": 40, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 289, "col_offset": 58, "nodeName": "y_d", "type": "int"}, {"lineNumber": 292, "col_offset": 24, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 292, "col_offset": 42, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 296, "col_offset": 28, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 296, "col_offset": 51, "nodeName": "x_d", "type": "int"}, {"lineNumber": 297, "col_offset": 33, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 297, "col_offset": 56, "nodeName": "y_d", "type": "int"}, {"lineNumber": 256, "col_offset": 28, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 256, "col_offset": 46, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 259, "col_offset": 39, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 259, "col_offset": 57, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 260, "col_offset": 44, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 260, "col_offset": 62, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 261, "col_offset": 44, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 261, "col_offset": 62, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 264, "col_offset": 28, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 264, "col_offset": 46, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 268, "col_offset": 32, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 268, "col_offset": 55, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 269, "col_offset": 37, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 269, "col_offset": 60, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 270, "col_offset": 37, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 270, "col_offset": 60, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 289, "col_offset": 40, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 296, "col_offset": 28, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 297, "col_offset": 33, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 260, "col_offset": 44, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 261, "col_offset": 44, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 268, "col_offset": 32, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 269, "col_offset": 37, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 270, "col_offset": 37, "nodeName": "self", "type": "ImagePatch"}]