[{"lineNumber": 11, "col_offset": 23, "nodeName": "BaseSampler", "type": "Type[engine.base_sampler.BaseSampler]"}, {"lineNumber": 36, "col_offset": 4, "nodeName": "layer_op", "type": "Callable[..., Any]"}, {"lineNumber": 28, "col_offset": 8, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 28, "col_offset": 29, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 29, "col_offset": 8, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 29, "col_offset": 32, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 30, "col_offset": 8, "nodeName": "spatial_location_check", "type": "Any"}, {"lineNumber": 30, "col_offset": 38, "nodeName": "spatial_location_check", "type": "Any"}, {"lineNumber": 46, "col_offset": 8, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 46, "col_offset": 23, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 47, "col_offset": 8, "nodeName": "local_layers", "type": "List[Any]"}, {"lineNumber": 48, "col_offset": 8, "nodeName": "patch", "type": "Any"}, {"lineNumber": 49, "col_offset": 8, "nodeName": "spatial_location_check", "type": "Any"}, {"lineNumber": 50, "col_offset": 14, "nodeName": "has_next", "type": "Any"}, {"lineNumber": 27, "col_offset": 8, "nodeName": "__init__", "type": "Callable[..., None]"}, {"lineNumber": 28, "col_offset": 8, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 29, "col_offset": 8, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 30, "col_offset": 8, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 31, "col_offset": 11, "nodeName": "data_augmentation_methods", "type": "Any"}, {"lineNumber": 32, "col_offset": 12, "nodeName": "data_augmentation_layers", "type": "List[nothing]"}, {"lineNumber": 34, "col_offset": 12, "nodeName": "data_augmentation_layers", "type": "Any"}, {"lineNumber": 34, "col_offset": 44, "nodeName": "data_augmentation_methods", "type": "Any"}, {"lineNumber": 46, "col_offset": 23, "nodeName": "patch", "type": "Any"}, {"lineNumber": 48, "col_offset": 16, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "patch", "type": "Any"}, {"lineNumber": 49, "col_offset": 33, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 49, "col_offset": 42, "nodeName": "spatial_location_check", "type": "Any"}, {"lineNumber": 50, "col_offset": 14, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 56, "col_offset": 12, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 56, "col_offset": 31, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 73, "col_offset": 16, "nodeName": "aug", "type": "Any"}, {"lineNumber": 73, "col_offset": 23, "nodeName": "local_layers", "type": "List[Any]"}, {"lineNumber": 82, "col_offset": 12, "nodeName": "locations", "type": "List[Any]"}, {"lineNumber": 83, "col_offset": 12, "nodeName": "n_locations_to_check", "type": "Any"}, {"lineNumber": 85, "col_offset": 12, "nodeName": "n_trials", "type": "int"}, {"lineNumber": 101, "col_offset": 12, "nodeName": "locations", "type": "Any"}, {"lineNumber": 103, "col_offset": 16, "nodeName": "loc", "type": "Any"}, {"lineNumber": 103, "col_offset": 23, "nodeName": "locations", "type": "Any"}, {"lineNumber": 27, "col_offset": 53, "nodeName": "patch", "type": "Any"}, {"lineNumber": 27, "col_offset": 65, "nodeName": "name", "type": "Any"}, {"lineNumber": 32, "col_offset": 12, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 34, "col_offset": 12, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 46, "col_offset": 23, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 47, "col_offset": 24, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 47, "col_offset": 33, "nodeName": "x", "type": "Any"}, {"lineNumber": 47, "col_offset": 40, "nodeName": "x", "type": "Any"}, {"lineNumber": 47, "col_offset": 45, "nodeName": "data_augmentation_layers", "type": "Union[List[nothing], Any]"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 49, "col_offset": 42, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 50, "col_offset": 14, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 51, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 51, "col_offset": 17, "nodeName": "seg", "type": "Any"}, {"lineNumber": 51, "col_offset": 22, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 51, "col_offset": 34, "nodeName": "idx", "type": "Any"}, {"lineNumber": 51, "col_offset": 40, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 56, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 57, "col_offset": 23, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 58, "col_offset": 16, "nodeName": "data", "type": "Any"}, {"lineNumber": 58, "col_offset": 26, "nodeName": "full_informative_image_shape", "type": "Any"}, {"lineNumber": 59, "col_offset": 15, "nodeName": "ndim", "type": "Any"}, {"lineNumber": 60, "col_offset": 22, "nodeName": "NotImplementedError", "type": "Type[NotImplementedError]"}, {"lineNumber": 62, "col_offset": 15, "nodeName": "seg", "type": "Any"}, {"lineNumber": 63, "col_offset": 16, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 63, "col_offset": 35, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 66, "col_offset": 15, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 67, "col_offset": 16, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 67, "col_offset": 42, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 83, "col_offset": 35, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 84, "col_offset": 12, "nodeName": "sampling_from", "type": "Any"}, {"lineNumber": 84, "col_offset": 49, "nodeName": "data", "type": "Any"}, {"lineNumber": 95, "col_offset": 16, "nodeName": "is_valid", "type": "numpy.ndarray"}, {"lineNumber": 98, "col_offset": 20, "nodeName": "loc", "type": "Any"}, {"lineNumber": 100, "col_offset": 16, "nodeName": "n_trials", "type": "int"}, {"lineNumber": 101, "col_offset": 24, "nodeName": "vstack", "type": "Any"}, {"lineNumber": 101, "col_offset": 34, "nodeName": "locations", "type": "List[Any]"}, {"lineNumber": 27, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 27, "col_offset": 14, "nodeName": "SelectiveSampler", "type": "Type[SelectiveSampler]"}, {"lineNumber": 27, "col_offset": 32, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 47, "col_offset": 45, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 51, "col_offset": 40, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 57, "col_offset": 23, "nodeName": "io", "type": "module"}, {"lineNumber": 58, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 58, "col_offset": 26, "nodeName": "patch", "type": "Any"}, {"lineNumber": 59, "col_offset": 15, "nodeName": "data", "type": "Any"}, {"lineNumber": 63, "col_offset": 16, "nodeName": "seg", "type": "Any"}, {"lineNumber": 64, "col_offset": 27, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 65, "col_offset": 20, "nodeName": "data", "type": "Any"}, {"lineNumber": 65, "col_offset": 30, "nodeName": "full_informative_label_shape", "type": "Any"}, {"lineNumber": 67, "col_offset": 16, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 68, "col_offset": 34, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 69, "col_offset": 20, "nodeName": "data", "type": "Any"}, {"lineNumber": 70, "col_offset": 20, "nodeName": "full_informative_weight_map_shape", "type": "Any"}, {"lineNumber": 74, "col_offset": 16, "nodeName": "randomise", "type": "Any"}, {"lineNumber": 75, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 75, "col_offset": 21, "nodeName": "seg", "type": "Any"}, {"lineNumber": 75, "col_offset": 26, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 83, "col_offset": 35, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 84, "col_offset": 12, "nodeName": "spatial_location_check", "type": "Any"}, {"lineNumber": 84, "col_offset": 49, "nodeName": "seg", "type": "Any"}, {"lineNumber": 86, "col_offset": 35, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 86, "col_offset": 61, "nodeName": "n_trials", "type": "int"}, {"lineNumber": 88, "col_offset": 38, "nodeName": "rand_spatial_coordinates", "type": "Callable[[Any, Any, Any, Any], Any]"}, {"lineNumber": 89, "col_offset": 20, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 90, "col_offset": 20, "nodeName": "shape", "type": "Any"}, {"lineNumber": 91, "col_offset": 20, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 92, "col_offset": 20, "nodeName": "n_locations_to_check", "type": "Any"}, {"lineNumber": 95, "col_offset": 27, "nodeName": "asarray", "type": "Callable[..., numpy.ndarray]"}, {"lineNumber": 95, "col_offset": 38, "nodeName": "is_valid", "type": "List[Any]"}, {"lineNumber": 98, "col_offset": 27, "nodeName": "candidate_locations", "type": "Any"}, {"lineNumber": 101, "col_offset": 24, "nodeName": "np", "type": "module"}, {"lineNumber": 104, "col_offset": 16, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 104, "col_offset": 31, "nodeName": "idx", "type": "Any"}, {"lineNumber": 104, "col_offset": 36, "nodeName": "loc", "type": "Any"}, {"lineNumber": 104, "col_offset": 41, "nodeName": "img", "type": "Any"}, {"lineNumber": 104, "col_offset": 46, "nodeName": "seg", "type": "Any"}, {"lineNumber": 104, "col_offset": 51, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 105, "col_offset": 22, "nodeName": "patch", "type": "Any"}, {"lineNumber": 58, "col_offset": 26, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 59, "col_offset": 15, "nodeName": "img", "type": "Any"}, {"lineNumber": 64, "col_offset": 27, "nodeName": "io", "type": "module"}, {"lineNumber": 65, "col_offset": 20, "nodeName": "seg", "type": "Any"}, {"lineNumber": 65, "col_offset": 30, "nodeName": "patch", "type": "Any"}, {"lineNumber": 68, "col_offset": 34, "nodeName": "io", "type": "module"}, {"lineNumber": 69, "col_offset": 20, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 70, "col_offset": 20, "nodeName": "patch", "type": "Any"}, {"lineNumber": 74, "col_offset": 16, "nodeName": "aug", "type": "Any"}, {"lineNumber": 74, "col_offset": 43, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 75, "col_offset": 39, "nodeName": "aug", "type": "Any"}, {"lineNumber": 75, "col_offset": 43, "nodeName": "img", "type": "Any"}, {"lineNumber": 75, "col_offset": 49, "nodeName": "aug", "type": "Any"}, {"lineNumber": 75, "col_offset": 53, "nodeName": "seg", "type": "Any"}, {"lineNumber": 75, "col_offset": 59, "nodeName": "aug", "type": "Any"}, {"lineNumber": 75, "col_offset": 63, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 86, "col_offset": 18, "nodeName": "len", "type": "Callable[[Sized], int]"}, {"lineNumber": 86, "col_offset": 22, "nodeName": "locations", "type": "List[Any]"}, {"lineNumber": 86, "col_offset": 35, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 89, "col_offset": 20, "nodeName": "img", "type": "Any"}, {"lineNumber": 90, "col_offset": 20, "nodeName": "data", "type": "Any"}, {"lineNumber": 91, "col_offset": 20, "nodeName": "patch", "type": "Any"}, {"lineNumber": 94, "col_offset": 32, "nodeName": "location", "type": "Any"}, {"lineNumber": 94, "col_offset": 44, "nodeName": "candidate_locations", "type": "Any"}, {"lineNumber": 95, "col_offset": 27, "nodeName": "np", "type": "module"}, {"lineNumber": 95, "col_offset": 54, "nodeName": "bool", "type": "Type[bool]"}, {"lineNumber": 96, "col_offset": 22, "nodeName": "format", "type": "Callable[..., str]"}, {"lineNumber": 98, "col_offset": 47, "nodeName": "is_valid", "type": "numpy.ndarray"}, {"lineNumber": 99, "col_offset": 20, "nodeName": "append", "type": "Callable"}, {"lineNumber": 99, "col_offset": 37, "nodeName": "loc", "type": "Any"}, {"lineNumber": 104, "col_offset": 16, "nodeName": "patch", "type": "Any"}, {"lineNumber": 65, "col_offset": 30, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 70, "col_offset": 20, "nodeName": "self", "type": "SelectiveSampler"}, {"lineNumber": 90, "col_offset": 20, "nodeName": "img", "type": "Any"}, {"lineNumber": 97, "col_offset": 20, "nodeName": "sum", "type": "Any"}, {"lineNumber": 97, "col_offset": 27, "nodeName": "is_valid", "type": "numpy.ndarray"}, {"lineNumber": 97, "col_offset": 38, "nodeName": "len", "type": "Callable[[Sized], int]"}, {"lineNumber": 97, "col_offset": 42, "nodeName": "candidate_locations", "type": "Any"}, {"lineNumber": 99, "col_offset": 20, "nodeName": "locations", "type": "List[Any]"}, {"lineNumber": 97, "col_offset": 20, "nodeName": "np", "type": "module"}]