[{"lineNumber": 12, "col_offset": 17, "nodeName": "BaseSampler", "type": "Type[niftynet.engine.base_sampler.BaseSampler]"}, {"lineNumber": 38, "col_offset": 4, "nodeName": "layer_op", "type": "Callable[..., Any]"}, {"lineNumber": 96, "col_offset": 39, "nodeName": "GANSampler", "type": "Type[GANSampler]"}, {"lineNumber": 97, "col_offset": 4, "nodeName": "__init__", "type": "Callable[..., Any]"}, {"lineNumber": 102, "col_offset": 4, "nodeName": "layer_op", "type": "Callable[..., Any]"}, {"lineNumber": 26, "col_offset": 8, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 26, "col_offset": 29, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 45, "col_offset": 8, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 45, "col_offset": 23, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 46, "col_offset": 8, "nodeName": "local_layers", "type": "List[Any]"}, {"lineNumber": 47, "col_offset": 8, "nodeName": "patch", "type": "Any"}, {"lineNumber": 48, "col_offset": 14, "nodeName": "has_next", "type": "Any"}, {"lineNumber": 98, "col_offset": 8, "nodeName": "n_interpolants", "type": "Any"}, {"lineNumber": 98, "col_offset": 28, "nodeName": "n_interpolants", "type": "Any"}, {"lineNumber": 103, "col_offset": 8, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 103, "col_offset": 23, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 104, "col_offset": 8, "nodeName": "patch", "type": "Any"}, {"lineNumber": 105, "col_offset": 14, "nodeName": "has_next", "type": "Any"}, {"lineNumber": 25, "col_offset": 8, "nodeName": "__init__", "type": "Callable[..., None]"}, {"lineNumber": 26, "col_offset": 8, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 27, "col_offset": 11, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 28, "col_offset": 10, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 28, "col_offset": 34, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 32, "col_offset": 10, "nodeName": "patch_per_volume", "type": "int"}, {"lineNumber": 33, "col_offset": 11, "nodeName": "data_augmentation_methods", "type": "Any"}, {"lineNumber": 34, "col_offset": 12, "nodeName": "data_augmentation_layers", "type": "List[nothing]"}, {"lineNumber": 36, "col_offset": 12, "nodeName": "data_augmentation_layers", "type": "Any"}, {"lineNumber": 36, "col_offset": 44, "nodeName": "data_augmentation_methods", "type": "Any"}, {"lineNumber": 45, "col_offset": 23, "nodeName": "patch", "type": "Any"}, {"lineNumber": 47, "col_offset": 16, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 47, "col_offset": 25, "nodeName": "patch", "type": "Any"}, {"lineNumber": 48, "col_offset": 14, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 53, "col_offset": 12, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 53, "col_offset": 31, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 66, "col_offset": 16, "nodeName": "aug", "type": "Any"}, {"lineNumber": 66, "col_offset": 23, "nodeName": "local_layers", "type": "List[Any]"}, {"lineNumber": 69, "col_offset": 12, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 71, "col_offset": 12, "nodeName": "noise", "type": "Any"}, {"lineNumber": 98, "col_offset": 8, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 99, "col_offset": 8, "nodeName": "__init__", "type": "Callable[..., Any]"}, {"lineNumber": 99, "col_offset": 62, "nodeName": "patch", "type": "Any"}, {"lineNumber": 100, "col_offset": 62, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 103, "col_offset": 23, "nodeName": "patch", "type": "Any"}, {"lineNumber": 104, "col_offset": 16, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 104, "col_offset": 25, "nodeName": "patch", "type": "Any"}, {"lineNumber": 105, "col_offset": 14, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 107, "col_offset": 12, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 107, "col_offset": 31, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 108, "col_offset": 12, "nodeName": "data", "type": "Any"}, {"lineNumber": 109, "col_offset": 15, "nodeName": "cond", "type": "Any"}, {"lineNumber": 111, "col_offset": 12, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 113, "col_offset": 12, "nodeName": "noise1", "type": "Any"}, {"lineNumber": 114, "col_offset": 12, "nodeName": "noise2", "type": "Any"}, {"lineNumber": 115, "col_offset": 16, "nodeName": "it", "type": "int"}, {"lineNumber": 25, "col_offset": 47, "nodeName": "patch", "type": "Any"}, {"lineNumber": 25, "col_offset": 59, "nodeName": "name", "type": "Any"}, {"lineNumber": 27, "col_offset": 11, "nodeName": "patch", "type": "Any"}, {"lineNumber": 28, "col_offset": 10, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 30, "col_offset": 13, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 32, "col_offset": 10, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 34, "col_offset": 12, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 36, "col_offset": 12, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 45, "col_offset": 23, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 46, "col_offset": 24, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 46, "col_offset": 33, "nodeName": "x", "type": "Any"}, {"lineNumber": 46, "col_offset": 40, "nodeName": "x", "type": "Any"}, {"lineNumber": 46, "col_offset": 45, "nodeName": "data_augmentation_layers", "type": "Union[List[nothing], Any]"}, {"lineNumber": 47, "col_offset": 25, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 48, "col_offset": 14, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 49, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 49, "col_offset": 17, "nodeName": "cond", "type": "Any"}, {"lineNumber": 49, "col_offset": 23, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 49, "col_offset": 35, "nodeName": "idx", "type": "Any"}, {"lineNumber": 49, "col_offset": 41, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 53, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 55, "col_offset": 23, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 56, "col_offset": 16, "nodeName": "data", "type": "Any"}, {"lineNumber": 56, "col_offset": 26, "nodeName": "patch", "type": "Any"}, {"lineNumber": 57, "col_offset": 15, "nodeName": "ndim", "type": "Any"}, {"lineNumber": 58, "col_offset": 22, "nodeName": "NotImplementedError", "type": "Type[NotImplementedError]"}, {"lineNumber": 60, "col_offset": 15, "nodeName": "cond", "type": "Any"}, {"lineNumber": 61, "col_offset": 16, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 61, "col_offset": 36, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 71, "col_offset": 20, "nodeName": "randn", "type": "Any"}, {"lineNumber": 71, "col_offset": 36, "nodeName": "noise_size", "type": "Any"}, {"lineNumber": 72, "col_offset": 15, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 73, "col_offset": 16, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 74, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 101, "col_offset": 64, "nodeName": "kwargs", "type": "Dict[str, Any]"}, {"lineNumber": 103, "col_offset": 23, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 104, "col_offset": 25, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 105, "col_offset": 14, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 106, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 106, "col_offset": 17, "nodeName": "cond", "type": "Any"}, {"lineNumber": 106, "col_offset": 23, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 106, "col_offset": 35, "nodeName": "idx_base", "type": "Any"}, {"lineNumber": 106, "col_offset": 46, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 107, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 108, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 108, "col_offset": 23, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 108, "col_offset": 65, "nodeName": "data", "type": "Any"}, {"lineNumber": 108, "col_offset": 75, "nodeName": "patch", "type": "Any"}, {"lineNumber": 110, "col_offset": 16, "nodeName": "data", "type": "Any"}, {"lineNumber": 113, "col_offset": 21, "nodeName": "randn", "type": "Any"}, {"lineNumber": 113, "col_offset": 37, "nodeName": "noise_size", "type": "Any"}, {"lineNumber": 114, "col_offset": 21, "nodeName": "randn", "type": "Any"}, {"lineNumber": 114, "col_offset": 37, "nodeName": "noise_size", "type": "Any"}, {"lineNumber": 115, "col_offset": 22, "nodeName": "range", "type": "Callable[..., List[int]]"}, {"lineNumber": 115, "col_offset": 28, "nodeName": "n_interpolants", "type": "Any"}, {"lineNumber": 116, "col_offset": 16, "nodeName": "idx", "type": "Any"}, {"lineNumber": 117, "col_offset": 16, "nodeName": "noise", "type": "Any"}, {"lineNumber": 25, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 25, "col_offset": 14, "nodeName": "GANSampler", "type": "Type[GANSampler]"}, {"lineNumber": 25, "col_offset": 26, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 31, "col_offset": 12, "nodeName": "warn", "type": "Callable"}, {"lineNumber": 46, "col_offset": 45, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 49, "col_offset": 41, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 55, "col_offset": 23, "nodeName": "io", "type": "module"}, {"lineNumber": 56, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 57, "col_offset": 15, "nodeName": "data", "type": "Any"}, {"lineNumber": 61, "col_offset": 16, "nodeName": "cond", "type": "Any"}, {"lineNumber": 62, "col_offset": 28, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 63, "col_offset": 20, "nodeName": "data", "type": "Any"}, {"lineNumber": 63, "col_offset": 31, "nodeName": "patch", "type": "Any"}, {"lineNumber": 67, "col_offset": 16, "nodeName": "randomise", "type": "Any"}, {"lineNumber": 68, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 68, "col_offset": 21, "nodeName": "seg", "type": "Any"}, {"lineNumber": 68, "col_offset": 26, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 71, "col_offset": 20, "nodeName": "random", "type": "Any"}, {"lineNumber": 71, "col_offset": 36, "nodeName": "patch", "type": "Any"}, {"lineNumber": 74, "col_offset": 22, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 74, "col_offset": 55, "nodeName": "data", "type": "Any"}, {"lineNumber": 74, "col_offset": 65, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 75, "col_offset": 19, "nodeName": "cond", "type": "Any"}, {"lineNumber": 76, "col_offset": 20, "nodeName": "cond", "type": "Any"}, {"lineNumber": 77, "col_offset": 16, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 77, "col_offset": 31, "nodeName": "idx", "type": "Any"}, {"lineNumber": 77, "col_offset": 36, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 77, "col_offset": 41, "nodeName": "img", "type": "Any"}, {"lineNumber": 77, "col_offset": 46, "nodeName": "cond", "type": "Any"}, {"lineNumber": 77, "col_offset": 52, "nodeName": "noise", "type": "Any"}, {"lineNumber": 78, "col_offset": 22, "nodeName": "patch", "type": "Any"}, {"lineNumber": 79, "col_offset": 17, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 80, "col_offset": 16, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 81, "col_offset": 20, "nodeName": "it", "type": "int"}, {"lineNumber": 99, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 99, "col_offset": 14, "nodeName": "InterpolatingInferenceGANSampler", "type": "Type[InterpolatingInferenceGANSampler]"}, {"lineNumber": 99, "col_offset": 47, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 106, "col_offset": 46, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 108, "col_offset": 23, "nodeName": "io", "type": "module"}, {"lineNumber": 108, "col_offset": 65, "nodeName": "img", "type": "Any"}, {"lineNumber": 110, "col_offset": 16, "nodeName": "cond", "type": "Any"}, {"lineNumber": 110, "col_offset": 28, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 110, "col_offset": 70, "nodeName": "data", "type": "Any"}, {"lineNumber": 110, "col_offset": 81, "nodeName": "patch", "type": "Any"}, {"lineNumber": 113, "col_offset": 21, "nodeName": "random", "type": "Any"}, {"lineNumber": 113, "col_offset": 37, "nodeName": "patch", "type": "Any"}, {"lineNumber": 114, "col_offset": 21, "nodeName": "random", "type": "Any"}, {"lineNumber": 114, "col_offset": 37, "nodeName": "patch", "type": "Any"}, {"lineNumber": 115, "col_offset": 28, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 116, "col_offset": 49, "nodeName": "it", "type": "int"}, {"lineNumber": 118, "col_offset": 19, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 119, "col_offset": 20, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 120, "col_offset": 20, "nodeName": "img", "type": "Any"}, {"lineNumber": 31, "col_offset": 12, "nodeName": "warnings", "type": "module"}, {"lineNumber": 31, "col_offset": 26, "nodeName": "format", "type": "Callable[..., str]"}, {"lineNumber": 31, "col_offset": 100, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 57, "col_offset": 15, "nodeName": "img", "type": "Any"}, {"lineNumber": 62, "col_offset": 28, "nodeName": "io", "type": "module"}, {"lineNumber": 63, "col_offset": 20, "nodeName": "cond", "type": "Any"}, {"lineNumber": 67, "col_offset": 16, "nodeName": "aug", "type": "Any"}, {"lineNumber": 67, "col_offset": 43, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 68, "col_offset": 39, "nodeName": "aug", "type": "Any"}, {"lineNumber": 68, "col_offset": 43, "nodeName": "img", "type": "Any"}, {"lineNumber": 68, "col_offset": 49, "nodeName": "aug", "type": "Any"}, {"lineNumber": 68, "col_offset": 53, "nodeName": "seg", "type": "Any"}, {"lineNumber": 68, "col_offset": 59, "nodeName": "aug", "type": "Any"}, {"lineNumber": 68, "col_offset": 63, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 69, "col_offset": 20, "nodeName": "p", "type": "Any"}, {"lineNumber": 69, "col_offset": 22, "nodeName": "d", "type": "Any"}, {"lineNumber": 71, "col_offset": 20, "nodeName": "np", "type": "module"}, {"lineNumber": 73, "col_offset": 24, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 73, "col_offset": 56, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 74, "col_offset": 22, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 74, "col_offset": 55, "nodeName": "img", "type": "Any"}, {"lineNumber": 76, "col_offset": 27, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 76, "col_offset": 60, "nodeName": "data", "type": "Any"}, {"lineNumber": 76, "col_offset": 71, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 77, "col_offset": 16, "nodeName": "patch", "type": "Any"}, {"lineNumber": 81, "col_offset": 26, "nodeName": "range", "type": "Callable[..., List[int]]"}, {"lineNumber": 81, "col_offset": 32, "nodeName": "patch_per_volume", "type": "Union[Any, int]"}, {"lineNumber": 82, "col_offset": 20, "nodeName": "slice", "type": "Any"}, {"lineNumber": 83, "col_offset": 20, "nodeName": "imgS", "type": "Any"}, {"lineNumber": 88, "col_offset": 17, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 89, "col_offset": 16, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 90, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 110, "col_offset": 28, "nodeName": "io", "type": "module"}, {"lineNumber": 110, "col_offset": 70, "nodeName": "cond", "type": "Any"}, {"lineNumber": 111, "col_offset": 20, "nodeName": "p", "type": "Any"}, {"lineNumber": 111, "col_offset": 22, "nodeName": "d", "type": "Any"}, {"lineNumber": 113, "col_offset": 21, "nodeName": "np", "type": "module"}, {"lineNumber": 114, "col_offset": 21, "nodeName": "np", "type": "module"}, {"lineNumber": 116, "col_offset": 20, "nodeName": "idx_base", "type": "Any"}, {"lineNumber": 116, "col_offset": 29, "nodeName": "n_interpolants", "type": "Any"}, {"lineNumber": 117, "col_offset": 22, "nodeName": "noise1", "type": "Any"}, {"lineNumber": 117, "col_offset": 76, "nodeName": "noise2", "type": "Any"}, {"lineNumber": 120, "col_offset": 26, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 120, "col_offset": 59, "nodeName": "data", "type": "Any"}, {"lineNumber": 120, "col_offset": 69, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 121, "col_offset": 23, "nodeName": "cond", "type": "Any"}, {"lineNumber": 122, "col_offset": 24, "nodeName": "cond", "type": "Any"}, {"lineNumber": 123, "col_offset": 20, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 123, "col_offset": 35, "nodeName": "idx", "type": "Any"}, {"lineNumber": 123, "col_offset": 40, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 123, "col_offset": 45, "nodeName": "img", "type": "Any"}, {"lineNumber": 123, "col_offset": 50, "nodeName": "cond", "type": "Any"}, {"lineNumber": 123, "col_offset": 56, "nodeName": "noise", "type": "Any"}, {"lineNumber": 124, "col_offset": 26, "nodeName": "patch", "type": "Any"}, {"lineNumber": 125, "col_offset": 21, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 126, "col_offset": 20, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 127, "col_offset": 20, "nodeName": "imgS", "type": "Any"}, {"lineNumber": 131, "col_offset": 24, "nodeName": "slice", "type": "int"}, {"lineNumber": 31, "col_offset": 100, "nodeName": "patch", "type": "Any"}, {"lineNumber": 69, "col_offset": 28, "nodeName": "p", "type": "Any"}, {"lineNumber": 69, "col_offset": 30, "nodeName": "d", "type": "Any"}, {"lineNumber": 69, "col_offset": 35, "nodeName": "zip", "type": "Callable"}, {"lineNumber": 73, "col_offset": 38, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 74, "col_offset": 22, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 76, "col_offset": 27, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 76, "col_offset": 60, "nodeName": "cond", "type": "Any"}, {"lineNumber": 81, "col_offset": 32, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 82, "col_offset": 28, "nodeName": "randint", "type": "Any"}, {"lineNumber": 83, "col_offset": 27, "nodeName": "expand_dims", "type": "Any"}, {"lineNumber": 84, "col_offset": 23, "nodeName": "cond", "type": "Any"}, {"lineNumber": 85, "col_offset": 24, "nodeName": "condS", "type": "Any"}, {"lineNumber": 86, "col_offset": 20, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 86, "col_offset": 35, "nodeName": "idx", "type": "Any"}, {"lineNumber": 86, "col_offset": 40, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 86, "col_offset": 45, "nodeName": "imgS", "type": "Any"}, {"lineNumber": 86, "col_offset": 51, "nodeName": "condS", "type": "Any"}, {"lineNumber": 86, "col_offset": 58, "nodeName": "noise", "type": "Any"}, {"lineNumber": 87, "col_offset": 26, "nodeName": "patch", "type": "Any"}, {"lineNumber": 90, "col_offset": 22, "nodeName": "expand_dims", "type": "Any"}, {"lineNumber": 91, "col_offset": 19, "nodeName": "cond", "type": "Any"}, {"lineNumber": 92, "col_offset": 20, "nodeName": "cond", "type": "Any"}, {"lineNumber": 93, "col_offset": 16, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 93, "col_offset": 31, "nodeName": "idx", "type": "Any"}, {"lineNumber": 93, "col_offset": 36, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 93, "col_offset": 41, "nodeName": "img", "type": "Any"}, {"lineNumber": 93, "col_offset": 46, "nodeName": "cond", "type": "Any"}, {"lineNumber": 93, "col_offset": 52, "nodeName": "noise", "type": "Any"}, {"lineNumber": 94, "col_offset": 22, "nodeName": "patch", "type": "Any"}, {"lineNumber": 111, "col_offset": 28, "nodeName": "p", "type": "Any"}, {"lineNumber": 111, "col_offset": 30, "nodeName": "d", "type": "Any"}, {"lineNumber": 111, "col_offset": 35, "nodeName": "zip", "type": "Callable"}, {"lineNumber": 116, "col_offset": 29, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 117, "col_offset": 86, "nodeName": "it", "type": "int"}, {"lineNumber": 119, "col_offset": 28, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 119, "col_offset": 60, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 120, "col_offset": 26, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 120, "col_offset": 59, "nodeName": "img", "type": "Any"}, {"lineNumber": 122, "col_offset": 31, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 122, "col_offset": 64, "nodeName": "data", "type": "Any"}, {"lineNumber": 122, "col_offset": 75, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 123, "col_offset": 20, "nodeName": "patch", "type": "Any"}, {"lineNumber": 127, "col_offset": 27, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 127, "col_offset": 82, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 128, "col_offset": 23, "nodeName": "cond", "type": "Any"}, {"lineNumber": 129, "col_offset": 24, "nodeName": "condS", "type": "Any"}, {"lineNumber": 131, "col_offset": 33, "nodeName": "range", "type": "Callable[..., List[int]]"}, {"lineNumber": 132, "col_offset": 24, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 135, "col_offset": 21, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 136, "col_offset": 20, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 137, "col_offset": 20, "nodeName": "img", "type": "Any"}, {"lineNumber": 69, "col_offset": 60, "nodeName": "shape", "type": "Any"}, {"lineNumber": 73, "col_offset": 38, "nodeName": "patch", "type": "Any"}, {"lineNumber": 74, "col_offset": 22, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 76, "col_offset": 27, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 80, "col_offset": 29, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 82, "col_offset": 28, "nodeName": "random", "type": "Any"}, {"lineNumber": 82, "col_offset": 49, "nodeName": "shape", "type": "Any"}, {"lineNumber": 83, "col_offset": 27, "nodeName": "np", "type": "module"}, {"lineNumber": 83, "col_offset": 42, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 85, "col_offset": 32, "nodeName": "expand_dims", "type": "Any"}, {"lineNumber": 86, "col_offset": 20, "nodeName": "patch", "type": "Any"}, {"lineNumber": 90, "col_offset": 22, "nodeName": "np", "type": "module"}, {"lineNumber": 90, "col_offset": 37, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 92, "col_offset": 27, "nodeName": "expand_dims", "type": "Any"}, {"lineNumber": 93, "col_offset": 16, "nodeName": "patch", "type": "Any"}, {"lineNumber": 111, "col_offset": 60, "nodeName": "shape", "type": "Any"}, {"lineNumber": 117, "col_offset": 37, "nodeName": "it", "type": "int"}, {"lineNumber": 119, "col_offset": 42, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 120, "col_offset": 26, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 122, "col_offset": 31, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 122, "col_offset": 64, "nodeName": "cond", "type": "Any"}, {"lineNumber": 127, "col_offset": 27, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 127, "col_offset": 60, "nodeName": "data", "type": "Any"}, {"lineNumber": 129, "col_offset": 32, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 129, "col_offset": 88, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 131, "col_offset": 39, "nodeName": "shape", "type": "Any"}, {"lineNumber": 133, "col_offset": 24, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 133, "col_offset": 39, "nodeName": "idx", "type": "Any"}, {"lineNumber": 133, "col_offset": 44, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 133, "col_offset": 49, "nodeName": "imgS", "type": "Any"}, {"lineNumber": 133, "col_offset": 55, "nodeName": "condS", "type": "Any"}, {"lineNumber": 133, "col_offset": 62, "nodeName": "noise", "type": "Any"}, {"lineNumber": 134, "col_offset": 30, "nodeName": "patch", "type": "Any"}, {"lineNumber": 137, "col_offset": 26, "nodeName": "expand_dims", "type": "Any"}, {"lineNumber": 138, "col_offset": 23, "nodeName": "cond", "type": "Any"}, {"lineNumber": 139, "col_offset": 24, "nodeName": "cond", "type": "Any"}, {"lineNumber": 140, "col_offset": 20, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 140, "col_offset": 35, "nodeName": "idx", "type": "Any"}, {"lineNumber": 140, "col_offset": 40, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 140, "col_offset": 45, "nodeName": "img", "type": "Any"}, {"lineNumber": 140, "col_offset": 50, "nodeName": "cond", "type": "Any"}, {"lineNumber": 140, "col_offset": 56, "nodeName": "noise", "type": "Any"}, {"lineNumber": 141, "col_offset": 26, "nodeName": "patch", "type": "Any"}, {"lineNumber": 69, "col_offset": 40, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 69, "col_offset": 60, "nodeName": "data", "type": "Any"}, {"lineNumber": 76, "col_offset": 27, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 80, "col_offset": 29, "nodeName": "patch", "type": "Any"}, {"lineNumber": 82, "col_offset": 28, "nodeName": "np", "type": "module"}, {"lineNumber": 82, "col_offset": 49, "nodeName": "data", "type": "Any"}, {"lineNumber": 83, "col_offset": 42, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 83, "col_offset": 75, "nodeName": "data", "type": "Any"}, {"lineNumber": 85, "col_offset": 32, "nodeName": "np", "type": "module"}, {"lineNumber": 85, "col_offset": 47, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 89, "col_offset": 27, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 90, "col_offset": 37, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 90, "col_offset": 70, "nodeName": "data", "type": "Any"}, {"lineNumber": 92, "col_offset": 27, "nodeName": "np", "type": "module"}, {"lineNumber": 92, "col_offset": 42, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 111, "col_offset": 40, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 111, "col_offset": 60, "nodeName": "data", "type": "Any"}, {"lineNumber": 117, "col_offset": 92, "nodeName": "n_interpolants", "type": "Any"}, {"lineNumber": 119, "col_offset": 42, "nodeName": "patch", "type": "Any"}, {"lineNumber": 120, "col_offset": 26, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 122, "col_offset": 31, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 126, "col_offset": 28, "nodeName": "p", "type": "Any"}, {"lineNumber": 126, "col_offset": 32, "nodeName": "d", "type": "Any"}, {"lineNumber": 127, "col_offset": 27, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 127, "col_offset": 60, "nodeName": "img", "type": "Any"}, {"lineNumber": 129, "col_offset": 32, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 129, "col_offset": 65, "nodeName": "data", "type": "Any"}, {"lineNumber": 131, "col_offset": 39, "nodeName": "data", "type": "Any"}, {"lineNumber": 132, "col_offset": 37, "nodeName": "slice", "type": "int"}, {"lineNumber": 133, "col_offset": 24, "nodeName": "patch", "type": "Any"}, {"lineNumber": 137, "col_offset": 26, "nodeName": "np", "type": "module"}, {"lineNumber": 137, "col_offset": 41, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 139, "col_offset": 31, "nodeName": "expand_dims", "type": "Any"}, {"lineNumber": 140, "col_offset": 20, "nodeName": "patch", "type": "Any"}, {"lineNumber": 69, "col_offset": 40, "nodeName": "patch", "type": "Any"}, {"lineNumber": 69, "col_offset": 60, "nodeName": "img", "type": "Any"}, {"lineNumber": 82, "col_offset": 49, "nodeName": "img", "type": "Any"}, {"lineNumber": 83, "col_offset": 42, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 83, "col_offset": 75, "nodeName": "img", "type": "Any"}, {"lineNumber": 83, "col_offset": 101, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 83, "col_offset": 110, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 85, "col_offset": 47, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 85, "col_offset": 80, "nodeName": "data", "type": "Any"}, {"lineNumber": 89, "col_offset": 27, "nodeName": "patch", "type": "Any"}, {"lineNumber": 90, "col_offset": 37, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 90, "col_offset": 70, "nodeName": "img", "type": "Any"}, {"lineNumber": 90, "col_offset": 89, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 90, "col_offset": 98, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 92, "col_offset": 42, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 92, "col_offset": 75, "nodeName": "data", "type": "Any"}, {"lineNumber": 111, "col_offset": 40, "nodeName": "patch", "type": "Any"}, {"lineNumber": 111, "col_offset": 60, "nodeName": "img", "type": "Any"}, {"lineNumber": 117, "col_offset": 43, "nodeName": "n_interpolants", "type": "Any"}, {"lineNumber": 117, "col_offset": 92, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 122, "col_offset": 31, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 126, "col_offset": 38, "nodeName": "p", "type": "Any"}, {"lineNumber": 126, "col_offset": 41, "nodeName": "d", "type": "Any"}, {"lineNumber": 126, "col_offset": 46, "nodeName": "zip", "type": "Callable"}, {"lineNumber": 127, "col_offset": 27, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 129, "col_offset": 32, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 129, "col_offset": 65, "nodeName": "cond", "type": "Any"}, {"lineNumber": 131, "col_offset": 39, "nodeName": "img", "type": "Any"}, {"lineNumber": 132, "col_offset": 47, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 136, "col_offset": 31, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 137, "col_offset": 41, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 137, "col_offset": 74, "nodeName": "data", "type": "Any"}, {"lineNumber": 139, "col_offset": 31, "nodeName": "np", "type": "module"}, {"lineNumber": 139, "col_offset": 46, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 83, "col_offset": 42, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 85, "col_offset": 47, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 85, "col_offset": 80, "nodeName": "cond", "type": "Any"}, {"lineNumber": 85, "col_offset": 107, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 85, "col_offset": 116, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 90, "col_offset": 37, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 92, "col_offset": 42, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 92, "col_offset": 75, "nodeName": "cond", "type": "Any"}, {"lineNumber": 92, "col_offset": 95, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 92, "col_offset": 104, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 117, "col_offset": 43, "nodeName": "self", "type": "InterpolatingInferenceGANSampler"}, {"lineNumber": 126, "col_offset": 74, "nodeName": "shape", "type": "Any"}, {"lineNumber": 129, "col_offset": 32, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 132, "col_offset": 47, "nodeName": "patch", "type": "Any"}, {"lineNumber": 136, "col_offset": 31, "nodeName": "patch", "type": "Any"}, {"lineNumber": 137, "col_offset": 41, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 137, "col_offset": 74, "nodeName": "img", "type": "Any"}, {"lineNumber": 137, "col_offset": 93, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 137, "col_offset": 102, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 139, "col_offset": 46, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 139, "col_offset": 79, "nodeName": "data", "type": "Any"}, {"lineNumber": 83, "col_offset": 88, "nodeName": "slice", "type": "Any"}, {"lineNumber": 85, "col_offset": 47, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 92, "col_offset": 42, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 126, "col_offset": 51, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 126, "col_offset": 74, "nodeName": "data", "type": "Any"}, {"lineNumber": 137, "col_offset": 41, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 139, "col_offset": 46, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 139, "col_offset": 79, "nodeName": "cond", "type": "Any"}, {"lineNumber": 139, "col_offset": 99, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 139, "col_offset": 108, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 85, "col_offset": 94, "nodeName": "slice", "type": "Any"}, {"lineNumber": 126, "col_offset": 51, "nodeName": "patch", "type": "Any"}, {"lineNumber": 126, "col_offset": 74, "nodeName": "img", "type": "Any"}, {"lineNumber": 139, "col_offset": 46, "nodeName": "scipy", "type": "Any"}]