[{"lineNumber": 75, "col_offset": 0, "nodeName": "l1_loss", "type": "Callable[..., Any]"}, {"lineNumber": 93, "col_offset": 0, "nodeName": "l2_loss", "type": "Callable[..., Any]"}, {"lineNumber": 107, "col_offset": 0, "nodeName": "rmse_loss", "type": "Callable[..., Any]"}, {"lineNumber": 123, "col_offset": 0, "nodeName": "mae_loss", "type": "Callable[..., Any]"}, {"lineNumber": 139, "col_offset": 0, "nodeName": "huber_loss", "type": "Callable[..., Any]"}, {"lineNumber": 13, "col_offset": 19, "nodeName": "Layer", "type": "Type[niftynet.layer.base_layer.Layer]"}, {"lineNumber": 81, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 100, "col_offset": 4, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 149, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 150, "col_offset": 4, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 151, "col_offset": 4, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 152, "col_offset": 4, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 162, "col_offset": 4, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 24, "col_offset": 8, "nodeName": "_data_loss_func", "type": "None"}, {"lineNumber": 28, "col_offset": 8, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 81, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 82, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 83, "col_offset": 8, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 84, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 85, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 87, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 88, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 89, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 100, "col_offset": 16, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 100, "col_offset": 28, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 100, "col_offset": 40, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 101, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 104, "col_offset": 11, "nodeName": "l2_loss", "type": "Any"}, {"lineNumber": 104, "col_offset": 25, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 114, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 115, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 116, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 117, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 130, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 131, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 132, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 133, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 149, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 150, "col_offset": 32, "nodeName": "less", "type": "Any"}, {"lineNumber": 150, "col_offset": 40, "nodeName": "delta", "type": "Any"}, {"lineNumber": 150, "col_offset": 47, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 152, "col_offset": 22, "nodeName": "delta", "type": "Any"}, {"lineNumber": 154, "col_offset": 21, "nodeName": "where", "type": "Any"}, {"lineNumber": 154, "col_offset": 30, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 155, "col_offset": 30, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 156, "col_offset": 30, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 157, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 158, "col_offset": 8, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 159, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 161, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 162, "col_offset": 15, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 162, "col_offset": 29, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 163, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 163, "col_offset": 22, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 163, "col_offset": 32, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "__init__", "type": "Callable[..., None]"}, {"lineNumber": 20, "col_offset": 11, "nodeName": "loss_func_params", "type": "Any"}, {"lineNumber": 21, "col_offset": 12, "nodeName": "_loss_func_params", "type": "Any"}, {"lineNumber": 21, "col_offset": 37, "nodeName": "loss_func_params", "type": "Any"}, {"lineNumber": 23, "col_offset": 12, "nodeName": "_loss_func_params", "type": "Dict[nothing, nothing]"}, {"lineNumber": 24, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 25, "col_offset": 8, "nodeName": "make_callable_loss_func", "type": "Callable[[Any], Any]"}, {"lineNumber": 25, "col_offset": 37, "nodeName": "loss_type", "type": "Any"}, {"lineNumber": 28, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 28, "col_offset": 31, "nodeName": "create", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 28, "col_offset": 60, "nodeName": "type_str", "type": "Any"}, {"lineNumber": 57, "col_offset": 12, "nodeName": "prediction", "type": "List[Any]"}, {"lineNumber": 59, "col_offset": 12, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 60, "col_offset": 16, "nodeName": "pred", "type": "Any"}, {"lineNumber": 60, "col_offset": 24, "nodeName": "prediction", "type": "List[Any]"}, {"lineNumber": 81, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 81, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 81, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 81, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 83, "col_offset": 29, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 83, "col_offset": 41, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 83, "col_offset": 61, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 84, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 84, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 85, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 85, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 87, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 87, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 88, "col_offset": 22, "nodeName": "size", "type": "Any"}, {"lineNumber": 88, "col_offset": 30, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 89, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 89, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 89, "col_offset": 30, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 90, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 90, "col_offset": 30, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 100, "col_offset": 16, "nodeName": "tf", "type": "Any"}, {"lineNumber": 104, "col_offset": 11, "nodeName": "nn", "type": "Any"}, {"lineNumber": 115, "col_offset": 20, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 115, "col_offset": 32, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 115, "col_offset": 44, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 116, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 116, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 116, "col_offset": 43, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 117, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 117, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 117, "col_offset": 43, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 118, "col_offset": 15, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 120, "col_offset": 15, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 131, "col_offset": 20, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 131, "col_offset": 32, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 131, "col_offset": 44, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 132, "col_offset": 20, "nodeName": "abs", "type": "Any"}, {"lineNumber": 132, "col_offset": 27, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 133, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 133, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 133, "col_offset": 43, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 136, "col_offset": 15, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 149, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 149, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 149, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 149, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 150, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 151, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 152, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 154, "col_offset": 21, "nodeName": "tf", "type": "Any"}, {"lineNumber": 158, "col_offset": 25, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 158, "col_offset": 37, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 158, "col_offset": 53, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 159, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 159, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 161, "col_offset": 22, "nodeName": "to_float", "type": "Any"}, {"lineNumber": 162, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 163, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 19, "col_offset": 48, "nodeName": "name", "type": "Any"}, {"lineNumber": 21, "col_offset": 12, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 23, "col_offset": 12, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 25, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 28, "col_offset": 31, "nodeName": "LossRegressionFactory", "type": "Type[niftynet.engine.application_factory.LossRegressionFactory]"}, {"lineNumber": 50, "col_offset": 13, "nodeName": "device", "type": "Any"}, {"lineNumber": 51, "col_offset": 15, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 52, "col_offset": 16, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 53, "col_offset": 15, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 54, "col_offset": 16, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 56, "col_offset": 16, "nodeName": "prediction", "type": "List[Any]"}, {"lineNumber": 61, "col_offset": 19, "nodeName": "_loss_func_params", "type": "Union[Any, Dict[nothing, nothing]]"}, {"lineNumber": 72, "col_offset": 19, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 72, "col_offset": 34, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 81, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 83, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 84, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 85, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 87, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 88, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 89, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 89, "col_offset": 51, "nodeName": "float32", "type": "Any"}, {"lineNumber": 90, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 90, "col_offset": 49, "nodeName": "float32", "type": "Any"}, {"lineNumber": 103, "col_offset": 12, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 103, "col_offset": 24, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 103, "col_offset": 35, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 103, "col_offset": 49, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 103, "col_offset": 63, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 104, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 115, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 116, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 117, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 118, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 120, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 120, "col_offset": 23, "nodeName": "mean_squared_error", "type": "Any"}, {"lineNumber": 120, "col_offset": 52, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 120, "col_offset": 64, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 131, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 132, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 133, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 134, "col_offset": 15, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 134, "col_offset": 30, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 134, "col_offset": 43, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 134, "col_offset": 58, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 136, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 136, "col_offset": 30, "nodeName": "abs", "type": "Any"}, {"lineNumber": 149, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 152, "col_offset": 52, "nodeName": "delta", "type": "Any"}, {"lineNumber": 158, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 159, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 161, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 161, "col_offset": 34, "nodeName": "size", "type": "Any"}, {"lineNumber": 161, "col_offset": 42, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 19, "col_offset": 14, "nodeName": "LossFunction", "type": "Type[LossFunction]"}, {"lineNumber": 19, "col_offset": 28, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 50, "col_offset": 13, "nodeName": "tf", "type": "Any"}, {"lineNumber": 52, "col_offset": 31, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 52, "col_offset": 42, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 54, "col_offset": 29, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 54, "col_offset": 40, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 55, "col_offset": 19, "nodeName": "isinstance", "type": "Callable[[Any, Union[Type[Any], Tuple[Union[Type[Any], Tuple[Type[Any], ...]], ...]]], bool]"}, {"lineNumber": 55, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 56, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 57, "col_offset": 26, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 57, "col_offset": 37, "nodeName": "pred", "type": "Any"}, {"lineNumber": 57, "col_offset": 53, "nodeName": "pred", "type": "Any"}, {"lineNumber": 57, "col_offset": 61, "nodeName": "prediction", "type": "Union[List[Any], Any]"}, {"lineNumber": 61, "col_offset": 19, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 72, "col_offset": 19, "nodeName": "tf", "type": "Any"}, {"lineNumber": 89, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 90, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 103, "col_offset": 12, "nodeName": "tf", "type": "Any"}, {"lineNumber": 103, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 118, "col_offset": 23, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 118, "col_offset": 38, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 118, "col_offset": 51, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 118, "col_offset": 66, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 120, "col_offset": 23, "nodeName": "losses", "type": "Any"}, {"lineNumber": 134, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 134, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 136, "col_offset": 30, "nodeName": "tf", "type": "Any"}, {"lineNumber": 136, "col_offset": 37, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 136, "col_offset": 49, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 136, "col_offset": 61, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 161, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 52, "col_offset": 31, "nodeName": "tf", "type": "Any"}, {"lineNumber": 54, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 55, "col_offset": 43, "nodeName": "list", "type": "Type[List[Any]]"}, {"lineNumber": 55, "col_offset": 49, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 57, "col_offset": 26, "nodeName": "tf", "type": "Any"}, {"lineNumber": 62, "col_offset": 20, "nodeName": "append", "type": "Callable"}, {"lineNumber": 68, "col_offset": 20, "nodeName": "append", "type": "Callable"}, {"lineNumber": 118, "col_offset": 23, "nodeName": "tf", "type": "Any"}, {"lineNumber": 118, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 120, "col_offset": 23, "nodeName": "tf", "type": "Any"}, {"lineNumber": 136, "col_offset": 37, "nodeName": "tf", "type": "Any"}, {"lineNumber": 62, "col_offset": 20, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 62, "col_offset": 37, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 68, "col_offset": 20, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 68, "col_offset": 37, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 62, "col_offset": 37, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 63, "col_offset": 35, "nodeName": "pred", "type": "Any"}, {"lineNumber": 64, "col_offset": 37, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 65, "col_offset": 35, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 66, "col_offset": 26, "nodeName": "_loss_func_params", "type": "Union[Any, Dict[nothing, nothing]]"}, {"lineNumber": 68, "col_offset": 37, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 69, "col_offset": 35, "nodeName": "pred", "type": "Any"}, {"lineNumber": 70, "col_offset": 37, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 71, "col_offset": 35, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 66, "col_offset": 26, "nodeName": "self", "type": "LossFunction"}]