[{"lineNumber": 91, "col_offset": 0, "nodeName": "l1_loss", "type": "Callable[..., Any]"}, {"lineNumber": 109, "col_offset": 0, "nodeName": "l2_loss", "type": "Callable[..., Any]"}, {"lineNumber": 123, "col_offset": 0, "nodeName": "rmse_loss", "type": "Callable[..., Any]"}, {"lineNumber": 139, "col_offset": 0, "nodeName": "mae_loss", "type": "Callable[..., Any]"}, {"lineNumber": 155, "col_offset": 0, "nodeName": "huber_loss", "type": "Callable[..., Any]"}, {"lineNumber": 183, "col_offset": 0, "nodeName": "smooth_l1_loss", "type": "Callable[..., Any]"}, {"lineNumber": 236, "col_offset": 0, "nodeName": "cosine_loss", "type": "Callable[..., Any]"}, {"lineNumber": 13, "col_offset": 19, "nodeName": "Layer", "type": "Type[niftynet.layer.base_layer.Layer]"}, {"lineNumber": 97, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 116, "col_offset": 4, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 166, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 167, "col_offset": 4, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 168, "col_offset": 4, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 169, "col_offset": 4, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 179, "col_offset": 4, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 199, "col_offset": 4, "nodeName": "value_correction", "type": "Any"}, {"lineNumber": 201, "col_offset": 4, "nodeName": "value_correction_max", "type": "Any"}, {"lineNumber": 204, "col_offset": 4, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 206, "col_offset": 4, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 246, "col_offset": 7, "nodeName": "to_complete", "type": "Any"}, {"lineNumber": 264, "col_offset": 4, "nodeName": "loss", "type": "Any"}, {"lineNumber": 265, "col_offset": 4, "nodeName": "loss", "type": "Any"}, {"lineNumber": 266, "col_offset": 11, "nodeName": "loss", "type": "Any"}, {"lineNumber": 22, "col_offset": 8, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 97, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 98, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 99, "col_offset": 8, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 100, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 101, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 103, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 104, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 105, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 116, "col_offset": 16, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 116, "col_offset": 28, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 116, "col_offset": 40, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 117, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 120, "col_offset": 11, "nodeName": "l2_loss", "type": "Any"}, {"lineNumber": 120, "col_offset": 25, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 130, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 131, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 132, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 133, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 146, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 147, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 148, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 149, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 166, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 167, "col_offset": 32, "nodeName": "less", "type": "Any"}, {"lineNumber": 167, "col_offset": 40, "nodeName": "delta", "type": "Any"}, {"lineNumber": 167, "col_offset": 47, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 169, "col_offset": 22, "nodeName": "delta", "type": "Any"}, {"lineNumber": 171, "col_offset": 21, "nodeName": "where", "type": "Any"}, {"lineNumber": 171, "col_offset": 30, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 172, "col_offset": 30, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 173, "col_offset": 30, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 174, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 175, "col_offset": 8, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 176, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 178, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 179, "col_offset": 15, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 179, "col_offset": 29, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 180, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 180, "col_offset": 22, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 180, "col_offset": 32, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 193, "col_offset": 7, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 194, "col_offset": 8, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 194, "col_offset": 27, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 195, "col_offset": 8, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 197, "col_offset": 8, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 199, "col_offset": 43, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 201, "col_offset": 27, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 202, "col_offset": 4, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 202, "col_offset": 10, "nodeName": "value_correction_max", "type": "Any"}, {"lineNumber": 202, "col_offset": 33, "nodeName": "value_correction", "type": "Any"}, {"lineNumber": 204, "col_offset": 17, "nodeName": "cast", "type": "Any"}, {"lineNumber": 204, "col_offset": 25, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 206, "col_offset": 19, "nodeName": "cast", "type": "Any"}, {"lineNumber": 206, "col_offset": 27, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 208, "col_offset": 25, "nodeName": "cast", "type": "Any"}, {"lineNumber": 212, "col_offset": 25, "nodeName": "where", "type": "Any"}, {"lineNumber": 217, "col_offset": 25, "nodeName": "where", "type": "Any"}, {"lineNumber": 219, "col_offset": 52, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 220, "col_offset": 25, "nodeName": "Print", "type": "Any"}, {"lineNumber": 222, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 224, "col_offset": 8, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 225, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 227, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 230, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 231, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 232, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 251, "col_offset": 8, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 253, "col_offset": 8, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 255, "col_offset": 8, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 255, "col_offset": 20, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 256, "col_offset": 8, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 256, "col_offset": 18, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 257, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 258, "col_offset": 8, "nodeName": "weight_map", "type": "float"}, {"lineNumber": 260, "col_offset": 16, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 262, "col_offset": 14, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 264, "col_offset": 11, "nodeName": "cosine_distance", "type": "Any"}, {"lineNumber": 264, "col_offset": 37, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 264, "col_offset": 46, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 265, "col_offset": 11, "nodeName": "where", "type": "Any"}, {"lineNumber": 265, "col_offset": 58, "nodeName": "loss", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "__init__", "type": "Callable[..., None]"}, {"lineNumber": 22, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 22, "col_offset": 31, "nodeName": "create", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 22, "col_offset": 60, "nodeName": "loss_type", "type": "Any"}, {"lineNumber": 24, "col_offset": 12, "nodeName": "loss_func_params", "type": "Any"}, {"lineNumber": 48, "col_offset": 12, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "value", "type": "Any"}, {"lineNumber": 49, "col_offset": 12, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 55, "col_offset": 12, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 97, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 97, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 97, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 97, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 99, "col_offset": 29, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 99, "col_offset": 41, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 99, "col_offset": 61, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 100, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 100, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 101, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 101, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 103, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 103, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 104, "col_offset": 22, "nodeName": "size", "type": "Any"}, {"lineNumber": 104, "col_offset": 30, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 105, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 105, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 105, "col_offset": 30, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 106, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 106, "col_offset": 30, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 116, "col_offset": 16, "nodeName": "tf", "type": "Any"}, {"lineNumber": 120, "col_offset": 11, "nodeName": "nn", "type": "Any"}, {"lineNumber": 131, "col_offset": 20, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 131, "col_offset": 32, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 131, "col_offset": 44, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 132, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 132, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 132, "col_offset": 43, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 133, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 133, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 133, "col_offset": 43, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 134, "col_offset": 15, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 136, "col_offset": 15, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 147, "col_offset": 20, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 147, "col_offset": 32, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 147, "col_offset": 44, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 148, "col_offset": 20, "nodeName": "abs", "type": "Any"}, {"lineNumber": 148, "col_offset": 27, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 149, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 149, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 149, "col_offset": 43, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 152, "col_offset": 15, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 166, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 166, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 166, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 166, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 167, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 168, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 169, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 171, "col_offset": 21, "nodeName": "tf", "type": "Any"}, {"lineNumber": 175, "col_offset": 25, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 175, "col_offset": 37, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 175, "col_offset": 53, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 176, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 176, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 178, "col_offset": 22, "nodeName": "to_float", "type": "Any"}, {"lineNumber": 179, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 180, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 195, "col_offset": 27, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 197, "col_offset": 33, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 199, "col_offset": 23, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 201, "col_offset": 46, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 204, "col_offset": 17, "nodeName": "tf", "type": "Any"}, {"lineNumber": 204, "col_offset": 43, "nodeName": "float32", "type": "Any"}, {"lineNumber": 206, "col_offset": 19, "nodeName": "tf", "type": "Any"}, {"lineNumber": 206, "col_offset": 47, "nodeName": "float32", "type": "Any"}, {"lineNumber": 208, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 208, "col_offset": 33, "nodeName": "abs", "type": "Any"}, {"lineNumber": 210, "col_offset": 39, "nodeName": "float32", "type": "Any"}, {"lineNumber": 212, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 212, "col_offset": 34, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 212, "col_offset": 55, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 213, "col_offset": 34, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 215, "col_offset": 43, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 215, "col_offset": 64, "nodeName": "value_correction", "type": "Any"}, {"lineNumber": 217, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 217, "col_offset": 34, "nodeName": "greater", "type": "Any"}, {"lineNumber": 217, "col_offset": 45, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 217, "col_offset": 64, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 219, "col_offset": 30, "nodeName": "value_correction_max", "type": "Any"}, {"lineNumber": 220, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 220, "col_offset": 34, "nodeName": "cast", "type": "Any"}, {"lineNumber": 220, "col_offset": 42, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 220, "col_offset": 62, "nodeName": "float32", "type": "Any"}, {"lineNumber": 221, "col_offset": 35, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 224, "col_offset": 29, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 224, "col_offset": 41, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 224, "col_offset": 61, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 225, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 225, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 227, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 227, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 230, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 230, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 231, "col_offset": 22, "nodeName": "size", "type": "Any"}, {"lineNumber": 231, "col_offset": 30, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 232, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 232, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 232, "col_offset": 30, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 233, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 233, "col_offset": 30, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 247, "col_offset": 30, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 249, "col_offset": 32, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 251, "col_offset": 20, "nodeName": "concat", "type": "Any"}, {"lineNumber": 253, "col_offset": 18, "nodeName": "concat", "type": "Any"}, {"lineNumber": 260, "col_offset": 28, "nodeName": "maximum", "type": "Any"}, {"lineNumber": 262, "col_offset": 24, "nodeName": "maximum", "type": "Any"}, {"lineNumber": 264, "col_offset": 11, "nodeName": "losses", "type": "Any"}, {"lineNumber": 264, "col_offset": 69, "nodeName": "weight_map", "type": "Union[Any, float]"}, {"lineNumber": 265, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 265, "col_offset": 20, "nodeName": "is_nan", "type": "Any"}, {"lineNumber": 265, "col_offset": 30, "nodeName": "loss", "type": "Any"}, {"lineNumber": 265, "col_offset": 37, "nodeName": "zeros_like", "type": "Any"}, {"lineNumber": 265, "col_offset": 51, "nodeName": "loss", "type": "Any"}, {"lineNumber": 19, "col_offset": 48, "nodeName": "name", "type": "Any"}, {"lineNumber": 22, "col_offset": 31, "nodeName": "LossRegressionFactory", "type": "Type[niftynet.engine.application_factory.LossRegressionFactory]"}, {"lineNumber": 24, "col_offset": 32, "nodeName": "loss_func_params", "type": "Any"}, {"lineNumber": 47, "col_offset": 13, "nodeName": "device", "type": "Any"}, {"lineNumber": 49, "col_offset": 27, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 49, "col_offset": 38, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 50, "col_offset": 15, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 51, "col_offset": 16, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 53, "col_offset": 16, "nodeName": "prediction", "type": "List[Any]"}, {"lineNumber": 56, "col_offset": 16, "nodeName": "ind", "type": "int"}, {"lineNumber": 56, "col_offset": 21, "nodeName": "pred", "type": "Any"}, {"lineNumber": 56, "col_offset": 29, "nodeName": "enumerate", "type": "Type[enumerate[Any]]"}, {"lineNumber": 56, "col_offset": 39, "nodeName": "prediction", "type": "Union[List[Any], Any]"}, {"lineNumber": 88, "col_offset": 19, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 88, "col_offset": 34, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 97, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 99, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 100, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 101, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 103, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 104, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 105, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 105, "col_offset": 51, "nodeName": "float32", "type": "Any"}, {"lineNumber": 106, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 106, "col_offset": 49, "nodeName": "float32", "type": "Any"}, {"lineNumber": 119, "col_offset": 12, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 119, "col_offset": 24, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 119, "col_offset": 35, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 119, "col_offset": 49, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 119, "col_offset": 63, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 120, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 131, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 132, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 133, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 134, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 136, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 136, "col_offset": 23, "nodeName": "mean_squared_error", "type": "Any"}, {"lineNumber": 136, "col_offset": 52, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 136, "col_offset": 64, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 147, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 148, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 149, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 150, "col_offset": 15, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 150, "col_offset": 30, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 150, "col_offset": 43, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 150, "col_offset": 58, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 152, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 152, "col_offset": 30, "nodeName": "abs", "type": "Any"}, {"lineNumber": 166, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 169, "col_offset": 52, "nodeName": "delta", "type": "Any"}, {"lineNumber": 175, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 176, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 178, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 178, "col_offset": 34, "nodeName": "size", "type": "Any"}, {"lineNumber": 178, "col_offset": 42, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 204, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 206, "col_offset": 47, "nodeName": "tf", "type": "Any"}, {"lineNumber": 208, "col_offset": 33, "nodeName": "tf", "type": "Any"}, {"lineNumber": 208, "col_offset": 40, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 208, "col_offset": 52, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 209, "col_offset": 61, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 210, "col_offset": 39, "nodeName": "tf", "type": "Any"}, {"lineNumber": 214, "col_offset": 43, "nodeName": "square", "type": "Any"}, {"lineNumber": 214, "col_offset": 53, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 217, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 218, "col_offset": 34, "nodeName": "square", "type": "Any"}, {"lineNumber": 219, "col_offset": 8, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 220, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 220, "col_offset": 62, "nodeName": "tf", "type": "Any"}, {"lineNumber": 224, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 225, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 227, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 230, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 231, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 232, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 232, "col_offset": 51, "nodeName": "float32", "type": "Any"}, {"lineNumber": 233, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 233, "col_offset": 49, "nodeName": "float32", "type": "Any"}, {"lineNumber": 247, "col_offset": 30, "nodeName": "tf", "type": "Any"}, {"lineNumber": 249, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 251, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 251, "col_offset": 31, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 253, "col_offset": 18, "nodeName": "tf", "type": "Any"}, {"lineNumber": 253, "col_offset": 29, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 260, "col_offset": 28, "nodeName": "tf", "type": "Any"}, {"lineNumber": 260, "col_offset": 39, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 262, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 262, "col_offset": 35, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 264, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 265, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 265, "col_offset": 37, "nodeName": "tf", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 19, "col_offset": 14, "nodeName": "LossFunction", "type": "Type[LossFunction]"}, {"lineNumber": 19, "col_offset": 28, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 47, "col_offset": 13, "nodeName": "tf", "type": "Any"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "shape", "type": "Any"}, {"lineNumber": 49, "col_offset": 27, "nodeName": "tf", "type": "Any"}, {"lineNumber": 49, "col_offset": 53, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 51, "col_offset": 29, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 51, "col_offset": 40, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 52, "col_offset": 19, "nodeName": "isinstance", "type": "Callable[[Any, Union[Type[Any], Tuple[Union[Type[Any], Tuple[Type[Any], ...]], ...]]], bool]"}, {"lineNumber": 52, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 53, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 66, "col_offset": 20, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 72, "col_offset": 23, "nodeName": "_loss_func_params", "type": "Union[Any, Dict[nothing, nothing]]"}, {"lineNumber": 77, "col_offset": 19, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 78, "col_offset": 20, "nodeName": "elements", "type": "Tuple[Any, Any, Any]"}, {"lineNumber": 80, "col_offset": 20, "nodeName": "elements", "type": "Tuple[Any, Any]"}, {"lineNumber": 82, "col_offset": 29, "nodeName": "map_fn", "type": "Any"}, {"lineNumber": 87, "col_offset": 16, "nodeName": "append", "type": "Callable"}, {"lineNumber": 88, "col_offset": 19, "nodeName": "tf", "type": "Any"}, {"lineNumber": 105, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 106, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 119, "col_offset": 12, "nodeName": "tf", "type": "Any"}, {"lineNumber": 119, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 134, "col_offset": 23, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 134, "col_offset": 38, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 134, "col_offset": 51, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 134, "col_offset": 66, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 136, "col_offset": 23, "nodeName": "losses", "type": "Any"}, {"lineNumber": 150, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 150, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 152, "col_offset": 30, "nodeName": "tf", "type": "Any"}, {"lineNumber": 152, "col_offset": 37, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 152, "col_offset": 49, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 152, "col_offset": 61, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 178, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 208, "col_offset": 40, "nodeName": "tf", "type": "Any"}, {"lineNumber": 214, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 218, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 232, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 233, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 247, "col_offset": 42, "nodeName": "minimum", "type": "Any"}, {"lineNumber": 249, "col_offset": 44, "nodeName": "minimum", "type": "Any"}, {"lineNumber": 251, "col_offset": 44, "nodeName": "prediction_complete", "type": "Any"}, {"lineNumber": 253, "col_offset": 44, "nodeName": "ground_truth_complete", "type": "Any"}, {"lineNumber": 260, "col_offset": 39, "nodeName": "tf", "type": "Any"}, {"lineNumber": 260, "col_offset": 47, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 262, "col_offset": 35, "nodeName": "tf", "type": "Any"}, {"lineNumber": 262, "col_offset": 43, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 51, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 51, "col_offset": 53, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 52, "col_offset": 43, "nodeName": "list", "type": "Type[List[Any]]"}, {"lineNumber": 52, "col_offset": 49, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 63, "col_offset": 24, "nodeName": "weight_map_b", "type": "None"}, {"lineNumber": 66, "col_offset": 29, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 66, "col_offset": 40, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 69, "col_offset": 38, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 70, "col_offset": 40, "nodeName": "ground_truth_b", "type": "Any"}, {"lineNumber": 71, "col_offset": 38, "nodeName": "weight_map_b", "type": "Optional[Any]"}, {"lineNumber": 72, "col_offset": 23, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 75, "col_offset": 27, "nodeName": "to_float", "type": "Any"}, {"lineNumber": 78, "col_offset": 32, "nodeName": "pred", "type": "Any"}, {"lineNumber": 78, "col_offset": 38, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 78, "col_offset": 52, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 80, "col_offset": 32, "nodeName": "pred", "type": "Any"}, {"lineNumber": 80, "col_offset": 38, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 82, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 83, "col_offset": 23, "nodeName": "_batch_i_loss", "type": "Callable[..., Any]"}, {"lineNumber": 84, "col_offset": 26, "nodeName": "elements", "type": "Union[Tuple[Any, Any, Any], Tuple[Any, Any]]"}, {"lineNumber": 85, "col_offset": 26, "nodeName": "float32", "type": "Any"}, {"lineNumber": 87, "col_offset": 16, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 87, "col_offset": 33, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 87, "col_offset": 48, "nodeName": "loss_batch", "type": "Any"}, {"lineNumber": 134, "col_offset": 23, "nodeName": "tf", "type": "Any"}, {"lineNumber": 134, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 136, "col_offset": 23, "nodeName": "tf", "type": "Any"}, {"lineNumber": 152, "col_offset": 37, "nodeName": "tf", "type": "Any"}, {"lineNumber": 247, "col_offset": 42, "nodeName": "tf", "type": "Any"}, {"lineNumber": 247, "col_offset": 53, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 249, "col_offset": 44, "nodeName": "tf", "type": "Any"}, {"lineNumber": 249, "col_offset": 55, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 260, "col_offset": 47, "nodeName": "tf", "type": "Any"}, {"lineNumber": 260, "col_offset": 61, "nodeName": "square", "type": "Any"}, {"lineNumber": 261, "col_offset": 8, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 262, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 262, "col_offset": 57, "nodeName": "square", "type": "Any"}, {"lineNumber": 263, "col_offset": 8, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 61, "col_offset": 23, "nodeName": "len", "type": "Callable[[Sized], int]"}, {"lineNumber": 62, "col_offset": 24, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 62, "col_offset": 32, "nodeName": "ground_truth_b", "type": "Any"}, {"lineNumber": 62, "col_offset": 49, "nodeName": "args", "type": "Tuple[Any, ...]"}, {"lineNumber": 65, "col_offset": 24, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 65, "col_offset": 32, "nodeName": "ground_truth_b", "type": "Any"}, {"lineNumber": 65, "col_offset": 48, "nodeName": "weight_map_b", "type": "Any"}, {"lineNumber": 65, "col_offset": 63, "nodeName": "args", "type": "Tuple[Any, ...]"}, {"lineNumber": 66, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 73, "col_offset": 24, "nodeName": "update", "type": "Callable"}, {"lineNumber": 73, "col_offset": 43, "nodeName": "_loss_func_params", "type": "Union[Any, Dict[nothing, nothing]]"}, {"lineNumber": 75, "col_offset": 27, "nodeName": "tf", "type": "Any"}, {"lineNumber": 75, "col_offset": 39, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 85, "col_offset": 26, "nodeName": "tf", "type": "Any"}, {"lineNumber": 87, "col_offset": 33, "nodeName": "tf", "type": "Any"}, {"lineNumber": 247, "col_offset": 53, "nodeName": "tf", "type": "Any"}, {"lineNumber": 247, "col_offset": 67, "nodeName": "square", "type": "Any"}, {"lineNumber": 248, "col_offset": 12, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 249, "col_offset": 55, "nodeName": "tf", "type": "Any"}, {"lineNumber": 249, "col_offset": 69, "nodeName": "square", "type": "Any"}, {"lineNumber": 250, "col_offset": 12, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 260, "col_offset": 61, "nodeName": "tf", "type": "Any"}, {"lineNumber": 262, "col_offset": 57, "nodeName": "tf", "type": "Any"}, {"lineNumber": 61, "col_offset": 27, "nodeName": "args", "type": "Tuple[Any, ...]"}, {"lineNumber": 73, "col_offset": 24, "nodeName": "loss_params", "type": "Dict[Union[str, Any], Any]"}, {"lineNumber": 73, "col_offset": 43, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 75, "col_offset": 39, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 75, "col_offset": 62, "nodeName": "loss_params", "type": "Dict[Union[str, Any], Any]"}, {"lineNumber": 247, "col_offset": 67, "nodeName": "tf", "type": "Any"}, {"lineNumber": 249, "col_offset": 69, "nodeName": "tf", "type": "Any"}]