[{"lineNumber": 3, "col_offset": 15, "nodeName": "object", "type": "Type[object]"}, {"lineNumber": 5, "col_offset": 4, "nodeName": "__init__", "type": "Callable[[Any, Any, Any, Any, Any], Any]"}, {"lineNumber": 11, "col_offset": 8, "nodeName": "input_image", "type": "Any"}, {"lineNumber": 11, "col_offset": 27, "nodeName": "input_image", "type": "Any"}, {"lineNumber": 12, "col_offset": 8, "nodeName": "target_image", "type": "Any"}, {"lineNumber": 12, "col_offset": 28, "nodeName": "target_image", "type": "Any"}, {"lineNumber": 13, "col_offset": 8, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 13, "col_offset": 26, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 14, "col_offset": 8, "nodeName": "target_note", "type": "Any"}, {"lineNumber": 14, "col_offset": 27, "nodeName": "target_note", "type": "Any"}, {"lineNumber": 16, "col_offset": 8, "nodeName": "input_interp_order", "type": "int"}, {"lineNumber": 17, "col_offset": 8, "nodeName": "target_interp_order", "type": "int"}, {"lineNumber": 11, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 12, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 13, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 14, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 16, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 17, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 26, "col_offset": 12, "nodeName": "create_array_files_from_csv", "type": "Callable[..., Tuple[Optional[List[List[str]]], Optional[List[List[List[str]]]]]]"}, {"lineNumber": 26, "col_offset": 49, "nodeName": "input_image_file", "type": "Any"}, {"lineNumber": 27, "col_offset": 49, "nodeName": "allow_missing", "type": "Any"}, {"lineNumber": 28, "col_offset": 11, "nodeName": "target_image_file", "type": "Any"}, {"lineNumber": 35, "col_offset": 11, "nodeName": "weight_map_file", "type": "Any"}, {"lineNumber": 41, "col_offset": 11, "nodeName": "target_note_file", "type": "Any"}, {"lineNumber": 26, "col_offset": 12, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 30, "col_offset": 16, "nodeName": "create_array_files_from_csv", "type": "Callable[..., Tuple[Optional[List[List[str]]], Optional[List[List[List[str]]]]]]"}, {"lineNumber": 30, "col_offset": 53, "nodeName": "target_image_file", "type": "Any"}, {"lineNumber": 31, "col_offset": 53, "nodeName": "allow_missing", "type": "Any"}, {"lineNumber": 33, "col_offset": 16, "nodeName": "match_second_degree", "type": "Callable[[Any, Any], Tuple[Any, Any, Any, Any]]"}, {"lineNumber": 33, "col_offset": 45, "nodeName": "input_image_id", "type": "Optional[List[List[str]]]"}, {"lineNumber": 33, "col_offset": 61, "nodeName": "target_image_id", "type": "Optional[List[List[str]]]"}, {"lineNumber": 37, "col_offset": 16, "nodeName": "create_array_files_from_csv", "type": "Callable[..., Tuple[Optional[List[List[str]]], Optional[List[List[List[str]]]]]]"}, {"lineNumber": 37, "col_offset": 53, "nodeName": "weight_map_file", "type": "Any"}, {"lineNumber": 38, "col_offset": 53, "nodeName": "allow_missing", "type": "Any"}, {"lineNumber": 40, "col_offset": 16, "nodeName": "match_second_degree", "type": "Callable[[Any, Any], Tuple[Any, Any, Any, Any]]"}, {"lineNumber": 40, "col_offset": 45, "nodeName": "input_image_id", "type": "Optional[List[List[str]]]"}, {"lineNumber": 40, "col_offset": 61, "nodeName": "weight_map_id", "type": "Optional[Union[List[List[str]], List[List[List[str]]]]]"}, {"lineNumber": 43, "col_offset": 16, "nodeName": "create_array_files_from_csv", "type": "Callable[..., Tuple[Optional[List[List[str]]], Optional[List[List[List[str]]]]]]"}, {"lineNumber": 43, "col_offset": 53, "nodeName": "target_note_file", "type": "Any"}, {"lineNumber": 44, "col_offset": 53, "nodeName": "allow_missing", "type": "Any"}, {"lineNumber": 46, "col_offset": 16, "nodeName": "match_second_degree", "type": "Callable[[Any, Any], Tuple[Any, Any, Any, Any]]"}, {"lineNumber": 46, "col_offset": 45, "nodeName": "input_image_id", "type": "Optional[List[List[str]]]"}, {"lineNumber": 46, "col_offset": 61, "nodeName": "weight_map_id", "type": "Optional[Union[List[List[str]], List[List[List[str]]]]]"}, {"lineNumber": 30, "col_offset": 16, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 33, "col_offset": 16, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 37, "col_offset": 16, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 40, "col_offset": 16, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 43, "col_offset": 16, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 46, "col_offset": 16, "nodeName": "misc_csv", "type": "module"}]