[{"lineNumber": 13, "col_offset": 17, "nodeName": "BaseSampler", "type": "Type[niftynet.engine.base_sampler.BaseSampler]"}, {"lineNumber": 27, "col_offset": 8, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 27, "col_offset": 29, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 46, "col_offset": 8, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 46, "col_offset": 23, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 47, "col_offset": 8, "nodeName": "local_layers", "type": "List[Any]"}, {"lineNumber": 48, "col_offset": 8, "nodeName": "patch", "type": "Any"}, {"lineNumber": 49, "col_offset": 14, "nodeName": "has_next", "type": "Any"}, {"lineNumber": 26, "col_offset": 8, "nodeName": "__init__", "type": "Callable[..., None]"}, {"lineNumber": 27, "col_offset": 8, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 28, "col_offset": 11, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 29, "col_offset": 10, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 29, "col_offset": 34, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 33, "col_offset": 10, "nodeName": "patch_per_volume", "type": "int"}, {"lineNumber": 34, "col_offset": 11, "nodeName": "data_augmentation_methods", "type": "Any"}, {"lineNumber": 35, "col_offset": 12, "nodeName": "data_augmentation_layers", "type": "List[nothing]"}, {"lineNumber": 37, "col_offset": 12, "nodeName": "data_augmentation_layers", "type": "Any"}, {"lineNumber": 37, "col_offset": 44, "nodeName": "data_augmentation_methods", "type": "Any"}, {"lineNumber": 46, "col_offset": 23, "nodeName": "patch", "type": "Any"}, {"lineNumber": 48, "col_offset": 16, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "patch", "type": "Any"}, {"lineNumber": 49, "col_offset": 14, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 54, "col_offset": 12, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 54, "col_offset": 31, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 67, "col_offset": 16, "nodeName": "aug", "type": "Any"}, {"lineNumber": 67, "col_offset": 23, "nodeName": "local_layers", "type": "List[Any]"}, {"lineNumber": 70, "col_offset": 12, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 72, "col_offset": 12, "nodeName": "noise", "type": "Any"}, {"lineNumber": 26, "col_offset": 47, "nodeName": "patch", "type": "Any"}, {"lineNumber": 26, "col_offset": 59, "nodeName": "name", "type": "Any"}, {"lineNumber": 28, "col_offset": 11, "nodeName": "patch", "type": "Any"}, {"lineNumber": 29, "col_offset": 10, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 31, "col_offset": 13, "nodeName": "patch_per_volume", "type": "Any"}, {"lineNumber": 33, "col_offset": 10, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 35, "col_offset": 12, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 37, "col_offset": 12, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 46, "col_offset": 23, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 47, "col_offset": 24, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 47, "col_offset": 33, "nodeName": "x", "type": "Any"}, {"lineNumber": 47, "col_offset": 40, "nodeName": "x", "type": "Any"}, {"lineNumber": 47, "col_offset": 45, "nodeName": "data_augmentation_layers", "type": "Union[List[nothing], Any]"}, {"lineNumber": 48, "col_offset": 25, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 49, "col_offset": 14, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 50, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 50, "col_offset": 17, "nodeName": "cond", "type": "Any"}, {"lineNumber": 50, "col_offset": 23, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 50, "col_offset": 35, "nodeName": "idx", "type": "Any"}, {"lineNumber": 50, "col_offset": 41, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 54, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 56, "col_offset": 23, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 57, "col_offset": 16, "nodeName": "data", "type": "Any"}, {"lineNumber": 57, "col_offset": 26, "nodeName": "patch", "type": "Any"}, {"lineNumber": 58, "col_offset": 15, "nodeName": "ndim", "type": "Any"}, {"lineNumber": 59, "col_offset": 22, "nodeName": "NotImplementedError", "type": "Type[NotImplementedError]"}, {"lineNumber": 61, "col_offset": 15, "nodeName": "cond", "type": "Any"}, {"lineNumber": 62, "col_offset": 16, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 62, "col_offset": 36, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 72, "col_offset": 20, "nodeName": "randn", "type": "Any"}, {"lineNumber": 72, "col_offset": 36, "nodeName": "noise_size", "type": "Any"}, {"lineNumber": 73, "col_offset": 15, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 74, "col_offset": 16, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 75, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 26, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 26, "col_offset": 14, "nodeName": "GANSampler", "type": "Type[GANSampler]"}, {"lineNumber": 26, "col_offset": 26, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 32, "col_offset": 12, "nodeName": "warn", "type": "Callable"}, {"lineNumber": 47, "col_offset": 45, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 50, "col_offset": 41, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 56, "col_offset": 23, "nodeName": "io", "type": "module"}, {"lineNumber": 57, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 58, "col_offset": 15, "nodeName": "data", "type": "Any"}, {"lineNumber": 62, "col_offset": 16, "nodeName": "cond", "type": "Any"}, {"lineNumber": 63, "col_offset": 28, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 64, "col_offset": 20, "nodeName": "data", "type": "Any"}, {"lineNumber": 64, "col_offset": 31, "nodeName": "patch", "type": "Any"}, {"lineNumber": 68, "col_offset": 16, "nodeName": "randomise", "type": "Any"}, {"lineNumber": 69, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 69, "col_offset": 21, "nodeName": "seg", "type": "Any"}, {"lineNumber": 69, "col_offset": 26, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 72, "col_offset": 20, "nodeName": "random", "type": "Any"}, {"lineNumber": 72, "col_offset": 36, "nodeName": "patch", "type": "Any"}, {"lineNumber": 75, "col_offset": 22, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 75, "col_offset": 55, "nodeName": "data", "type": "Any"}, {"lineNumber": 75, "col_offset": 65, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 76, "col_offset": 16, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 76, "col_offset": 31, "nodeName": "idx", "type": "Any"}, {"lineNumber": 76, "col_offset": 36, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 76, "col_offset": 41, "nodeName": "img", "type": "Any"}, {"lineNumber": 76, "col_offset": 46, "nodeName": "cond", "type": "Any"}, {"lineNumber": 76, "col_offset": 52, "nodeName": "noise", "type": "Any"}, {"lineNumber": 77, "col_offset": 22, "nodeName": "patch", "type": "Any"}, {"lineNumber": 78, "col_offset": 17, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 79, "col_offset": 16, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 80, "col_offset": 20, "nodeName": "it", "type": "int"}, {"lineNumber": 32, "col_offset": 12, "nodeName": "warnings", "type": "module"}, {"lineNumber": 32, "col_offset": 26, "nodeName": "format", "type": "Callable[..., str]"}, {"lineNumber": 32, "col_offset": 100, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 58, "col_offset": 15, "nodeName": "img", "type": "Any"}, {"lineNumber": 63, "col_offset": 28, "nodeName": "io", "type": "module"}, {"lineNumber": 64, "col_offset": 20, "nodeName": "cond", "type": "Any"}, {"lineNumber": 68, "col_offset": 16, "nodeName": "aug", "type": "Any"}, {"lineNumber": 68, "col_offset": 43, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 69, "col_offset": 39, "nodeName": "aug", "type": "Any"}, {"lineNumber": 69, "col_offset": 43, "nodeName": "img", "type": "Any"}, {"lineNumber": 69, "col_offset": 49, "nodeName": "aug", "type": "Any"}, {"lineNumber": 69, "col_offset": 53, "nodeName": "seg", "type": "Any"}, {"lineNumber": 69, "col_offset": 59, "nodeName": "aug", "type": "Any"}, {"lineNumber": 69, "col_offset": 63, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 70, "col_offset": 20, "nodeName": "p", "type": "Any"}, {"lineNumber": 70, "col_offset": 22, "nodeName": "d", "type": "Any"}, {"lineNumber": 72, "col_offset": 20, "nodeName": "np", "type": "module"}, {"lineNumber": 74, "col_offset": 24, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 74, "col_offset": 56, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 75, "col_offset": 22, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 75, "col_offset": 55, "nodeName": "img", "type": "Any"}, {"lineNumber": 76, "col_offset": 16, "nodeName": "patch", "type": "Any"}, {"lineNumber": 80, "col_offset": 26, "nodeName": "range", "type": "Type[range]"}, {"lineNumber": 80, "col_offset": 32, "nodeName": "patch_per_volume", "type": "Union[Any, int]"}, {"lineNumber": 81, "col_offset": 20, "nodeName": "slice", "type": "Any"}, {"lineNumber": 82, "col_offset": 20, "nodeName": "img", "type": "Any"}, {"lineNumber": 85, "col_offset": 20, "nodeName": "noise", "type": "Any"}, {"lineNumber": 86, "col_offset": 17, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 87, "col_offset": 16, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 88, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 32, "col_offset": 100, "nodeName": "patch", "type": "Any"}, {"lineNumber": 70, "col_offset": 28, "nodeName": "p", "type": "Any"}, {"lineNumber": 70, "col_offset": 30, "nodeName": "d", "type": "Any"}, {"lineNumber": 70, "col_offset": 35, "nodeName": "zip", "type": "Callable"}, {"lineNumber": 74, "col_offset": 38, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 75, "col_offset": 22, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 80, "col_offset": 32, "nodeName": "self", "type": "GANSampler"}, {"lineNumber": 81, "col_offset": 28, "nodeName": "randint", "type": "Any"}, {"lineNumber": 82, "col_offset": 26, "nodeName": "expand_dims", "type": "Any"}, {"lineNumber": 83, "col_offset": 20, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 83, "col_offset": 35, "nodeName": "idx", "type": "Any"}, {"lineNumber": 83, "col_offset": 40, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 83, "col_offset": 45, "nodeName": "img", "type": "Any"}, {"lineNumber": 83, "col_offset": 50, "nodeName": "cond", "type": "Any"}, {"lineNumber": 83, "col_offset": 56, "nodeName": "noise", "type": "Any"}, {"lineNumber": 84, "col_offset": 26, "nodeName": "patch", "type": "Any"}, {"lineNumber": 85, "col_offset": 28, "nodeName": "randn", "type": "Any"}, {"lineNumber": 85, "col_offset": 44, "nodeName": "noise_size", "type": "Any"}, {"lineNumber": 88, "col_offset": 22, "nodeName": "expand_dims", "type": "Any"}, {"lineNumber": 89, "col_offset": 16, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 89, "col_offset": 31, "nodeName": "idx", "type": "Any"}, {"lineNumber": 89, "col_offset": 36, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 89, "col_offset": 41, "nodeName": "img", "type": "Any"}, {"lineNumber": 89, "col_offset": 46, "nodeName": "cond", "type": "Any"}, {"lineNumber": 89, "col_offset": 52, "nodeName": "noise", "type": "Any"}, {"lineNumber": 90, "col_offset": 22, "nodeName": "patch", "type": "Any"}, {"lineNumber": 70, "col_offset": 60, "nodeName": "shape", "type": "Any"}, {"lineNumber": 74, "col_offset": 38, "nodeName": "patch", "type": "Any"}, {"lineNumber": 75, "col_offset": 22, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 79, "col_offset": 29, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 81, "col_offset": 28, "nodeName": "random", "type": "Any"}, {"lineNumber": 81, "col_offset": 49, "nodeName": "shape", "type": "Any"}, {"lineNumber": 82, "col_offset": 26, "nodeName": "np", "type": "module"}, {"lineNumber": 82, "col_offset": 41, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 83, "col_offset": 20, "nodeName": "patch", "type": "Any"}, {"lineNumber": 85, "col_offset": 28, "nodeName": "random", "type": "Any"}, {"lineNumber": 85, "col_offset": 44, "nodeName": "patch", "type": "Any"}, {"lineNumber": 88, "col_offset": 22, "nodeName": "np", "type": "module"}, {"lineNumber": 88, "col_offset": 37, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 89, "col_offset": 16, "nodeName": "patch", "type": "Any"}, {"lineNumber": 70, "col_offset": 40, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 70, "col_offset": 60, "nodeName": "data", "type": "Any"}, {"lineNumber": 79, "col_offset": 29, "nodeName": "patch", "type": "Any"}, {"lineNumber": 81, "col_offset": 28, "nodeName": "np", "type": "module"}, {"lineNumber": 81, "col_offset": 49, "nodeName": "data", "type": "Any"}, {"lineNumber": 82, "col_offset": 41, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 82, "col_offset": 74, "nodeName": "data", "type": "Any"}, {"lineNumber": 85, "col_offset": 28, "nodeName": "np", "type": "module"}, {"lineNumber": 87, "col_offset": 27, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 88, "col_offset": 37, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 88, "col_offset": 70, "nodeName": "data", "type": "Any"}, {"lineNumber": 70, "col_offset": 40, "nodeName": "patch", "type": "Any"}, {"lineNumber": 70, "col_offset": 60, "nodeName": "img", "type": "Any"}, {"lineNumber": 81, "col_offset": 49, "nodeName": "img", "type": "Any"}, {"lineNumber": 82, "col_offset": 41, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 82, "col_offset": 74, "nodeName": "img", "type": "Any"}, {"lineNumber": 82, "col_offset": 100, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 82, "col_offset": 109, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 87, "col_offset": 27, "nodeName": "patch", "type": "Any"}, {"lineNumber": 88, "col_offset": 37, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 88, "col_offset": 70, "nodeName": "img", "type": "Any"}, {"lineNumber": 88, "col_offset": 89, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 88, "col_offset": 98, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 82, "col_offset": 41, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 88, "col_offset": 37, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 82, "col_offset": 87, "nodeName": "slice", "type": "Any"}]