[{"lineNumber": 13, "col_offset": 20, "nodeName": "BaseSampler", "type": "Any"}, {"lineNumber": 26, "col_offset": 8, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 26, "col_offset": 29, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 39, "col_offset": 8, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 39, "col_offset": 23, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 40, "col_offset": 8, "nodeName": "local_layers", "type": "List[Any]"}, {"lineNumber": 41, "col_offset": 8, "nodeName": "patch", "type": "Any"}, {"lineNumber": 42, "col_offset": 14, "nodeName": "has_next", "type": "Any"}, {"lineNumber": 25, "col_offset": 8, "nodeName": "__init__", "type": "Any"}, {"lineNumber": 26, "col_offset": 8, "nodeName": "self", "type": "ResizeSampler"}, {"lineNumber": 27, "col_offset": 11, "nodeName": "data_augmentation_methods", "type": "Any"}, {"lineNumber": 28, "col_offset": 12, "nodeName": "data_augmentation_layers", "type": "List[nothing]"}, {"lineNumber": 30, "col_offset": 12, "nodeName": "data_augmentation_layers", "type": "Any"}, {"lineNumber": 30, "col_offset": 44, "nodeName": "data_augmentation_methods", "type": "Any"}, {"lineNumber": 39, "col_offset": 23, "nodeName": "patch", "type": "Any"}, {"lineNumber": 41, "col_offset": 16, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 41, "col_offset": 25, "nodeName": "patch", "type": "Any"}, {"lineNumber": 42, "col_offset": 14, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 47, "col_offset": 12, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 47, "col_offset": 31, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 64, "col_offset": 16, "nodeName": "aug", "type": "Any"}, {"lineNumber": 64, "col_offset": 23, "nodeName": "local_layers", "type": "List[Any]"}, {"lineNumber": 68, "col_offset": 12, "nodeName": "i_spatial_rank", "type": "int"}, {"lineNumber": 69, "col_offset": 12, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 71, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 76, "col_offset": 12, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 25, "col_offset": 50, "nodeName": "patch", "type": "Any"}, {"lineNumber": 25, "col_offset": 62, "nodeName": "name", "type": "Any"}, {"lineNumber": 28, "col_offset": 12, "nodeName": "self", "type": "ResizeSampler"}, {"lineNumber": 30, "col_offset": 12, "nodeName": "self", "type": "ResizeSampler"}, {"lineNumber": 39, "col_offset": 23, "nodeName": "self", "type": "ResizeSampler"}, {"lineNumber": 40, "col_offset": 24, "nodeName": "deepcopy", "type": "Callable"}, {"lineNumber": 40, "col_offset": 33, "nodeName": "x", "type": "Any"}, {"lineNumber": 40, "col_offset": 40, "nodeName": "x", "type": "Any"}, {"lineNumber": 40, "col_offset": 45, "nodeName": "data_augmentation_layers", "type": "Union[List[nothing], Any]"}, {"lineNumber": 41, "col_offset": 25, "nodeName": "self", "type": "ResizeSampler"}, {"lineNumber": 42, "col_offset": 14, "nodeName": "self", "type": "ResizeSampler"}, {"lineNumber": 43, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 43, "col_offset": 17, "nodeName": "seg", "type": "Any"}, {"lineNumber": 43, "col_offset": 22, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 43, "col_offset": 34, "nodeName": "idx", "type": "Any"}, {"lineNumber": 43, "col_offset": 40, "nodeName": "volume_loader", "type": "Any"}, {"lineNumber": 47, "col_offset": 12, "nodeName": "img", "type": "Any"}, {"lineNumber": 49, "col_offset": 23, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 50, "col_offset": 16, "nodeName": "data", "type": "Any"}, {"lineNumber": 50, "col_offset": 26, "nodeName": "patch", "type": "Any"}, {"lineNumber": 51, "col_offset": 15, "nodeName": "ndim", "type": "Any"}, {"lineNumber": 52, "col_offset": 22, "nodeName": "NotImplementedError", "type": "Type[NotImplementedError]"}, {"lineNumber": 54, "col_offset": 15, "nodeName": "seg", "type": "Any"}, {"lineNumber": 55, "col_offset": 16, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 55, "col_offset": 35, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 58, "col_offset": 15, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 59, "col_offset": 16, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 59, "col_offset": 42, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 68, "col_offset": 27, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 71, "col_offset": 18, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 71, "col_offset": 51, "nodeName": "data", "type": "Any"}, {"lineNumber": 71, "col_offset": 61, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 72, "col_offset": 15, "nodeName": "seg", "type": "Any"}, {"lineNumber": 73, "col_offset": 14, "nodeName": "seg", "type": "Any"}, {"lineNumber": 74, "col_offset": 15, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 75, "col_offset": 14, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 77, "col_offset": 12, "nodeName": "set_data", "type": "Any"}, {"lineNumber": 77, "col_offset": 27, "nodeName": "idx", "type": "Any"}, {"lineNumber": 77, "col_offset": 32, "nodeName": "loc", "type": "List[Any]"}, {"lineNumber": 77, "col_offset": 37, "nodeName": "img", "type": "Any"}, {"lineNumber": 77, "col_offset": 42, "nodeName": "seg", "type": "Any"}, {"lineNumber": 77, "col_offset": 47, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 78, "col_offset": 18, "nodeName": "patch", "type": "Any"}, {"lineNumber": 25, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 25, "col_offset": 14, "nodeName": "ResizeSampler", "type": "Type[ResizeSampler]"}, {"lineNumber": 25, "col_offset": 29, "nodeName": "self", "type": "ResizeSampler"}, {"lineNumber": 40, "col_offset": 45, "nodeName": "self", "type": "ResizeSampler"}, {"lineNumber": 43, "col_offset": 40, "nodeName": "self", "type": "ResizeSampler"}, {"lineNumber": 49, "col_offset": 23, "nodeName": "io", "type": "module"}, {"lineNumber": 50, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 51, "col_offset": 15, "nodeName": "data", "type": "Any"}, {"lineNumber": 55, "col_offset": 16, "nodeName": "seg", "type": "Any"}, {"lineNumber": 56, "col_offset": 27, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 57, "col_offset": 20, "nodeName": "data", "type": "Any"}, {"lineNumber": 57, "col_offset": 30, "nodeName": "patch", "type": "Any"}, {"lineNumber": 59, "col_offset": 16, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 60, "col_offset": 34, "nodeName": "match_volume_shape_to_patch_definition", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 61, "col_offset": 20, "nodeName": "data", "type": "Any"}, {"lineNumber": 61, "col_offset": 37, "nodeName": "patch", "type": "Any"}, {"lineNumber": 65, "col_offset": 16, "nodeName": "randomise", "type": "Any"}, {"lineNumber": 66, "col_offset": 16, "nodeName": "img", "type": "Any"}, {"lineNumber": 66, "col_offset": 21, "nodeName": "seg", "type": "Any"}, {"lineNumber": 66, "col_offset": 26, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 68, "col_offset": 31, "nodeName": "ceil", "type": "Callable[[SupportsFloat], int]"}, {"lineNumber": 68, "col_offset": 41, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 71, "col_offset": 18, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 71, "col_offset": 51, "nodeName": "img", "type": "Any"}, {"lineNumber": 71, "col_offset": 73, "nodeName": "interp_order", "type": "Any"}, {"lineNumber": 73, "col_offset": 20, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 73, "col_offset": 53, "nodeName": "data", "type": "Any"}, {"lineNumber": 73, "col_offset": 63, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 75, "col_offset": 27, "nodeName": "zoom", "type": "Any"}, {"lineNumber": 75, "col_offset": 60, "nodeName": "data", "type": "Any"}, {"lineNumber": 75, "col_offset": 77, "nodeName": "zoom", "type": "List[Any]"}, {"lineNumber": 76, "col_offset": 20, "nodeName": "i_spatial_rank", "type": "int"}, {"lineNumber": 76, "col_offset": 54, "nodeName": "i_spatial_rank", "type": "int"}, {"lineNumber": 77, "col_offset": 12, "nodeName": "patch", "type": "Any"}, {"lineNumber": 51, "col_offset": 15, "nodeName": "img", "type": "Any"}, {"lineNumber": 56, "col_offset": 27, "nodeName": "io", "type": "module"}, {"lineNumber": 57, "col_offset": 20, "nodeName": "seg", "type": "Any"}, {"lineNumber": 60, "col_offset": 34, "nodeName": "io", "type": "module"}, {"lineNumber": 61, "col_offset": 20, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 65, "col_offset": 16, "nodeName": "aug", "type": "Any"}, {"lineNumber": 65, "col_offset": 43, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 66, "col_offset": 39, "nodeName": "aug", "type": "Any"}, {"lineNumber": 66, "col_offset": 43, "nodeName": "img", "type": "Any"}, {"lineNumber": 66, "col_offset": 49, "nodeName": "aug", "type": "Any"}, {"lineNumber": 66, "col_offset": 53, "nodeName": "seg", "type": "Any"}, {"lineNumber": 66, "col_offset": 59, "nodeName": "aug", "type": "Any"}, {"lineNumber": 66, "col_offset": 63, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 68, "col_offset": 31, "nodeName": "math", "type": "module"}, {"lineNumber": 69, "col_offset": 18, "nodeName": "p", "type": "Any"}, {"lineNumber": 69, "col_offset": 20, "nodeName": "d", "type": "Any"}, {"lineNumber": 71, "col_offset": 18, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 71, "col_offset": 73, "nodeName": "img", "type": "Any"}, {"lineNumber": 73, "col_offset": 20, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 73, "col_offset": 53, "nodeName": "seg", "type": "Any"}, {"lineNumber": 73, "col_offset": 75, "nodeName": "interp_order", "type": "Any"}, {"lineNumber": 75, "col_offset": 27, "nodeName": "interpolation", "type": "Any"}, {"lineNumber": 75, "col_offset": 60, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 75, "col_offset": 89, "nodeName": "interp_order", "type": "Any"}, {"lineNumber": 76, "col_offset": 36, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 69, "col_offset": 26, "nodeName": "p", "type": "Any"}, {"lineNumber": 69, "col_offset": 28, "nodeName": "d", "type": "Any"}, {"lineNumber": 69, "col_offset": 33, "nodeName": "zip", "type": "Callable"}, {"lineNumber": 69, "col_offset": 71, "nodeName": "shape", "type": "Any"}, {"lineNumber": 71, "col_offset": 18, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 73, "col_offset": 20, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 73, "col_offset": 75, "nodeName": "seg", "type": "Any"}, {"lineNumber": 75, "col_offset": 27, "nodeName": "ndimage", "type": "Any"}, {"lineNumber": 75, "col_offset": 89, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 76, "col_offset": 36, "nodeName": "patch", "type": "Any"}, {"lineNumber": 69, "col_offset": 56, "nodeName": "i_spatial_rank", "type": "int"}, {"lineNumber": 69, "col_offset": 71, "nodeName": "data", "type": "Any"}, {"lineNumber": 73, "col_offset": 20, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 75, "col_offset": 27, "nodeName": "scipy", "type": "Any"}, {"lineNumber": 69, "col_offset": 38, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 69, "col_offset": 71, "nodeName": "img", "type": "Any"}, {"lineNumber": 69, "col_offset": 38, "nodeName": "patch", "type": "Any"}]