[{"lineNumber": 17, "col_offset": 18, "nodeName": "TestCase", "type": "Any"}, {"lineNumber": 17, "col_offset": 18, "nodeName": "test", "type": "Any"}, {"lineNumber": 63, "col_offset": 3, "nodeName": "__name__", "type": "str"}, {"lineNumber": 17, "col_offset": 18, "nodeName": "tf", "type": "Any"}, {"lineNumber": 23, "col_offset": 8, "nodeName": "constraint_array", "type": "List[niftynet.utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 51, "col_offset": 8, "nodeName": "volume_loader", "type": "niftynet.engine.volume_loader.VolumeLoaderLayer"}, {"lineNumber": 64, "col_offset": 4, "nodeName": "main", "type": "Any"}, {"lineNumber": 19, "col_offset": 24, "nodeName": "KeywordsMatching", "type": "Type[niftynet.utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 21, "col_offset": 27, "nodeName": "KeywordsMatching", "type": "Type[niftynet.utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 23, "col_offset": 28, "nodeName": "constraint_FLAIR", "type": "niftynet.utilities.filename_matching.KeywordsMatching"}, {"lineNumber": 23, "col_offset": 46, "nodeName": "constraint_T1", "type": "niftynet.utilities.filename_matching.KeywordsMatching"}, {"lineNumber": 24, "col_offset": 8, "nodeName": "write_matched_filenames_to_csv", "type": "Callable[[Any, Any], None]"}, {"lineNumber": 25, "col_offset": 12, "nodeName": "constraint_array", "type": "List[niftynet.utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 27, "col_offset": 27, "nodeName": "KeywordsMatching", "type": "Type[niftynet.utilities.filename_matching.KeywordsMatching]"}, {"lineNumber": 29, "col_offset": 8, "nodeName": "write_matched_filenames_to_csv", "type": "Callable[[Any, Any], None]"}, {"lineNumber": 39, "col_offset": 21, "nodeName": "CSVTable", "type": "Type[niftynet.utilities.csv_table.CSVTable]"}, {"lineNumber": 43, "col_offset": 20, "nodeName": "HistNorm", "type": "Type[niftynet.layer.histogram_normalisation.HistogramNormalisationLayer]"}, {"lineNumber": 51, "col_offset": 24, "nodeName": "VolumeLoaderLayer", "type": "Type[niftynet.engine.volume_loader.VolumeLoaderLayer]"}, {"lineNumber": 51, "col_offset": 42, "nodeName": "csv_loader", "type": "niftynet.utilities.csv_table.CSVTable"}, {"lineNumber": 51, "col_offset": 54, "nodeName": "hist_norm", "type": "niftynet.layer.histogram_normalisation.HistogramNormalisationLayer"}, {"lineNumber": 53, "col_offset": 8, "nodeName": "img", "type": "Any"}, {"lineNumber": 53, "col_offset": 13, "nodeName": "seg", "type": "Any"}, {"lineNumber": 53, "col_offset": 18, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 53, "col_offset": 30, "nodeName": "subject", "type": "Any"}, {"lineNumber": 53, "col_offset": 40, "nodeName": "volume_loader", "type": "niftynet.engine.volume_loader.VolumeLoaderLayer"}, {"lineNumber": 54, "col_offset": 8, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 54, "col_offset": 14, "nodeName": "shape", "type": "Any"}, {"lineNumber": 55, "col_offset": 11, "nodeName": "seg", "type": "Any"}, {"lineNumber": 57, "col_offset": 8, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 57, "col_offset": 14, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 58, "col_offset": 8, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 59, "col_offset": 8, "nodeName": "img", "type": "Any"}, {"lineNumber": 59, "col_offset": 13, "nodeName": "seg", "type": "Any"}, {"lineNumber": 59, "col_offset": 18, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 59, "col_offset": 30, "nodeName": "subject", "type": "Any"}, {"lineNumber": 59, "col_offset": 40, "nodeName": "volume_loader", "type": "niftynet.engine.volume_loader.VolumeLoaderLayer"}, {"lineNumber": 60, "col_offset": 8, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 60, "col_offset": 14, "nodeName": "subject", "type": "Any"}, {"lineNumber": 64, "col_offset": 4, "nodeName": "test", "type": "Any"}, {"lineNumber": 24, "col_offset": 8, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 25, "col_offset": 30, "nodeName": "join", "type": "Callable"}, {"lineNumber": 29, "col_offset": 8, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 30, "col_offset": 13, "nodeName": "constraint_Label", "type": "niftynet.utilities.filename_matching.KeywordsMatching"}, {"lineNumber": 30, "col_offset": 32, "nodeName": "join", "type": "Callable"}, {"lineNumber": 33, "col_offset": 32, "nodeName": "join", "type": "Callable"}, {"lineNumber": 34, "col_offset": 33, "nodeName": "join", "type": "Callable"}, {"lineNumber": 39, "col_offset": 39, "nodeName": "csv_dict", "type": "Dict[str, Optional[str]]"}, {"lineNumber": 54, "col_offset": 14, "nodeName": "data", "type": "Any"}, {"lineNumber": 56, "col_offset": 12, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 56, "col_offset": 18, "nodeName": "shape", "type": "Any"}, {"lineNumber": 58, "col_offset": 14, "nodeName": "subject_list", "type": "Any"}, {"lineNumber": 64, "col_offset": 4, "nodeName": "tf", "type": "Any"}, {"lineNumber": 25, "col_offset": 30, "nodeName": "path", "type": "module"}, {"lineNumber": 30, "col_offset": 32, "nodeName": "path", "type": "module"}, {"lineNumber": 33, "col_offset": 32, "nodeName": "path", "type": "module"}, {"lineNumber": 34, "col_offset": 33, "nodeName": "path", "type": "module"}, {"lineNumber": 44, "col_offset": 28, "nodeName": "join", "type": "Callable"}, {"lineNumber": 45, "col_offset": 32, "nodeName": "BinaryMaskingLayer", "type": "Type[niftynet.layer.binary_masking.BinaryMaskingLayer]"}, {"lineNumber": 54, "col_offset": 14, "nodeName": "img", "type": "Any"}, {"lineNumber": 56, "col_offset": 18, "nodeName": "data", "type": "Any"}, {"lineNumber": 58, "col_offset": 14, "nodeName": "volume_loader", "type": "niftynet.engine.volume_loader.VolumeLoaderLayer"}, {"lineNumber": 58, "col_offset": 41, "nodeName": "subject", "type": "Any"}, {"lineNumber": 25, "col_offset": 30, "nodeName": "os", "type": "module"}, {"lineNumber": 30, "col_offset": 32, "nodeName": "os", "type": "module"}, {"lineNumber": 33, "col_offset": 32, "nodeName": "os", "type": "module"}, {"lineNumber": 34, "col_offset": 33, "nodeName": "os", "type": "module"}, {"lineNumber": 44, "col_offset": 28, "nodeName": "path", "type": "module"}, {"lineNumber": 56, "col_offset": 18, "nodeName": "seg", "type": "Any"}, {"lineNumber": 44, "col_offset": 28, "nodeName": "os", "type": "module"}]