[{"lineNumber": 110, "col_offset": 0, "nodeName": "l1_loss", "type": "Callable[..., Any]"}, {"lineNumber": 128, "col_offset": 0, "nodeName": "l2_loss", "type": "Callable[..., Any]"}, {"lineNumber": 142, "col_offset": 0, "nodeName": "rmse_loss", "type": "Callable[..., Any]"}, {"lineNumber": 158, "col_offset": 0, "nodeName": "mae_loss", "type": "Callable[..., Any]"}, {"lineNumber": 174, "col_offset": 0, "nodeName": "huber_loss", "type": "Callable[..., Any]"}, {"lineNumber": 202, "col_offset": 0, "nodeName": "smooth_l1_loss", "type": "Callable[..., Any]"}, {"lineNumber": 252, "col_offset": 0, "nodeName": "cosine_loss", "type": "Callable[..., Any]"}, {"lineNumber": 13, "col_offset": 19, "nodeName": "Layer", "type": "Type[niftynet.layer.base_layer.Layer]"}, {"lineNumber": 116, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 135, "col_offset": 4, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 185, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 186, "col_offset": 4, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 187, "col_offset": 4, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 188, "col_offset": 4, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 190, "col_offset": 4, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 198, "col_offset": 4, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 218, "col_offset": 4, "nodeName": "value_correction", "type": "Any"}, {"lineNumber": 220, "col_offset": 4, "nodeName": "value_correction_max", "type": "Any"}, {"lineNumber": 222, "col_offset": 4, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 224, "col_offset": 4, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 226, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 230, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 235, "col_offset": 4, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 262, "col_offset": 7, "nodeName": "to_complete", "type": "Any"}, {"lineNumber": 282, "col_offset": 4, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 284, "col_offset": 4, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 286, "col_offset": 4, "nodeName": "loss_init", "type": "Any"}, {"lineNumber": 287, "col_offset": 4, "nodeName": "weighted_loss", "type": "Any"}, {"lineNumber": 288, "col_offset": 4, "nodeName": "loss", "type": "Any"}, {"lineNumber": 290, "col_offset": 11, "nodeName": "loss", "type": "Any"}, {"lineNumber": 22, "col_offset": 8, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 25, "col_offset": 8, "nodeName": "_reshape", "type": "bool"}, {"lineNumber": 116, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 117, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 118, "col_offset": 8, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 119, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 120, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 122, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 123, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 124, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 135, "col_offset": 16, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 135, "col_offset": 28, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 135, "col_offset": 40, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 136, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 137, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 139, "col_offset": 11, "nodeName": "l2_loss", "type": "Any"}, {"lineNumber": 139, "col_offset": 25, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 149, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 150, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 151, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 152, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 165, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 166, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 167, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 168, "col_offset": 8, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 185, "col_offset": 25, "nodeName": "abs", "type": "Any"}, {"lineNumber": 186, "col_offset": 32, "nodeName": "less", "type": "Any"}, {"lineNumber": 186, "col_offset": 40, "nodeName": "delta", "type": "Any"}, {"lineNumber": 186, "col_offset": 47, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 188, "col_offset": 22, "nodeName": "delta", "type": "Any"}, {"lineNumber": 190, "col_offset": 21, "nodeName": "where", "type": "Any"}, {"lineNumber": 190, "col_offset": 30, "nodeName": "residual_is_outside_delta", "type": "Any"}, {"lineNumber": 191, "col_offset": 30, "nodeName": "linear_residual", "type": "Any"}, {"lineNumber": 192, "col_offset": 30, "nodeName": "quadratic_residual", "type": "Any"}, {"lineNumber": 193, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 194, "col_offset": 8, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 195, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 197, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 198, "col_offset": 15, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 198, "col_offset": 29, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 199, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 199, "col_offset": 22, "nodeName": "sum_loss", "type": "Any"}, {"lineNumber": 199, "col_offset": 32, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 212, "col_offset": 7, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 213, "col_offset": 8, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 213, "col_offset": 27, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 214, "col_offset": 8, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 216, "col_offset": 8, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 218, "col_offset": 43, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 220, "col_offset": 27, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 222, "col_offset": 17, "nodeName": "cast", "type": "Any"}, {"lineNumber": 222, "col_offset": 25, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 224, "col_offset": 19, "nodeName": "cast", "type": "Any"}, {"lineNumber": 224, "col_offset": 27, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 226, "col_offset": 25, "nodeName": "cast", "type": "Any"}, {"lineNumber": 230, "col_offset": 25, "nodeName": "where", "type": "Any"}, {"lineNumber": 235, "col_offset": 25, "nodeName": "where", "type": "Any"}, {"lineNumber": 237, "col_offset": 52, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 238, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 240, "col_offset": 8, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 241, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 243, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 246, "col_offset": 8, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 247, "col_offset": 8, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 248, "col_offset": 11, "nodeName": "truediv", "type": "Any"}, {"lineNumber": 263, "col_offset": 8, "nodeName": "prediction_complete", "type": "Any"}, {"lineNumber": 266, "col_offset": 8, "nodeName": "ground_truth_complete", "type": "Any"}, {"lineNumber": 270, "col_offset": 8, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 272, "col_offset": 8, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 274, "col_offset": 8, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 274, "col_offset": 20, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 275, "col_offset": 8, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 275, "col_offset": 18, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 277, "col_offset": 7, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 278, "col_offset": 8, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 280, "col_offset": 8, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 282, "col_offset": 16, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 284, "col_offset": 14, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 287, "col_offset": 20, "nodeName": "loss_init", "type": "Any"}, {"lineNumber": 287, "col_offset": 32, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "__init__", "type": "Callable[..., None]"}, {"lineNumber": 22, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 22, "col_offset": 31, "nodeName": "create", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 22, "col_offset": 60, "nodeName": "loss_type", "type": "Any"}, {"lineNumber": 24, "col_offset": 12, "nodeName": "loss_func_params", "type": "Any"}, {"lineNumber": 25, "col_offset": 8, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 26, "col_offset": 11, "nodeName": "loss_type", "type": "Any"}, {"lineNumber": 28, "col_offset": 12, "nodeName": "_reshape", "type": "bool"}, {"lineNumber": 52, "col_offset": 12, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 52, "col_offset": 25, "nodeName": "value", "type": "Any"}, {"lineNumber": 53, "col_offset": 12, "nodeName": "dir_size", "type": "int"}, {"lineNumber": 54, "col_offset": 15, "nodeName": "_reshape", "type": "bool"}, {"lineNumber": 67, "col_offset": 12, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 116, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 116, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 116, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 116, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 118, "col_offset": 29, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 118, "col_offset": 41, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 118, "col_offset": 61, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 119, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 119, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 120, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 120, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 122, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 122, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 123, "col_offset": 22, "nodeName": "size", "type": "Any"}, {"lineNumber": 123, "col_offset": 30, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 124, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 124, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 124, "col_offset": 30, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 125, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 125, "col_offset": 30, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 135, "col_offset": 16, "nodeName": "tf", "type": "Any"}, {"lineNumber": 139, "col_offset": 11, "nodeName": "nn", "type": "Any"}, {"lineNumber": 150, "col_offset": 20, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 150, "col_offset": 32, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 150, "col_offset": 44, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 151, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 151, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 151, "col_offset": 43, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 152, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 152, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 152, "col_offset": 43, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 153, "col_offset": 15, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 155, "col_offset": 15, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 166, "col_offset": 20, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 166, "col_offset": 32, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 166, "col_offset": 44, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 167, "col_offset": 20, "nodeName": "abs", "type": "Any"}, {"lineNumber": 167, "col_offset": 27, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 168, "col_offset": 20, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 168, "col_offset": 32, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 168, "col_offset": 43, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 171, "col_offset": 15, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 185, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 185, "col_offset": 32, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 185, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 185, "col_offset": 56, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 186, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 187, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 188, "col_offset": 31, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 190, "col_offset": 21, "nodeName": "tf", "type": "Any"}, {"lineNumber": 194, "col_offset": 25, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 194, "col_offset": 37, "nodeName": "voxelwise_loss", "type": "Any"}, {"lineNumber": 194, "col_offset": 53, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 195, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 195, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 197, "col_offset": 22, "nodeName": "to_float", "type": "Any"}, {"lineNumber": 198, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 199, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 214, "col_offset": 27, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 216, "col_offset": 33, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 218, "col_offset": 23, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 220, "col_offset": 46, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 222, "col_offset": 17, "nodeName": "tf", "type": "Any"}, {"lineNumber": 222, "col_offset": 43, "nodeName": "float32", "type": "Any"}, {"lineNumber": 224, "col_offset": 19, "nodeName": "tf", "type": "Any"}, {"lineNumber": 224, "col_offset": 47, "nodeName": "float32", "type": "Any"}, {"lineNumber": 226, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 226, "col_offset": 33, "nodeName": "abs", "type": "Any"}, {"lineNumber": 228, "col_offset": 39, "nodeName": "float32", "type": "Any"}, {"lineNumber": 230, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 230, "col_offset": 34, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 230, "col_offset": 55, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 231, "col_offset": 34, "nodeName": "value_thresh", "type": "Any"}, {"lineNumber": 233, "col_offset": 43, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 233, "col_offset": 64, "nodeName": "value_correction", "type": "Any"}, {"lineNumber": 235, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 235, "col_offset": 34, "nodeName": "greater", "type": "Any"}, {"lineNumber": 235, "col_offset": 45, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 235, "col_offset": 64, "nodeName": "value_thresh_max", "type": "Any"}, {"lineNumber": 237, "col_offset": 30, "nodeName": "value_correction_max", "type": "Any"}, {"lineNumber": 240, "col_offset": 29, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 240, "col_offset": 41, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 240, "col_offset": 61, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 241, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 241, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 243, "col_offset": 22, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 243, "col_offset": 36, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 246, "col_offset": 24, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 246, "col_offset": 38, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 247, "col_offset": 22, "nodeName": "size", "type": "Any"}, {"lineNumber": 247, "col_offset": 30, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 248, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 248, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 248, "col_offset": 30, "nodeName": "sum_residuals", "type": "Any"}, {"lineNumber": 249, "col_offset": 22, "nodeName": "cast", "type": "Any"}, {"lineNumber": 249, "col_offset": 30, "nodeName": "sum_weights", "type": "Any"}, {"lineNumber": 263, "col_offset": 30, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 266, "col_offset": 32, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 270, "col_offset": 20, "nodeName": "concat", "type": "Any"}, {"lineNumber": 272, "col_offset": 18, "nodeName": "concat", "type": "Any"}, {"lineNumber": 278, "col_offset": 21, "nodeName": "ones", "type": "Any"}, {"lineNumber": 280, "col_offset": 21, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 280, "col_offset": 32, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 282, "col_offset": 28, "nodeName": "maximum", "type": "Any"}, {"lineNumber": 284, "col_offset": 23, "nodeName": "maximum", "type": "Any"}, {"lineNumber": 286, "col_offset": 19, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 288, "col_offset": 11, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 288, "col_offset": 25, "nodeName": "weighted_loss", "type": "Any"}, {"lineNumber": 288, "col_offset": 42, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 288, "col_offset": 56, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 19, "col_offset": 48, "nodeName": "name", "type": "Any"}, {"lineNumber": 22, "col_offset": 31, "nodeName": "LossRegressionFactory", "type": "Type[niftynet.engine.application_factory.LossRegressionFactory]"}, {"lineNumber": 24, "col_offset": 32, "nodeName": "loss_func_params", "type": "Any"}, {"lineNumber": 27, "col_offset": 12, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 27, "col_offset": 18, "nodeName": "loss_type", "type": "Any"}, {"lineNumber": 28, "col_offset": 12, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 51, "col_offset": 13, "nodeName": "device", "type": "Any"}, {"lineNumber": 54, "col_offset": 15, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 56, "col_offset": 16, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 61, "col_offset": 16, "nodeName": "dir_size", "type": "Any"}, {"lineNumber": 61, "col_offset": 27, "nodeName": "value", "type": "Any"}, {"lineNumber": 62, "col_offset": 16, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 65, "col_offset": 16, "nodeName": "prediction", "type": "List[Any]"}, {"lineNumber": 68, "col_offset": 16, "nodeName": "ind", "type": "int"}, {"lineNumber": 68, "col_offset": 21, "nodeName": "pred", "type": "Any"}, {"lineNumber": 68, "col_offset": 29, "nodeName": "enumerate", "type": "Type[enumerate[Any]]"}, {"lineNumber": 68, "col_offset": 39, "nodeName": "prediction", "type": "Union[List[Any], Any]"}, {"lineNumber": 101, "col_offset": 16, "nodeName": "loss_batch", "type": "Any"}, {"lineNumber": 107, "col_offset": 19, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 107, "col_offset": 34, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 116, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 118, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 119, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 120, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 122, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 123, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 124, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 124, "col_offset": 51, "nodeName": "float32", "type": "Any"}, {"lineNumber": 125, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 125, "col_offset": 49, "nodeName": "float32", "type": "Any"}, {"lineNumber": 138, "col_offset": 12, "nodeName": "multiply", "type": "Any"}, {"lineNumber": 138, "col_offset": 24, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 138, "col_offset": 35, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 138, "col_offset": 49, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 138, "col_offset": 63, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 139, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 150, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 151, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 152, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 153, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 155, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 155, "col_offset": 23, "nodeName": "mean_squared_error", "type": "Any"}, {"lineNumber": 155, "col_offset": 52, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 155, "col_offset": 64, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 166, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 167, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 168, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 169, "col_offset": 15, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 169, "col_offset": 30, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 169, "col_offset": 43, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 169, "col_offset": 58, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 171, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 171, "col_offset": 30, "nodeName": "abs", "type": "Any"}, {"lineNumber": 185, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 188, "col_offset": 52, "nodeName": "delta", "type": "Any"}, {"lineNumber": 194, "col_offset": 25, "nodeName": "tf", "type": "Any"}, {"lineNumber": 195, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 197, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 197, "col_offset": 34, "nodeName": "size", "type": "Any"}, {"lineNumber": 197, "col_offset": 42, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 222, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 224, "col_offset": 47, "nodeName": "tf", "type": "Any"}, {"lineNumber": 226, "col_offset": 33, "nodeName": "tf", "type": "Any"}, {"lineNumber": 226, "col_offset": 40, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 226, "col_offset": 52, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 227, "col_offset": 61, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 228, "col_offset": 39, "nodeName": "tf", "type": "Any"}, {"lineNumber": 232, "col_offset": 43, "nodeName": "square", "type": "Any"}, {"lineNumber": 232, "col_offset": 53, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 235, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 236, "col_offset": 34, "nodeName": "square", "type": "Any"}, {"lineNumber": 237, "col_offset": 8, "nodeName": "absolute_residuals", "type": "Any"}, {"lineNumber": 240, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 241, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 243, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 246, "col_offset": 24, "nodeName": "tf", "type": "Any"}, {"lineNumber": 247, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 248, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 248, "col_offset": 51, "nodeName": "float32", "type": "Any"}, {"lineNumber": 249, "col_offset": 22, "nodeName": "tf", "type": "Any"}, {"lineNumber": 249, "col_offset": 49, "nodeName": "float32", "type": "Any"}, {"lineNumber": 263, "col_offset": 30, "nodeName": "tf", "type": "Any"}, {"lineNumber": 263, "col_offset": 41, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 266, "col_offset": 32, "nodeName": "tf", "type": "Any"}, {"lineNumber": 266, "col_offset": 43, "nodeName": "sqrt", "type": "Any"}, {"lineNumber": 270, "col_offset": 20, "nodeName": "tf", "type": "Any"}, {"lineNumber": 270, "col_offset": 31, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 270, "col_offset": 43, "nodeName": "prediction_complete", "type": "Any"}, {"lineNumber": 272, "col_offset": 18, "nodeName": "tf", "type": "Any"}, {"lineNumber": 272, "col_offset": 29, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 272, "col_offset": 43, "nodeName": "ground_truth_complete", "type": "Any"}, {"lineNumber": 278, "col_offset": 21, "nodeName": "tf", "type": "Any"}, {"lineNumber": 280, "col_offset": 21, "nodeName": "tf", "type": "Any"}, {"lineNumber": 282, "col_offset": 28, "nodeName": "tf", "type": "Any"}, {"lineNumber": 282, "col_offset": 39, "nodeName": "norm", "type": "Any"}, {"lineNumber": 283, "col_offset": 8, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 284, "col_offset": 23, "nodeName": "tf", "type": "Any"}, {"lineNumber": 284, "col_offset": 34, "nodeName": "norm", "type": "Any"}, {"lineNumber": 285, "col_offset": 8, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 286, "col_offset": 19, "nodeName": "tf", "type": "Any"}, {"lineNumber": 286, "col_offset": 33, "nodeName": "gt_vect", "type": "Any"}, {"lineNumber": 286, "col_offset": 43, "nodeName": "pred_vect", "type": "Any"}, {"lineNumber": 288, "col_offset": 11, "nodeName": "tf", "type": "Any"}, {"lineNumber": 288, "col_offset": 42, "nodeName": "tf", "type": "Any"}, {"lineNumber": 19, "col_offset": 8, "nodeName": "super", "type": "Type[super]"}, {"lineNumber": 19, "col_offset": 14, "nodeName": "LossFunction", "type": "Type[LossFunction]"}, {"lineNumber": 19, "col_offset": 28, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 51, "col_offset": 13, "nodeName": "tf", "type": "Any"}, {"lineNumber": 52, "col_offset": 25, "nodeName": "shape", "type": "Any"}, {"lineNumber": 55, "col_offset": 16, "nodeName": "print", "type": "Callable[..., None]"}, {"lineNumber": 56, "col_offset": 31, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 56, "col_offset": 42, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 57, "col_offset": 19, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 58, "col_offset": 20, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 62, "col_offset": 31, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 62, "col_offset": 42, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 64, "col_offset": 19, "nodeName": "isinstance", "type": "Callable[[Any, Union[Type[Any], Tuple[Union[Type[Any], Tuple[Type[Any], ...]], ...]]], bool]"}, {"lineNumber": 64, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 65, "col_offset": 30, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 78, "col_offset": 20, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 87, "col_offset": 20, "nodeName": "loss_params", "type": "Dict[Union[str, Any], Any]"}, {"lineNumber": 91, "col_offset": 23, "nodeName": "_loss_func_params", "type": "Union[Any, Dict[nothing, nothing]]"}, {"lineNumber": 96, "col_offset": 19, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 97, "col_offset": 20, "nodeName": "elements", "type": "Tuple[Any, Any, Any]"}, {"lineNumber": 99, "col_offset": 20, "nodeName": "elements", "type": "Tuple[Any, Any]"}, {"lineNumber": 101, "col_offset": 29, "nodeName": "map_fn", "type": "Any"}, {"lineNumber": 106, "col_offset": 16, "nodeName": "append", "type": "Callable"}, {"lineNumber": 107, "col_offset": 19, "nodeName": "tf", "type": "Any"}, {"lineNumber": 124, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 125, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 138, "col_offset": 12, "nodeName": "tf", "type": "Any"}, {"lineNumber": 138, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 153, "col_offset": 23, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 153, "col_offset": 38, "nodeName": "residuals", "type": "Any"}, {"lineNumber": 153, "col_offset": 51, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 153, "col_offset": 66, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 155, "col_offset": 23, "nodeName": "losses", "type": "Any"}, {"lineNumber": 169, "col_offset": 15, "nodeName": "tf", "type": "Any"}, {"lineNumber": 169, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 171, "col_offset": 30, "nodeName": "tf", "type": "Any"}, {"lineNumber": 171, "col_offset": 37, "nodeName": "subtract", "type": "Any"}, {"lineNumber": 171, "col_offset": 49, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 171, "col_offset": 61, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 197, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 226, "col_offset": 40, "nodeName": "tf", "type": "Any"}, {"lineNumber": 232, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 236, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 248, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 249, "col_offset": 49, "nodeName": "tf", "type": "Any"}, {"lineNumber": 263, "col_offset": 41, "nodeName": "tf", "type": "Any"}, {"lineNumber": 266, "col_offset": 43, "nodeName": "tf", "type": "Any"}, {"lineNumber": 282, "col_offset": 39, "nodeName": "tf", "type": "Any"}, {"lineNumber": 284, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 52, "col_offset": 25, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 56, "col_offset": 31, "nodeName": "tf", "type": "Any"}, {"lineNumber": 56, "col_offset": 57, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 58, "col_offset": 33, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 58, "col_offset": 44, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 61, "col_offset": 27, "nodeName": "shape", "type": "Any"}, {"lineNumber": 62, "col_offset": 31, "nodeName": "tf", "type": "Any"}, {"lineNumber": 62, "col_offset": 57, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 63, "col_offset": 57, "nodeName": "dir_size", "type": "Any"}, {"lineNumber": 64, "col_offset": 43, "nodeName": "list", "type": "Type[List[Any]]"}, {"lineNumber": 64, "col_offset": 49, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 75, "col_offset": 24, "nodeName": "weight_map_b", "type": "None"}, {"lineNumber": 78, "col_offset": 29, "nodeName": "reshape", "type": "Any"}, {"lineNumber": 78, "col_offset": 40, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 88, "col_offset": 38, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 89, "col_offset": 40, "nodeName": "ground_truth_b", "type": "Any"}, {"lineNumber": 90, "col_offset": 38, "nodeName": "weight_map_b", "type": "Optional[Any]"}, {"lineNumber": 91, "col_offset": 23, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 94, "col_offset": 27, "nodeName": "to_float", "type": "Any"}, {"lineNumber": 97, "col_offset": 32, "nodeName": "pred", "type": "Any"}, {"lineNumber": 97, "col_offset": 38, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 97, "col_offset": 52, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 99, "col_offset": 32, "nodeName": "pred", "type": "Any"}, {"lineNumber": 99, "col_offset": 38, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 101, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 102, "col_offset": 23, "nodeName": "_batch_i_loss", "type": "Callable[..., Any]"}, {"lineNumber": 103, "col_offset": 26, "nodeName": "elements", "type": "Union[Tuple[Any, Any], Tuple[Any, Any, Any]]"}, {"lineNumber": 104, "col_offset": 26, "nodeName": "float32", "type": "Any"}, {"lineNumber": 106, "col_offset": 16, "nodeName": "data_loss", "type": "List[Any]"}, {"lineNumber": 106, "col_offset": 33, "nodeName": "reduce_mean", "type": "Any"}, {"lineNumber": 106, "col_offset": 48, "nodeName": "loss_batch", "type": "Any"}, {"lineNumber": 153, "col_offset": 23, "nodeName": "tf", "type": "Any"}, {"lineNumber": 153, "col_offset": 51, "nodeName": "tf", "type": "Any"}, {"lineNumber": 155, "col_offset": 23, "nodeName": "tf", "type": "Any"}, {"lineNumber": 171, "col_offset": 37, "nodeName": "tf", "type": "Any"}, {"lineNumber": 263, "col_offset": 53, "nodeName": "minimum", "type": "Any"}, {"lineNumber": 265, "col_offset": 34, "nodeName": "shape", "type": "Any"}, {"lineNumber": 265, "col_offset": 43, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 266, "col_offset": 55, "nodeName": "minimum", "type": "Any"}, {"lineNumber": 268, "col_offset": 35, "nodeName": "shape", "type": "Any"}, {"lineNumber": 268, "col_offset": 44, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 278, "col_offset": 30, "nodeName": "shape", "type": "Any"}, {"lineNumber": 278, "col_offset": 39, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 280, "col_offset": 45, "nodeName": "shape", "type": "Any"}, {"lineNumber": 280, "col_offset": 54, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 58, "col_offset": 33, "nodeName": "tf", "type": "Any"}, {"lineNumber": 58, "col_offset": 57, "nodeName": "batch_size", "type": "Any"}, {"lineNumber": 61, "col_offset": 27, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 73, "col_offset": 23, "nodeName": "len", "type": "Callable[[Sized], int]"}, {"lineNumber": 74, "col_offset": 24, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 74, "col_offset": 32, "nodeName": "ground_truth_b", "type": "Any"}, {"lineNumber": 74, "col_offset": 49, "nodeName": "args", "type": "Tuple[Any, ...]"}, {"lineNumber": 77, "col_offset": 24, "nodeName": "pred_b", "type": "Any"}, {"lineNumber": 77, "col_offset": 32, "nodeName": "ground_truth_b", "type": "Any"}, {"lineNumber": 77, "col_offset": 48, "nodeName": "weight_map_b", "type": "Any"}, {"lineNumber": 77, "col_offset": 63, "nodeName": "args", "type": "Tuple[Any, ...]"}, {"lineNumber": 78, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 78, "col_offset": 48, "nodeName": "shape", "type": "Any"}, {"lineNumber": 78, "col_offset": 57, "nodeName": "ground_truth_b", "type": "Any"}, {"lineNumber": 92, "col_offset": 24, "nodeName": "update", "type": "Callable"}, {"lineNumber": 92, "col_offset": 43, "nodeName": "_loss_func_params", "type": "Union[Any, Dict[nothing, nothing]]"}, {"lineNumber": 94, "col_offset": 27, "nodeName": "tf", "type": "Any"}, {"lineNumber": 94, "col_offset": 39, "nodeName": "_data_loss_func", "type": "Any"}, {"lineNumber": 104, "col_offset": 26, "nodeName": "tf", "type": "Any"}, {"lineNumber": 106, "col_offset": 33, "nodeName": "tf", "type": "Any"}, {"lineNumber": 263, "col_offset": 53, "nodeName": "tf", "type": "Any"}, {"lineNumber": 263, "col_offset": 64, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 265, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 266, "col_offset": 55, "nodeName": "tf", "type": "Any"}, {"lineNumber": 266, "col_offset": 66, "nodeName": "reduce_sum", "type": "Any"}, {"lineNumber": 268, "col_offset": 35, "nodeName": "tf", "type": "Any"}, {"lineNumber": 278, "col_offset": 30, "nodeName": "tf", "type": "Any"}, {"lineNumber": 280, "col_offset": 45, "nodeName": "tf", "type": "Any"}, {"lineNumber": 73, "col_offset": 27, "nodeName": "args", "type": "Tuple[Any, ...]"}, {"lineNumber": 78, "col_offset": 48, "nodeName": "tf", "type": "Any"}, {"lineNumber": 92, "col_offset": 24, "nodeName": "loss_params", "type": "Dict[Union[str, Any], Any]"}, {"lineNumber": 92, "col_offset": 43, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 94, "col_offset": 39, "nodeName": "self", "type": "LossFunction"}, {"lineNumber": 94, "col_offset": 62, "nodeName": "loss_params", "type": "Dict[Union[str, Any], Any]"}, {"lineNumber": 263, "col_offset": 64, "nodeName": "tf", "type": "Any"}, {"lineNumber": 264, "col_offset": 12, "nodeName": "square", "type": "Any"}, {"lineNumber": 265, "col_offset": 12, "nodeName": "prediction", "type": "Any"}, {"lineNumber": 266, "col_offset": 66, "nodeName": "tf", "type": "Any"}, {"lineNumber": 267, "col_offset": 12, "nodeName": "square", "type": "Any"}, {"lineNumber": 268, "col_offset": 12, "nodeName": "ground_truth", "type": "Any"}, {"lineNumber": 264, "col_offset": 12, "nodeName": "tf", "type": "Any"}, {"lineNumber": 267, "col_offset": 12, "nodeName": "tf", "type": "Any"}]