[{"lineNumber": 22, "col_offset": 0, "nodeName": "SUPPORTED_SPATIAL_RANKS", "type": "Set[float]"}, {"lineNumber": 25, "col_offset": 17, "nodeName": "object", "type": "Type[object]"}, {"lineNumber": 76, "col_offset": 4, "nodeName": "spatial_rank", "type": "Callable[[Any], Any]"}, {"lineNumber": 83, "col_offset": 4, "nodeName": "has_labels", "type": "Callable[[Any], Any]"}, {"lineNumber": 88, "col_offset": 4, "nodeName": "has_weight_maps", "type": "Callable[[Any], Any]"}, {"lineNumber": 93, "col_offset": 4, "nodeName": "image_size", "type": "Callable[[Any], Any]"}, {"lineNumber": 97, "col_offset": 4, "nodeName": "label_size", "type": "Callable[[Any], Any]"}, {"lineNumber": 103, "col_offset": 4, "nodeName": "weight_map_size", "type": "Callable[[Any], Any]"}, {"lineNumber": 109, "col_offset": 4, "nodeName": "full_image_shape", "type": "Callable[[Any], Any]"}, {"lineNumber": 118, "col_offset": 4, "nodeName": "full_label_shape", "type": "Callable[[Any], Any]"}, {"lineNumber": 127, "col_offset": 4, "nodeName": "full_weight_map_shape", "type": "Callable[[Any], Any]"}, {"lineNumber": 136, "col_offset": 4, "nodeName": "full_info_shape", "type": "Callable[[Any], Any]"}, {"lineNumber": 150, "col_offset": 4, "nodeName": "create_placeholders", "type": "Callable[[Any], Any]"}, {"lineNumber": 189, "col_offset": 4, "nodeName": "image", "type": "Callable[[Any], Any]"}, {"lineNumber": 194, "col_offset": 4, "nodeName": "info", "type": "Callable[[Any], Any]"}, {"lineNumber": 199, "col_offset": 4, "nodeName": "label", "type": "Callable[[Any], Any]"}, {"lineNumber": 205, "col_offset": 4, "nodeName": "weight_map", "type": "Callable[[Any], Any]"}, {"lineNumber": 211, "col_offset": 4, "nodeName": "image", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 216, "col_offset": 4, "nodeName": "info", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 221, "col_offset": 4, "nodeName": "label", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 227, "col_offset": 4, "nodeName": "weight_map", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 235, "col_offset": 4, "nodeName": "set_data", "type": "Callable[[Any, Any, Any, Any, Any, Any], Any]"}, {"lineNumber": 294, "col_offset": 4, "nodeName": "as_dict", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 305, "col_offset": 4, "nodeName": "stopping_signal", "type": "Callable[[Any], Any]"}, {"lineNumber": 309, "col_offset": 4, "nodeName": "fill_with_stopping_info", "type": "Callable[[Any], Any]"}, {"lineNumber": 312, "col_offset": 4, "nodeName": "is_stopping_signal", "type": "Callable[[Any, Any], Any]"}, {"lineNumber": 22, "col_offset": 26, "nodeName": "set", "type": "Type[Set[Any]]"}, {"lineNumber": 46, "col_offset": 29, "nodeName": "float32", "type": "Any"}, {"lineNumber": 47, "col_offset": 29, "nodeName": "int64", "type": "Any"}, {"lineNumber": 48, "col_offset": 34, "nodeName": "float32", "type": "Any"}, {"lineNumber": 53, "col_offset": 8, "nodeName": "_spatial_rank", "type": "float"}, {"lineNumber": 57, "col_offset": 8, "nodeName": "_image_size", "type": "Any"}, {"lineNumber": 57, "col_offset": 27, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 58, "col_offset": 8, "nodeName": "_label_size", "type": "Any"}, {"lineNumber": 58, "col_offset": 27, "nodeName": "label_size", "type": "Any"}, {"lineNumber": 59, "col_offset": 8, "nodeName": "_weight_map_size", "type": "Any"}, {"lineNumber": 59, "col_offset": 32, "nodeName": "weight_map_size", "type": "Any"}, {"lineNumber": 62, "col_offset": 8, "nodeName": "_image_dtype", "type": "Any"}, {"lineNumber": 62, "col_offset": 28, "nodeName": "image_dtype", "type": "Any"}, {"lineNumber": 63, "col_offset": 8, "nodeName": "_label_dtype", "type": "Any"}, {"lineNumber": 63, "col_offset": 28, "nodeName": "label_dtype", "type": "Any"}, {"lineNumber": 64, "col_offset": 8, "nodeName": "_weight_map_dtype", "type": "Any"}, {"lineNumber": 64, "col_offset": 33, "nodeName": "weight_map_dtype", "type": "Any"}, {"lineNumber": 66, "col_offset": 8, "nodeName": "_num_image_modality", "type": "Any"}, {"lineNumber": 66, "col_offset": 35, "nodeName": "num_image_modality", "type": "Any"}, {"lineNumber": 67, "col_offset": 8, "nodeName": "_num_label_modality", "type": "Any"}, {"lineNumber": 67, "col_offset": 35, "nodeName": "num_label_modality", "type": "Any"}, {"lineNumber": 68, "col_offset": 8, "nodeName": "_num_weight_map", "type": "Any"}, {"lineNumber": 68, "col_offset": 31, "nodeName": "num_weight_map", "type": "Any"}, {"lineNumber": 71, "col_offset": 8, "nodeName": "_image", "type": "None"}, {"lineNumber": 72, "col_offset": 8, "nodeName": "_info", "type": "None"}, {"lineNumber": 73, "col_offset": 8, "nodeName": "_label", "type": "None"}, {"lineNumber": 74, "col_offset": 8, "nodeName": "_weight_map", "type": "None"}, {"lineNumber": 81, "col_offset": 15, "nodeName": "_spatial_rank", "type": "Any"}, {"lineNumber": 95, "col_offset": 15, "nodeName": "_image_size", "type": "Any"}, {"lineNumber": 99, "col_offset": 11, "nodeName": "has_labels", "type": "Any"}, {"lineNumber": 105, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Any"}, {"lineNumber": 114, "col_offset": 8, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 115, "col_offset": 8, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 116, "col_offset": 15, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 120, "col_offset": 11, "nodeName": "has_labels", "type": "Any"}, {"lineNumber": 129, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Any"}, {"lineNumber": 156, "col_offset": 8, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 165, "col_offset": 8, "nodeName": "location_info_dtype", "type": "Any"}, {"lineNumber": 165, "col_offset": 30, "nodeName": "int64", "type": "Any"}, {"lineNumber": 172, "col_offset": 11, "nodeName": "has_labels", "type": "Union[bool, Any]"}, {"lineNumber": 180, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Union[bool, Any]"}, {"lineNumber": 192, "col_offset": 15, "nodeName": "_image", "type": "Any"}, {"lineNumber": 197, "col_offset": 15, "nodeName": "_info", "type": "Any"}, {"lineNumber": 201, "col_offset": 11, "nodeName": "has_labels", "type": "Any"}, {"lineNumber": 207, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Any"}, {"lineNumber": 214, "col_offset": 8, "nodeName": "_image", "type": "Any"}, {"lineNumber": 214, "col_offset": 22, "nodeName": "value", "type": "Any"}, {"lineNumber": 219, "col_offset": 8, "nodeName": "_info", "type": "Any"}, {"lineNumber": 219, "col_offset": 21, "nodeName": "value", "type": "Any"}, {"lineNumber": 223, "col_offset": 15, "nodeName": "has_labels", "type": "Any"}, {"lineNumber": 225, "col_offset": 8, "nodeName": "_label", "type": "Any"}, {"lineNumber": 225, "col_offset": 22, "nodeName": "value", "type": "Any"}, {"lineNumber": 229, "col_offset": 15, "nodeName": "has_weight_maps", "type": "Any"}, {"lineNumber": 231, "col_offset": 8, "nodeName": "_weight_map", "type": "Any"}, {"lineNumber": 231, "col_offset": 27, "nodeName": "value", "type": "Any"}, {"lineNumber": 277, "col_offset": 8, "nodeName": "image", "type": "Any"}, {"lineNumber": 295, "col_offset": 8, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 296, "col_offset": 11, "nodeName": "has_labels", "type": "Union[bool, Any]"}, {"lineNumber": 298, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Union[bool, Any]"}, {"lineNumber": 310, "col_offset": 8, "nodeName": "info", "type": "Any"}, {"lineNumber": 310, "col_offset": 20, "nodeName": "stopping_signal", "type": "Any"}, {"lineNumber": 46, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 47, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 48, "col_offset": 34, "nodeName": "tf", "type": "Any"}, {"lineNumber": 53, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 53, "col_offset": 29, "nodeName": "float", "type": "Type[float]"}, {"lineNumber": 53, "col_offset": 35, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 54, "col_offset": 15, "nodeName": "_spatial_rank", "type": "float"}, {"lineNumber": 54, "col_offset": 37, "nodeName": "SUPPORTED_SPATIAL_RANKS", "type": "Set[float]"}, {"lineNumber": 57, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 58, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 59, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 62, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 63, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 64, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 66, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 67, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 68, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 71, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 72, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 73, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 74, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 81, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 95, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 99, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 100, "col_offset": 19, "nodeName": "_label_size", "type": "Any"}, {"lineNumber": 105, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 106, "col_offset": 19, "nodeName": "_weight_map_size", "type": "Any"}, {"lineNumber": 115, "col_offset": 23, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 120, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 123, "col_offset": 12, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 124, "col_offset": 19, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 129, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 132, "col_offset": 12, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 133, "col_offset": 19, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 158, "col_offset": 29, "nodeName": "placeholder", "type": "Any"}, {"lineNumber": 161, "col_offset": 8, "nodeName": "append", "type": "Callable"}, {"lineNumber": 161, "col_offset": 33, "nodeName": "image_placeholders", "type": "Any"}, {"lineNumber": 165, "col_offset": 30, "nodeName": "tf", "type": "Any"}, {"lineNumber": 166, "col_offset": 28, "nodeName": "placeholder", "type": "Any"}, {"lineNumber": 169, "col_offset": 8, "nodeName": "append", "type": "Callable"}, {"lineNumber": 169, "col_offset": 33, "nodeName": "info_placeholders", "type": "Any"}, {"lineNumber": 172, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 180, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 186, "col_offset": 15, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 186, "col_offset": 21, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 191, "col_offset": 15, "nodeName": "_image", "type": "Any"}, {"lineNumber": 192, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 196, "col_offset": 15, "nodeName": "_info", "type": "Any"}, {"lineNumber": 197, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 201, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 202, "col_offset": 19, "nodeName": "_label", "type": "Any"}, {"lineNumber": 207, "col_offset": 11, "nodeName": "self", "type": "Any"}, {"lineNumber": 208, "col_offset": 19, "nodeName": "_weight_map", "type": "Any"}, {"lineNumber": 213, "col_offset": 15, "nodeName": "shape", "type": "Any"}, {"lineNumber": 214, "col_offset": 8, "nodeName": "self", "type": "Any"}, {"lineNumber": 218, "col_offset": 15, "nodeName": "shape", "type": "Any"}, {"lineNumber": 219, "col_offset": 8, "nodeName": "self", "type": "Any"}, {"lineNumber": 223, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 224, "col_offset": 15, "nodeName": "shape", "type": "Any"}, {"lineNumber": 225, "col_offset": 8, "nodeName": "self", "type": "Any"}, {"lineNumber": 229, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 230, "col_offset": 15, "nodeName": "shape", "type": "Any"}, {"lineNumber": 231, "col_offset": 8, "nodeName": "self", "type": "Any"}, {"lineNumber": 237, "col_offset": 15, "nodeName": "isinstance", "type": "Callable[[Any, Union[Type[Any], Tuple[Union[Type[Any], Tuple[Type[Any], ...]], ...]]], bool]"}, {"lineNumber": 237, "col_offset": 26, "nodeName": "img", "type": "Any"}, {"lineNumber": 237, "col_offset": 31, "nodeName": "ColumnData", "type": "Any"}, {"lineNumber": 238, "col_offset": 15, "nodeName": "ndim", "type": "Any"}, {"lineNumber": 240, "col_offset": 20, "nodeName": "array", "type": "Callable[..., numpy.ndarray]"}, {"lineNumber": 243, "col_offset": 11, "nodeName": "spatial_rank", "type": "float"}, {"lineNumber": 244, "col_offset": 37, "nodeName": "spatial_loc", "type": "Any"}, {"lineNumber": 248, "col_offset": 12, "nodeName": "image", "type": "Any"}, {"lineNumber": 267, "col_offset": 11, "nodeName": "spatial_rank", "type": "float"}, {"lineNumber": 269, "col_offset": 12, "nodeName": "z_", "type": "int"}, {"lineNumber": 271, "col_offset": 11, "nodeName": "spatial_rank", "type": "float"}, {"lineNumber": 274, "col_offset": 15, "nodeName": "_x", "type": "int"}, {"lineNumber": 275, "col_offset": 15, "nodeName": "_y", "type": "int"}, {"lineNumber": 276, "col_offset": 15, "nodeName": "z_", "type": "int"}, {"lineNumber": 277, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 277, "col_offset": 21, "nodeName": "data", "type": "Any"}, {"lineNumber": 278, "col_offset": 11, "nodeName": "has_labels", "type": "Union[bool, Any]"}, {"lineNumber": 279, "col_offset": 12, "nodeName": "diff", "type": "Any"}, {"lineNumber": 285, "col_offset": 11, "nodeName": "has_weight_maps", "type": "Union[bool, Any]"}, {"lineNumber": 286, "col_offset": 12, "nodeName": "diff", "type": "Any"}, {"lineNumber": 295, "col_offset": 20, "nodeName": "image", "type": "Any"}, {"lineNumber": 295, "col_offset": 32, "nodeName": "info", "type": "Any"}, {"lineNumber": 296, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 298, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 303, "col_offset": 16, "nodeName": "placeholders", "type": "Any"}, {"lineNumber": 310, "col_offset": 8, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 310, "col_offset": 20, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 313, "col_offset": 11, "nodeName": "info", "type": "Any"}, {"lineNumber": 315, "col_offset": 15, "nodeName": "all", "type": "Any"}, {"lineNumber": 54, "col_offset": 15, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 85, "col_offset": 16, "nodeName": "_label_size", "type": "Any"}, {"lineNumber": 86, "col_offset": 16, "nodeName": "_num_label_modality", "type": "Any"}, {"lineNumber": 90, "col_offset": 16, "nodeName": "_weight_map_size", "type": "Any"}, {"lineNumber": 91, "col_offset": 16, "nodeName": "_num_weight_map", "type": "Any"}, {"lineNumber": 100, "col_offset": 19, "nodeName": "self", "type": "Any"}, {"lineNumber": 106, "col_offset": 19, "nodeName": "self", "type": "Any"}, {"lineNumber": 114, "col_offset": 24, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 114, "col_offset": 45, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 115, "col_offset": 39, "nodeName": "_num_image_modality", "type": "Any"}, {"lineNumber": 123, "col_offset": 27, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 132, "col_offset": 27, "nodeName": "spatial_dims", "type": "Tuple[Any, ...]"}, {"lineNumber": 158, "col_offset": 29, "nodeName": "tf", "type": "Any"}, {"lineNumber": 158, "col_offset": 50, "nodeName": "_image_dtype", "type": "Any"}, {"lineNumber": 159, "col_offset": 50, "nodeName": "full_image_shape", "type": "Tuple[Any, ...]"}, {"lineNumber": 161, "col_offset": 8, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 166, "col_offset": 28, "nodeName": "tf", "type": "Any"}, {"lineNumber": 166, "col_offset": 49, "nodeName": "location_info_dtype", "type": "Any"}, {"lineNumber": 167, "col_offset": 49, "nodeName": "full_info_shape", "type": "Tuple[int]"}, {"lineNumber": 169, "col_offset": 8, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 173, "col_offset": 33, "nodeName": "placeholder", "type": "Any"}, {"lineNumber": 177, "col_offset": 12, "nodeName": "append", "type": "Callable"}, {"lineNumber": 177, "col_offset": 37, "nodeName": "label_placeholders", "type": "Any"}, {"lineNumber": 181, "col_offset": 38, "nodeName": "placeholder", "type": "Any"}, {"lineNumber": 185, "col_offset": 12, "nodeName": "append", "type": "Callable"}, {"lineNumber": 185, "col_offset": 37, "nodeName": "weight_map_placeholders", "type": "Any"}, {"lineNumber": 191, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 196, "col_offset": 15, "nodeName": "self", "type": "Any"}, {"lineNumber": 202, "col_offset": 19, "nodeName": "self", "type": "Any"}, {"lineNumber": 208, "col_offset": 19, "nodeName": "self", "type": "Any"}, {"lineNumber": 213, "col_offset": 15, "nodeName": "value", "type": "Any"}, {"lineNumber": 213, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 213, "col_offset": 36, "nodeName": "full_image_shape", "type": "Any"}, {"lineNumber": 218, "col_offset": 15, "nodeName": "value", "type": "Any"}, {"lineNumber": 218, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 218, "col_offset": 36, "nodeName": "full_info_shape", "type": "Any"}, {"lineNumber": 224, "col_offset": 15, "nodeName": "value", "type": "Any"}, {"lineNumber": 224, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 224, "col_offset": 36, "nodeName": "full_label_shape", "type": "Any"}, {"lineNumber": 230, "col_offset": 15, "nodeName": "value", "type": "Any"}, {"lineNumber": 230, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 230, "col_offset": 36, "nodeName": "full_weight_map_shape", "type": "Any"}, {"lineNumber": 238, "col_offset": 15, "nodeName": "data", "type": "Any"}, {"lineNumber": 240, "col_offset": 20, "nodeName": "np", "type": "module"}, {"lineNumber": 240, "col_offset": 29, "nodeName": "hstack", "type": "Any"}, {"lineNumber": 241, "col_offset": 35, "nodeName": "int64", "type": "Any"}, {"lineNumber": 243, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 244, "col_offset": 12, "nodeName": "x_", "type": "Any"}, {"lineNumber": 244, "col_offset": 16, "nodeName": "y_", "type": "Any"}, {"lineNumber": 244, "col_offset": 20, "nodeName": "z_", "type": "Any"}, {"lineNumber": 244, "col_offset": 24, "nodeName": "_x", "type": "Any"}, {"lineNumber": 244, "col_offset": 28, "nodeName": "_y", "type": "Any"}, {"lineNumber": 244, "col_offset": 32, "nodeName": "_z", "type": "Any"}, {"lineNumber": 245, "col_offset": 19, "nodeName": "_x", "type": "Any"}, {"lineNumber": 246, "col_offset": 19, "nodeName": "_y", "type": "Any"}, {"lineNumber": 247, "col_offset": 19, "nodeName": "_z", "type": "Any"}, {"lineNumber": 248, "col_offset": 12, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 248, "col_offset": 25, "nodeName": "data", "type": "Any"}, {"lineNumber": 249, "col_offset": 15, "nodeName": "has_labels", "type": "Union[bool, Any]"}, {"lineNumber": 250, "col_offset": 16, "nodeName": "diff", "type": "Any"}, {"lineNumber": 257, "col_offset": 15, "nodeName": "has_weight_maps", "type": "Union[bool, Any]"}, {"lineNumber": 258, "col_offset": 16, "nodeName": "diff", "type": "Any"}, {"lineNumber": 267, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 268, "col_offset": 12, "nodeName": "x_", "type": "int"}, {"lineNumber": 268, "col_offset": 16, "nodeName": "y_", "type": "int"}, {"lineNumber": 268, "col_offset": 20, "nodeName": "_x", "type": "int"}, {"lineNumber": 268, "col_offset": 24, "nodeName": "_y", "type": "int"}, {"lineNumber": 271, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 272, "col_offset": 12, "nodeName": "x_", "type": "int"}, {"lineNumber": 272, "col_offset": 16, "nodeName": "y_", "type": "int"}, {"lineNumber": 272, "col_offset": 20, "nodeName": "z_", "type": "int"}, {"lineNumber": 272, "col_offset": 24, "nodeName": "_x", "type": "int"}, {"lineNumber": 272, "col_offset": 28, "nodeName": "_y", "type": "int"}, {"lineNumber": 274, "col_offset": 21, "nodeName": "shape", "type": "Any"}, {"lineNumber": 275, "col_offset": 21, "nodeName": "shape", "type": "Any"}, {"lineNumber": 276, "col_offset": 20, "nodeName": "shape", "type": "Any"}, {"lineNumber": 277, "col_offset": 21, "nodeName": "img", "type": "Any"}, {"lineNumber": 278, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 278, "col_offset": 32, "nodeName": "seg", "type": "Any"}, {"lineNumber": 279, "col_offset": 19, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 279, "col_offset": 37, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 280, "col_offset": 19, "nodeName": "diff", "type": "Any"}, {"lineNumber": 281, "col_offset": 12, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 281, "col_offset": 17, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 282, "col_offset": 12, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 282, "col_offset": 25, "nodeName": "data", "type": "Any"}, {"lineNumber": 285, "col_offset": 11, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 285, "col_offset": 37, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 286, "col_offset": 19, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 286, "col_offset": 37, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 287, "col_offset": 19, "nodeName": "diff", "type": "Any"}, {"lineNumber": 288, "col_offset": 12, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 288, "col_offset": 17, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 290, "col_offset": 16, "nodeName": "data", "type": "Any"}, {"lineNumber": 295, "col_offset": 20, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 295, "col_offset": 32, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 297, "col_offset": 12, "nodeName": "append", "type": "Callable"}, {"lineNumber": 297, "col_offset": 28, "nodeName": "label", "type": "Any"}, {"lineNumber": 299, "col_offset": 12, "nodeName": "append", "type": "Callable"}, {"lineNumber": 299, "col_offset": 28, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 301, "col_offset": 19, "nodeName": "any", "type": "Callable[[Any], bool]"}, {"lineNumber": 302, "col_offset": 15, "nodeName": "len", "type": "Callable[[Sized], int]"}, {"lineNumber": 302, "col_offset": 19, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 302, "col_offset": 32, "nodeName": "len", "type": "Callable[[Sized], int]"}, {"lineNumber": 302, "col_offset": 36, "nodeName": "placeholders", "type": "Any"}, {"lineNumber": 303, "col_offset": 30, "nodeName": "tuple", "type": "Type[Tuple[Any, ...]]"}, {"lineNumber": 303, "col_offset": 36, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 307, "col_offset": 20, "nodeName": "ones", "type": "Any"}, {"lineNumber": 307, "col_offset": 28, "nodeName": "full_info_shape", "type": "Any"}, {"lineNumber": 314, "col_offset": 18, "nodeName": "ValueError", "type": "Type[ValueError]"}, {"lineNumber": 315, "col_offset": 15, "nodeName": "np", "type": "module"}, {"lineNumber": 315, "col_offset": 22, "nodeName": "info", "type": "Any"}, {"lineNumber": 315, "col_offset": 30, "nodeName": "stopping_signal", "type": "Any"}, {"lineNumber": 85, "col_offset": 16, "nodeName": "self", "type": "Any"}, {"lineNumber": 86, "col_offset": 16, "nodeName": "self", "type": "Any"}, {"lineNumber": 90, "col_offset": 16, "nodeName": "self", "type": "Any"}, {"lineNumber": 91, "col_offset": 16, "nodeName": "self", "type": "Any"}, {"lineNumber": 114, "col_offset": 24, "nodeName": "self", "type": "Any"}, {"lineNumber": 114, "col_offset": 49, "nodeName": "floor", "type": "Any"}, {"lineNumber": 114, "col_offset": 58, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 115, "col_offset": 39, "nodeName": "self", "type": "Any"}, {"lineNumber": 121, "col_offset": 28, "nodeName": "label_size", "type": "Any"}, {"lineNumber": 122, "col_offset": 28, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 123, "col_offset": 43, "nodeName": "_num_label_modality", "type": "Any"}, {"lineNumber": 130, "col_offset": 28, "nodeName": "weight_map_size", "type": "Any"}, {"lineNumber": 131, "col_offset": 27, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 132, "col_offset": 43, "nodeName": "_num_weight_map", "type": "Any"}, {"lineNumber": 148, "col_offset": 20, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 158, "col_offset": 50, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 159, "col_offset": 50, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 167, "col_offset": 49, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 173, "col_offset": 33, "nodeName": "tf", "type": "Any"}, {"lineNumber": 174, "col_offset": 22, "nodeName": "_label_dtype", "type": "Any"}, {"lineNumber": 175, "col_offset": 22, "nodeName": "full_label_shape", "type": "Optional[Union[Tuple[Optional[Any], ...], Tuple[Any, ...]]]"}, {"lineNumber": 177, "col_offset": 12, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 181, "col_offset": 38, "nodeName": "tf", "type": "Any"}, {"lineNumber": 182, "col_offset": 22, "nodeName": "_weight_map_dtype", "type": "Any"}, {"lineNumber": 183, "col_offset": 22, "nodeName": "full_weight_map_shape", "type": "Optional[Union[Tuple[Optional[Any], ...], Tuple[Any, ...]]]"}, {"lineNumber": 185, "col_offset": 12, "nodeName": "placeholders_list", "type": "List[Any]"}, {"lineNumber": 213, "col_offset": 36, "nodeName": "self", "type": "Any"}, {"lineNumber": 218, "col_offset": 36, "nodeName": "self", "type": "Any"}, {"lineNumber": 224, "col_offset": 36, "nodeName": "self", "type": "Any"}, {"lineNumber": 230, "col_offset": 36, "nodeName": "self", "type": "Any"}, {"lineNumber": 238, "col_offset": 15, "nodeName": "img", "type": "Any"}, {"lineNumber": 240, "col_offset": 29, "nodeName": "np", "type": "module"}, {"lineNumber": 240, "col_offset": 54, "nodeName": "spatial_loc", "type": "Any"}, {"lineNumber": 241, "col_offset": 35, "nodeName": "np", "type": "module"}, {"lineNumber": 245, "col_offset": 25, "nodeName": "shape", "type": "Any"}, {"lineNumber": 246, "col_offset": 25, "nodeName": "shape", "type": "Any"}, {"lineNumber": 247, "col_offset": 25, "nodeName": "shape", "type": "Any"}, {"lineNumber": 248, "col_offset": 25, "nodeName": "img", "type": "Any"}, {"lineNumber": 249, "col_offset": 15, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 249, "col_offset": 36, "nodeName": "seg", "type": "Any"}, {"lineNumber": 250, "col_offset": 23, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 250, "col_offset": 41, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 251, "col_offset": 23, "nodeName": "diff", "type": "Any"}, {"lineNumber": 252, "col_offset": 16, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 252, "col_offset": 21, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 252, "col_offset": 26, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 253, "col_offset": 16, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 253, "col_offset": 29, "nodeName": "data", "type": "Any"}, {"lineNumber": 257, "col_offset": 15, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 257, "col_offset": 41, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 258, "col_offset": 23, "nodeName": "image_size", "type": "Any"}, {"lineNumber": 258, "col_offset": 41, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 259, "col_offset": 23, "nodeName": "diff", "type": "Any"}, {"lineNumber": 260, "col_offset": 16, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 260, "col_offset": 21, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 260, "col_offset": 26, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 262, "col_offset": 20, "nodeName": "data", "type": "Any"}, {"lineNumber": 268, "col_offset": 31, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 268, "col_offset": 35, "nodeName": "c", "type": "Any"}, {"lineNumber": 268, "col_offset": 42, "nodeName": "c", "type": "Any"}, {"lineNumber": 268, "col_offset": 47, "nodeName": "spatial_loc", "type": "Any"}, {"lineNumber": 272, "col_offset": 34, "nodeName": "int", "type": "Type[int]"}, {"lineNumber": 272, "col_offset": 38, "nodeName": "c", "type": "Any"}, {"lineNumber": 272, "col_offset": 45, "nodeName": "c", "type": "Any"}, {"lineNumber": 272, "col_offset": 50, "nodeName": "spatial_loc", "type": "Any"}, {"lineNumber": 274, "col_offset": 21, "nodeName": "data", "type": "Any"}, {"lineNumber": 275, "col_offset": 21, "nodeName": "data", "type": "Any"}, {"lineNumber": 276, "col_offset": 20, "nodeName": "data", "type": "Any"}, {"lineNumber": 277, "col_offset": 30, "nodeName": "x_", "type": "int"}, {"lineNumber": 277, "col_offset": 33, "nodeName": "_x", "type": "int"}, {"lineNumber": 277, "col_offset": 37, "nodeName": "y_", "type": "int"}, {"lineNumber": 277, "col_offset": 40, "nodeName": "_y", "type": "int"}, {"lineNumber": 277, "col_offset": 44, "nodeName": "z_", "type": "int"}, {"lineNumber": 279, "col_offset": 19, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 279, "col_offset": 37, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 281, "col_offset": 24, "nodeName": "x_", "type": "int"}, {"lineNumber": 281, "col_offset": 29, "nodeName": "diff", "type": "Any"}, {"lineNumber": 281, "col_offset": 37, "nodeName": "y_", "type": "int"}, {"lineNumber": 281, "col_offset": 42, "nodeName": "diff", "type": "Any"}, {"lineNumber": 282, "col_offset": 25, "nodeName": "seg", "type": "Any"}, {"lineNumber": 286, "col_offset": 19, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 286, "col_offset": 37, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 288, "col_offset": 25, "nodeName": "x_", "type": "int"}, {"lineNumber": 288, "col_offset": 30, "nodeName": "diff", "type": "Any"}, {"lineNumber": 288, "col_offset": 38, "nodeName": "y_", "type": "int"}, {"lineNumber": 288, "col_offset": 43, "nodeName": "diff", "type": "Any"}, {"lineNumber": 290, "col_offset": 16, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 297, "col_offset": 12, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 297, "col_offset": 28, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 299, "col_offset": 12, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 299, "col_offset": 28, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 307, "col_offset": 20, "nodeName": "np", "type": "module"}, {"lineNumber": 307, "col_offset": 28, "nodeName": "self", "type": "Any"}, {"lineNumber": 315, "col_offset": 30, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 114, "col_offset": 49, "nodeName": "np", "type": "module"}, {"lineNumber": 114, "col_offset": 58, "nodeName": "self", "type": "Any"}, {"lineNumber": 121, "col_offset": 28, "nodeName": "self", "type": "Any"}, {"lineNumber": 122, "col_offset": 32, "nodeName": "floor", "type": "Any"}, {"lineNumber": 122, "col_offset": 41, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 123, "col_offset": 43, "nodeName": "self", "type": "Any"}, {"lineNumber": 130, "col_offset": 28, "nodeName": "self", "type": "Any"}, {"lineNumber": 131, "col_offset": 31, "nodeName": "floor", "type": "Any"}, {"lineNumber": 131, "col_offset": 40, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 132, "col_offset": 43, "nodeName": "self", "type": "Any"}, {"lineNumber": 148, "col_offset": 24, "nodeName": "spatial_rank", "type": "Any"}, {"lineNumber": 174, "col_offset": 22, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 175, "col_offset": 22, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 182, "col_offset": 22, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 183, "col_offset": 22, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 240, "col_offset": 41, "nodeName": "subject_id", "type": "Any"}, {"lineNumber": 245, "col_offset": 25, "nodeName": "data", "type": "Any"}, {"lineNumber": 246, "col_offset": 25, "nodeName": "data", "type": "Any"}, {"lineNumber": 247, "col_offset": 25, "nodeName": "data", "type": "Any"}, {"lineNumber": 248, "col_offset": 34, "nodeName": "x_", "type": "Any"}, {"lineNumber": 248, "col_offset": 37, "nodeName": "_x", "type": "Any"}, {"lineNumber": 248, "col_offset": 41, "nodeName": "y_", "type": "Any"}, {"lineNumber": 248, "col_offset": 44, "nodeName": "_y", "type": "Any"}, {"lineNumber": 248, "col_offset": 48, "nodeName": "z_", "type": "Any"}, {"lineNumber": 248, "col_offset": 51, "nodeName": "_z", "type": "Any"}, {"lineNumber": 250, "col_offset": 23, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 250, "col_offset": 41, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 252, "col_offset": 33, "nodeName": "x_", "type": "Any"}, {"lineNumber": 252, "col_offset": 38, "nodeName": "diff", "type": "Any"}, {"lineNumber": 252, "col_offset": 46, "nodeName": "y_", "type": "Any"}, {"lineNumber": 252, "col_offset": 51, "nodeName": "diff", "type": "Any"}, {"lineNumber": 252, "col_offset": 59, "nodeName": "z_", "type": "Any"}, {"lineNumber": 252, "col_offset": 64, "nodeName": "diff", "type": "Any"}, {"lineNumber": 253, "col_offset": 29, "nodeName": "seg", "type": "Any"}, {"lineNumber": 258, "col_offset": 23, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 258, "col_offset": 41, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 260, "col_offset": 33, "nodeName": "x_", "type": "Any"}, {"lineNumber": 260, "col_offset": 38, "nodeName": "diff", "type": "Any"}, {"lineNumber": 260, "col_offset": 46, "nodeName": "y_", "type": "Any"}, {"lineNumber": 260, "col_offset": 51, "nodeName": "diff", "type": "Any"}, {"lineNumber": 260, "col_offset": 59, "nodeName": "z_", "type": "Any"}, {"lineNumber": 260, "col_offset": 64, "nodeName": "diff", "type": "Any"}, {"lineNumber": 262, "col_offset": 20, "nodeName": "w_map", "type": "Any"}, {"lineNumber": 274, "col_offset": 21, "nodeName": "img", "type": "Any"}, {"lineNumber": 275, "col_offset": 21, "nodeName": "img", "type": "Any"}, {"lineNumber": 276, "col_offset": 20, "nodeName": "img", "type": "Any"}, {"lineNumber": 282, "col_offset": 34, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 283, "col_offset": 34, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 283, "col_offset": 64, "nodeName": "z_", "type": "int"}, {"lineNumber": 290, "col_offset": 27, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 291, "col_offset": 27, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 291, "col_offset": 62, "nodeName": "z_", "type": "int"}, {"lineNumber": 301, "col_offset": 24, "nodeName": "x", "type": "Any"}, {"lineNumber": 301, "col_offset": 38, "nodeName": "x", "type": "Any"}, {"lineNumber": 301, "col_offset": 43, "nodeName": "out_list", "type": "List[Any]"}, {"lineNumber": 122, "col_offset": 32, "nodeName": "np", "type": "module"}, {"lineNumber": 122, "col_offset": 41, "nodeName": "self", "type": "Any"}, {"lineNumber": 131, "col_offset": 31, "nodeName": "np", "type": "module"}, {"lineNumber": 131, "col_offset": 40, "nodeName": "self", "type": "Any"}, {"lineNumber": 148, "col_offset": 24, "nodeName": "self", "type": "Any"}, {"lineNumber": 245, "col_offset": 25, "nodeName": "img", "type": "Any"}, {"lineNumber": 246, "col_offset": 25, "nodeName": "img", "type": "Any"}, {"lineNumber": 247, "col_offset": 25, "nodeName": "img", "type": "Any"}, {"lineNumber": 253, "col_offset": 38, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 254, "col_offset": 29, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 255, "col_offset": 29, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 262, "col_offset": 31, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 263, "col_offset": 20, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 264, "col_offset": 20, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 282, "col_offset": 40, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 282, "col_offset": 58, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 283, "col_offset": 40, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 283, "col_offset": 58, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 290, "col_offset": 33, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 290, "col_offset": 56, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 291, "col_offset": 33, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 291, "col_offset": 56, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 253, "col_offset": 44, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 253, "col_offset": 62, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 254, "col_offset": 35, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 254, "col_offset": 53, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 255, "col_offset": 35, "nodeName": "label_size", "type": "Optional[Any]"}, {"lineNumber": 255, "col_offset": 53, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 262, "col_offset": 37, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 262, "col_offset": 60, "nodeName": "x_d", "type": "Any"}, {"lineNumber": 263, "col_offset": 26, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 263, "col_offset": 49, "nodeName": "y_d", "type": "Any"}, {"lineNumber": 264, "col_offset": 26, "nodeName": "weight_map_size", "type": "Optional[Any]"}, {"lineNumber": 264, "col_offset": 49, "nodeName": "z_d", "type": "Any"}, {"lineNumber": 283, "col_offset": 40, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 290, "col_offset": 33, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 291, "col_offset": 33, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 254, "col_offset": 35, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 255, "col_offset": 35, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 262, "col_offset": 37, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 263, "col_offset": 26, "nodeName": "self", "type": "ImagePatch"}, {"lineNumber": 264, "col_offset": 26, "nodeName": "self", "type": "ImagePatch"}]