[{"lineNumber": 3, "col_offset": 15, "nodeName": "object", "type": "Type[object]"}, {"lineNumber": 5, "col_offset": 4, "nodeName": "__init__", "type": "Callable[[Any, Any, Any, Any, Any], Any]"}, {"lineNumber": 11, "col_offset": 8, "nodeName": "input_image", "type": "Any"}, {"lineNumber": 11, "col_offset": 27, "nodeName": "input_image", "type": "Any"}, {"lineNumber": 12, "col_offset": 8, "nodeName": "target_image", "type": "Any"}, {"lineNumber": 12, "col_offset": 28, "nodeName": "target_image", "type": "Any"}, {"lineNumber": 13, "col_offset": 8, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 13, "col_offset": 26, "nodeName": "weight_map", "type": "Any"}, {"lineNumber": 14, "col_offset": 8, "nodeName": "target_note", "type": "Any"}, {"lineNumber": 14, "col_offset": 27, "nodeName": "target_note", "type": "Any"}, {"lineNumber": 16, "col_offset": 8, "nodeName": "input_interp_order", "type": "int"}, {"lineNumber": 17, "col_offset": 8, "nodeName": "target_interp_order", "type": "int"}, {"lineNumber": 11, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 12, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 13, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 14, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 16, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 17, "col_offset": 8, "nodeName": "self", "type": "CSVTable"}, {"lineNumber": 26, "col_offset": 12, "nodeName": "create_array_files_from_csv", "type": "Callable[..., Tuple[Optional[List[List[str]]], Optional[List[List[List[str]]]]]]"}, {"lineNumber": 26, "col_offset": 49, "nodeName": "input_image_file", "type": "Any"}, {"lineNumber": 26, "col_offset": 67, "nodeName": "allow_missing", "type": "Any"}, {"lineNumber": 28, "col_offset": 12, "nodeName": "create_array_files_from_csv", "type": "Callable[..., Tuple[Optional[List[List[str]]], Optional[List[List[List[str]]]]]]"}, {"lineNumber": 28, "col_offset": 49, "nodeName": "target_image_file", "type": "Any"}, {"lineNumber": 28, "col_offset": 68, "nodeName": "allow_missing", "type": "Any"}, {"lineNumber": 30, "col_offset": 12, "nodeName": "create_array_files_from_csv", "type": "Callable[..., Tuple[Optional[List[List[str]]], Optional[List[List[List[str]]]]]]"}, {"lineNumber": 30, "col_offset": 49, "nodeName": "weight_map_file", "type": "Any"}, {"lineNumber": 30, "col_offset": 66, "nodeName": "allow_missing", "type": "Any"}, {"lineNumber": 32, "col_offset": 12, "nodeName": "create_array_files_from_csv", "type": "Callable[..., Tuple[Optional[List[List[str]]], Optional[List[List[List[str]]]]]]"}, {"lineNumber": 32, "col_offset": 49, "nodeName": "target_note_file", "type": "Any"}, {"lineNumber": 32, "col_offset": 67, "nodeName": "allow_missing", "type": "Any"}, {"lineNumber": 26, "col_offset": 12, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 28, "col_offset": 12, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 30, "col_offset": 12, "nodeName": "misc_csv", "type": "module"}, {"lineNumber": 32, "col_offset": 12, "nodeName": "misc_csv", "type": "module"}]